{
    "1et6rgd": {
        "post": "What's something that no matter how it's explained to you, you just can't understand how it works?",
        "body": "",
        "user": "u/n0dust0llens",
        "comments": [
            {
                "text": "Space, it's so big that it is unfathomable and I think it's expanding?! Into what? How did it start? It's all a mindfuck ",
                "user": "u/VVinstonVVolfe"
            },
            {
                "text": "Electricity.",
                "user": "u/pvtguerra"
            },
            {
                "text": "How airplanes can be so big and heavy and fly",
                "user": "u/TangyCornIceCream"
            },
            {
                "text": "How my cat always knows exactly when I’m about to sit down with a snack",
                "user": "u/Gracelovey12"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Magnets. Don't understand how they have that physical force locked up in them. Seems to break the laws of physics or something. I don't trust them",
                "user": "u/minnesota2194"
            },
            {
                "text": "Quantum mechanics. No matter how many times it's explained, the idea that particles can exist in multiple states at once or influence each other instantaneously across vast distances just feels like nature's most elaborate inside joke that I'm not quite in on.",
                "user": "u/jane66x"
            },
            {
                "text": "**The stock market**.\n\nHow can it be possible for the value of an item to change so drastically? I understand supply and demand, but the large flunctuations are amazing.",
                "user": "u/britishmetric144"
            }
        ],
        "processed": true
    },
    "1ew56dj": {
        "post": "What difficult truths, the sooner you accept them, the better your life will be?",
        "body": "",
        "user": "u/Rare_Can_5418",
        "comments": [
            {
                "text": "That some people won't like you. And sometimes for no reason.",
                "user": "u/PurahsHero"
            },
            {
                "text": "There will always be someone better looking, better educated, younger, more experienced, more intelligent or wealthier than you. Do your best, live without regret, have empathy and kindness, give when you can, expecting nothing in return.Focus on your heart value more than what others have.",
                "user": "u/Realistic_River_868"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "You can do your best with someone and still be the villain in their story.",
                "user": "u/gathee"
            },
            {
                "text": "There are many things that are out of your control.",
                "user": "u/ChicodePolonia"
            },
            {
                "text": "This is more of a saying, but I feel it helps shed light on a few things: \"we judge ourselves by our intentions. We judge others by their actions.\"\n\n\nIOW people are going to look at you for what you do and your intentions are mostly irrelevant.",
                "user": "u/Knight_Owls"
            },
            {
                "text": "you can only help people who actually want it. If they’re not ready to change or put in the effort, there’s not much you can do. Realizing this can save you a lot of frustration and help you focus on people who actually appreciate your help",
                "user": "u/GoldenGlimmer2"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Just because you're right, doesn't mean people will agree with you and might work against you either way.\n\nMy wife struggles with this.  She has an idea that works and gets the company more money, but the owner and other workers are against it because they disagree with it.  Even with the evidence that it works better for them financially.  \n\nAll the data in the world won't change the mind of a person who won't listen.",
                "user": "u/outerproduct"
            },
            {
                "text": "Things are just things. They don’t have feelings. They don’t care if you give them away or sell them or throw them out. If a thing is useful, keep it. If not, get rid of it.",
                "user": "u/bowlbettertalk"
            },
            {
                "text": "You can’t change the past, but you can decide what to do next.",
                "user": "u/SexyAngelbabe012"
            }
        ],
        "processed": true
    },
    "1eryhlk": {
        "post": "What’s a social habit everyone seems to accept but you find really annoying?",
        "body": "",
        "user": "u/spacewalkerstarfield",
        "comments": [
            {
                "text": "When people don't understand that listening is the most important part of the conversation.",
                "user": "u/mrp0013"
            },
            {
                "text": "Not everything has to be filmed.",
                "user": "u/CraftyAttitude1321"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "People congregating in doorways, particularly when there is plenty of non-doorway space available",
                "user": "u/Oil8524"
            },
            {
                "text": "people who stop in the middle of a busy walkway to check their phones. it's like they think they've hit pause on the world.",
                "user": "u/NotBeginningAnew"
            },
            {
                "text": "Kids blasting whatever TV show on their iPads in the middle of a restaurant while I’m trying to eat. The kids can watch whatever but somebody teach them to use headphones.",
                "user": "u/SecretProgramor"
            },
            {
                "text": "Filming strangers. It's one thing if you're just taking a holiday snap or something and there's people in the background but actually pointing your camera at strangers without consent solely for the purpose of making videos of them to post online is not cool. I get it's legal to do so in most public places.",
                "user": "u/beesandsids"
            },
            {
                "text": "Being expected to be constantly available via social media chat, text, call at any & all hours. If you try to ‘opt out’ it’s seen as weird or antisocial.",
                "user": "u/p0ndfaerie"
            },
            {
                "text": "Being on your phone while having an in person conversation with someone. Like hello, I’m right here not in your screen!",
                "user": "u/Hot_Potential_5732"
            }
        ],
        "processed": true
    },
    "1euru0m": {
        "post": "What dead celebrity would absolutely hate their current fan base? ",
        "body": "",
        "user": "u/DrunkenSkunkApe",
        "comments": [
            {
                "text": "Confucius. \n\nHe'd walk around all day saying, \"I DIDN'T SAY THAT\"",
                "user": "u/NorwalkAvenger"
            },
            {
                "text": "Alexander Hamilton would be very, very confused.",
                "user": "u/DomingoLee"
            },
            {
                "text": "Sir Arthur Conan Doyle.\n\n“WHAT DO YOU MEAN SHERLOCK HOLMES IS STILL POPULAR!?!”",
                "user": "u/StanDaMan1"
            },
            {
                "text": "Nietzsche. In fact, I would guess a lot of philosophers would feel frustrated with how badly they have been reinterpreted.",
                "user": "u/allmybadthoughts"
            },
            {
                "text": "Probably Frida Kahlo. I don’t think she’d be a huge fan of her likeness on everything from socks to the side of an apartment building I saw the other day.",
                "user": "u/andreaxtina"
            },
            {
                "text": "Nikola Tesla",
                "user": "u/artesre"
            },
            {
                "text": "Bob Marley",
                "user": "u/Adorable-Writing3617"
            },
            {
                "text": "George Carlin. He gets quoted by people who he’d despise.",
                "user": "u/Waste-knot"
            },
            {
                "text": "Marilyn Monroe would despise the Tumblr girls who use that fake quote \"if you can't handle me at my worst\" that she never actually said",
                "user": "u/dauntless91"
            },
            {
                "text": "Hunter Thompson would take a 5 minute glance around and shoot himself again.",
                "user": "u/Aggressive_Day2839"
            },
            {
                "text": "George Carlin would absolutely abhor seeing some of these people quoting him",
                "user": "u/nickl104"
            }
        ],
        "processed": true
    },
    "1eukjes": {
        "post": "Men of reddit, what is a 100% myth about men? ",
        "body": "",
        "user": "u/booksmylove",
        "comments": [
            {
                "text": "Thinking someone is attractive is not the same as wanting to sleep/pursue a relationship with someone.",
                "user": "u/antlerpanda"
            },
            {
                "text": "You can change something about me that I don’t want to. ",
                "user": "u/maddieterrier"
            },
            {
                "text": "We’re all car fanatics. I don’t know a thing about cars",
                "user": "u/pizzagamer35"
            },
            {
                "text": "We're fine..",
                "user": "u/Trick-Possesion684"
            },
            {
                "text": "I'm not \"babysitting\" when I'm with my daughter; I'm being a father.",
                "user": "u/Caradepacman123"
            },
            {
                "text": "That men don't want or need compliments. That men don't cry. That men have to \"man up and deal\" with hard things. That men prefer to pursue over being pursued.\n\nMen crave all the same emotional/mental stimulation that is generally associated with women, society just tells us we shouldn't want or need them.",
                "user": "u/WoWLaw"
            },
            {
                "text": "Erections are not consent.",
                "user": "u/bobbery5"
            }
        ],
        "processed": true
    },
    "1etu6ic": {
        "post": "What's hard about dating you?",
        "body": "",
        "user": "u/Routine-Award-3382",
        "comments": [
            {
                "text": "i'm terrible at opening up and communicating about my needs.",
                "user": "u/Realistic-Cow-3140"
            },
            {
                "text": "I create delusional scenarios in my mind",
                "user": "u/Puzzlehead_k"
            },
            {
                "text": "When I have a bad day I don't want to talk to anyone. I don't want to be helped either. I just want to exist in silence for a while",
                "user": "u/SenhorSus"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Dealing with my low self esteem",
                "user": "u/UselessAndUnlovable"
            },
            {
                "text": "Sometimes I need extended periods alone.",
                "user": "u/Missgrumpy00"
            },
            {
                "text": "I don’t love myself yet.",
                "user": "u/No-Mind5337"
            },
            {
                "text": "I don't talk when I'm angry. I always need some time before I can open up what's my problem.",
                "user": "u/Unlikely-Ad-2855"
            },
            {
                "text": "My anxiety",
                "user": "u/Haunting-Employ3307"
            },
            {
                "text": "I am told I can't accept someone's own different way of love. That I only know and understand one way, and not appreciate or acknowledge other ways",
                "user": "u/cold_conclusion8147"
            },
            {
                "text": "I enjoy my time alone very much.",
                "user": "u/Charlie_NLG"
            }
        ],
        "processed": true
    },
    "1ert1mo": {
        "post": "What’s the worst thing an american president has ever done?",
        "body": "",
        "user": "u/TheAXCLord",
        "comments": [
            {
                "text": "On a personal level?\n\nGrover Cleveland groomed his wife from infancy.  He met her when she was a literal baby, bought her baby gifts through her childhood, and when her father died (she was 11) Cleveland became her formal guardian.\n\nThe girl's mother actually thought that Cleveland was courting her as an eligible widow, but that notion was quickly dissuaded when Cleveland's attentions were almost entirely directed at her daughter.  \n\nThey were married 10 years later, when he was 49 and she was 21.",
                "user": "u/Milocobo"
            },
            {
                "text": "Andrew Johnson’s undermining post-Civil War Reconstruction has caused cumulative and enduring damage to the United States. Measured in terms of the immensity and duration of harm he is the worst not just by miles, but by galaxies.",
                "user": "u/Chispacita"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Probably that native American ethnic cleansing Andrew Jackson did.",
                "user": "u/Sleepy_Senju"
            },
            {
                "text": "Andrew Jackson- Trail of Tears. Case closed.",
                "user": "u/chakrablockerssuck"
            },
            {
                "text": "Using chemicals like Agent Orange in Vietnam was really horrendous",
                "user": "u/Shifisu"
            },
            {
                "text": "IIRC Andrew Jackson killed a lot of Indians. Like, a lot.",
                "user": "u/LeavesOfBrass"
            },
            {
                "text": "Andrew Jackson's trail of tears",
                "user": "u/Bardlie"
            }
        ],
        "processed": true
    },
    "1etfes3": {
        "post": "[Serious] What was said, that forever changed your relationship with someone?",
        "body": "",
        "user": "u/YoungJack23",
        "comments": [
            {
                "text": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies.\n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
                "user": "u/AutoModerator"
            },
            {
                "text": "About a year into our marriage and after I had moved across the world for them and left everything I’d ever known: “the more I get to know you, the less I like you.”\n\nI am ashamed to say it took 3 more years before we were done.\n\nEDIT:\nI did NOT expect this comment to blow up! Was pretty buzzed when I originally posted it, too, so here’s some edits/updates.\n\n- It took 4 more years, not 3.\n\n- He made the decision to call it quits… which makes me feel even more ashamed, in a way. However, after the first days of just complete shock, I felt incredibly free. His decision forced me to give up on the idea that somewhere deep inside of him he still had a resemblance of the man I fell in love with.\n\n- I did of course let him know that his comment really hurt my feelings. He just doubled down on why he felt that way and why he had a right to tell me.\n\n- Only afterwards did I realize the kind of abuse this man put me through. It is almost impossible to recognize it while you’re in the midst of it, especially when it escalates so gradually.\n\n- To everyone replying with your kind comments: thank you so much! It has been just over a year and I am indeed thriving now :) And he definitely is not.\n\n- To everyone who is in a similar situation: it may seem overwhelming and impossible to get out. It may feel like it’ll be the hardest thing you’ll ever do. Just know that it will NEVER be harder than staying.",
                "user": "u/fitnessnfrenchfries"
            },
            {
                "text": "In my late 20s I was thinking about going to college, but I was afraid I was too old. Someone said to me, \"Next year you will be older.\" I applied the next day.",
                "user": "u/Cosimia1964"
            },
            {
                "text": "My mother told me that she believed that I hate her while I was at her house giving her money because she needed help to get through the week. I can still feel the hole that statement left in my heart.",
                "user": "u/P0ncle"
            },
            {
                "text": "My father said \"yes I know and I don't support you.\" (I will never forget those words) when I told him that I filed a police report on the man who molested me as a child. \n\nHe didn't even look like the same man to me the next time I saw him.",
                "user": "u/billymackactually"
            },
            {
                "text": "For 3 years, someone and I worked together side by side and developed a close friendship. One day I got promoted to manager and became his boss. He threw a tantrum and screamed for hours, then refused to talk to me (Now his boss) for three days.\n\nWhen I finally scheduled a one on one meeting, he told me \"My sole job now is to make it clear they made the wrong decision. It's in my best interest to make sure that you fail.\"\n\nI tried for about a month to make it work, but eventually he had to be let go.\n\nThat was the end of that friendship.",
                "user": "u/muscledhunter"
            },
            {
                "text": "My mom was dying. A friend told me \"you have your whole life to freak out about this-- *don't do it in front of her.* \"\n\nIt really helped me to understand that my feelings are not always what's important. It IS possible to delay a freakout, and that skill has served me innumerable times.",
                "user": "u/SweetheartAndSin"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "I was in the car with my dad, I was about 40, and he said “Out of all my children, you are the most intelligent, but also the greatest disappointment “. Just out of the blue, like he was talking about the weather.",
                "user": "u/CartographerKey7322"
            }
        ],
        "processed": true
    },
    "1euo85k": {
        "post": "Brits of Reddit, now that it’s been a few years, has Brexit been a success?  Why or why not? ",
        "body": "",
        "user": "u/accountname789",
        "comments": [
            {
                "text": "Brexit destroyed my online business. I got a lot of orders from Europe. Brexit went through.  Now they have to pay import fees that they never had to pay before and then eventually VAT that they never had to pay before.   \nThey didn't want to pay all of that extra stuff so they stopped ordering. My sales went down, down, down until I had to close my shops.",
                "user": "u/jaime4brienne"
            },
            {
                "text": "Brexit has:\n\n- Increased queues for Brits at airports in Europe as we must now be subject to additional checks and have our passports stamped. It has also limited stays to 90 days in 180. \n\n- Reduced opportunities for people from England, Scotland and Wales to live, work, study and retire freely across our own continent. Northern Irish citizens retain these benefits since they can apply for an Irish Passport. \n\n- Contributed to labour shortages in key industries such as hospitality, farming, health and social care DESPITE record levels of immigration from the rest of world. \n\n- Added administrative bureaucracy for importers and exporters, widening our trade deficit and reducing business investment and foreign direct investment.\n\nFor any Brit who wishes to…\n\nLive in the EU*, \nWork in the EU,\nStudy in the EU,\nTravel for longer than 90 days in the EU,\nExport to the EU,\nImport from the EU \n\nThings are definitely, objectively, worse.\n\n*EU/EEA",
                "user": "u/Known_Cheesecake2036"
            },
            {
                "text": "Brexit was probably the biggest influence on why my business ultimately failed.  \n\nGoods and supplies I needed became incredibly expensive to acquire from the EU. In some cases, my suppliers stopped shipping to the UK altogether.\n\nAnd for me to ship my goods in the other direction into the EU, it became more expensive and complicated to deal with.\n\nI lost a massive chunk of business and all of the convenience of trading in the EU overnight.\n\nSo I'm my eyes,  Brexit is a complete failure",
                "user": "u/darth-small"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "One of the reasons people voted for Brexit was to stop immigration. Last year we had 700k net migration. Doesn't sound like a great success to me.",
                "user": "u/mymokiller"
            },
            {
                "text": "Brexit assisted with the downfall of my business. So if you ask me, no.",
                "user": "u/Viazon"
            },
            {
                "text": "In terms of actual impact on a normal person, all Brexit has done for me is:\n\n- Makes it more expensive or difficult to buy things from Europe. Lots of places now won't even do UK shipping.\n- Makes it more difficult to travel to Europe\n\nIn my jobs\n- In the hospital lab, we had a big old hoo-ha because all our equipment is provided by Roche, which is a swiss company and all the stuff we buy has to move through Europe. \nThere was a brief period where a warehouse moved that caused us to be unable to provide blood tests for anything but the most urgent cases. There was additional faffing about with German companies over import taxes and such that caused us a shortage of other materials. All sorted now, but it was a tense few months. \n\n\n- At the university lab, in addition to above difficulties with suppliers, getting kicked out of the EUs Horizons program lopped a huge amount of funding out from British science. Numbers of EU students have also dropped, so now because of the drop in funding  our financial department is cracking down hard. \nThis leads to ridiculous situations like having to go get 3 alternative quotes for a piece of machinery that is only manufactured by a single company, even when your grant is specifically for that machine.",
                "user": "u/Hayred"
            },
            {
                "text": "Depends\n\nThose who voted brexit to reduce immigration are disappointed that it has only deterred EU migrants who are mostly white and nominally christian and that migration from other places has been unaffected\n\nThose who voted brexit because they believed the side of a bus that said there'd be more money for the NHS are disappointed to see much more money than that spaffed away by Truss and Kwarteng or syphoned off to give to politicians and their cronies\n\nThose who voted brexit because of \"Brussels bureaucrats\" were never able to properly explain what they meant by that anyway. \n\nThen there's those like that fella from Wetherspoons who supported brexit for reasons known only to himself and has seen his business hit by the lack of cheap euro labour. They aren't particularly happy.\n\nBut those who promoted and voted brexit to dodge european measures against tax avoidance or because they saw opportunities to get rich at the expense of the british tax payer, well some of those ones are happy.",
                "user": "u/DripDry_Panda_480"
            },
            {
                "text": "Migration from other places has greatly increased: legal migration has trebled and illegal migration up 10x. Our withdrawal from the Dublin convention has meant that we can no longer return illegal migrants to the last EU country they passed through.",
                "user": "u/azw413"
            },
            {
                "text": "I think it says a lot that Farage, Johnson etc al aren't shouting about how they made it happen any more.",
                "user": "u/watchman28"
            },
            {
                "text": "Speaking as someone from Northern Ireland, Brexit has done two good things for us: The Windsor Framework which keeps us under some of the EU Rules and allows us to trade in both the UK and EU markets which makes us a prime spot for investment and it has also speed up the talk of a United Ireland as well",
                "user": "u/Lie_Diligent"
            }
        ],
        "processed": true
    },
    "1ety0a0": {
        "post": "What worrisome trend in society are you beginning to notice?",
        "body": "",
        "user": "u/[deleted]",
        "comments": [
            {
                "text": "Ads in the comment section",
                "user": "u/PatheticGirl46"
            },
            {
                "text": "Believing all the advice given in tiktoks or instagram videos without doing any research\n\nEdited to add: Reddit, Facebook, podcasts. Literally all social media platforms.",
                "user": "u/Sufficient-Citron936"
            },
            {
                "text": "Total lack of awareness of other people, see it on the roads, in supermarkets etc. People have become zombies, or selfish",
                "user": "u/stever71"
            },
            {
                "text": "Media literacy seems close to nonexistent.",
                "user": "u/Talismato"
            },
            {
                "text": "Lack of critical thinking",
                "user": "u/Shadow948"
            },
            {
                "text": "People believing everything they see on social media.",
                "user": "u/ImaginationMajor5062"
            },
            {
                "text": "everyone is so mean ☹️",
                "user": "u/apresonly"
            },
            {
                "text": "The quality of education going down",
                "user": "u/TeodoroCano"
            }
        ],
        "processed": true
    },
    "1evkcrp": {
        "post": "What is a thing that isnt taken seriously but it actually should?",
        "body": "",
        "user": "u/Ilove_gaming456",
        "comments": [
            {
                "text": "Stress",
                "user": "u/No_Angle875"
            },
            {
                "text": "The current state of education. \n\nI realize that yeah it's a big topic but it feels like it's brushed off so quickly as like \"welp what can you do?\"",
                "user": "u/anonymooseuser6"
            },
            {
                "text": "Dental hygiene",
                "user": "u/Carl-99999"
            },
            {
                "text": "Constant pain in your body. It be taken seriously to avoid more complications in the future. You never there could be an underlying condition with those pains.",
                "user": "u/SweetGirlCutie"
            },
            {
                "text": "Shopping addiction. It sounds crazy until you deal with it.",
                "user": "u/JuggernautScary7026"
            },
            {
                "text": "Collapsing insect populations",
                "user": "u/downvotedbylife"
            },
            {
                "text": "taking breaks seriously can actually boost productivity and well-being",
                "user": "u/SnowGamerJourney70"
            }
        ],
        "processed": true
    },
    "1es5iph": {
        "post": "What are signs that you might not be as attractive as you believe?",
        "body": "",
        "user": "u/Waste_Cup7237",
        "comments": [
            {
                "text": "Target checkout cameras.",
                "user": "u/HiVi48"
            },
            {
                "text": "Without info, people assume you're single.",
                "user": "u/UltimateWaluigi"
            },
            {
                "text": "You have to make a certain face when you look in the mirror.",
                "user": "u/Substantial-Rub1571"
            },
            {
                "text": "ive straight been told by an ex,  \"you aren't hot enough to be this much of an asshole\"    So that I guess.",
                "user": "u/iceplusfire"
            },
            {
                "text": "Nobody looks at you or acknowledges you. If you don’t insert yourself into social situations you aren’t seen unless someone needs something from you.",
                "user": "u/Mr_Mediator"
            },
            {
                "text": "Always being told you look tired",
                "user": "u/passthedrink"
            },
            {
                "text": "Feeling like a ghost.",
                "user": "u/beccacee"
            },
            {
                "text": "You hear, “there’s somebody out there for everyone” a lot",
                "user": "u/Zahfier"
            },
            {
                "text": "people just don't pay as much attention to you",
                "user": "u/cumwithmehunny"
            },
            {
                "text": "automatic doors never open for you.",
                "user": "u/rainbowroobear"
            }
        ],
        "processed": true
    },
    "1ewwetf": {
        "post": "What's something you only understand if you have lived it?",
        "body": "",
        "user": "u/mrbigglesworthjr",
        "comments": [
            {
                "text": "One thing that’s hard to truly understand unless you’ve lived it is the experience of deep grief. Whether it's losing a loved one, going through a major life change, or dealing with any kind of profound loss, the emotions that come with it can be incredibly complex and overwhelming.",
                "user": "u/valentinarozee"
            },
            {
                "text": "Being in a warzone in any capacity.",
                "user": "u/primal_machine_22109"
            },
            {
                "text": "chronic pain. you’ve experienced pain before, so you think you get it, but nothing prepares you for when pain becomes your new baseline normal",
                "user": "u/confusedaboutdoctors"
            },
            {
                "text": "Poverty",
                "user": "u/frakas21"
            },
            {
                "text": "Chronic illness and disability",
                "user": "u/Lower-Ad-6293"
            },
            {
                "text": "The mindfuckery of addiction.",
                "user": "u/ImACavediver"
            },
            {
                "text": "Having a child die.",
                "user": "u/JCKligmann"
            },
            {
                "text": "frozen in time grief and grieving someone who is still alive",
                "user": "u/Ok_Humor7323"
            },
            {
                "text": "Feeling suicidal",
                "user": "u/Late-Republic2732"
            },
            {
                "text": "Being sexually abused as a child",
                "user": "u/Honest_Offer9406"
            }
        ],
        "processed": true
    },
    "1ewqoq6": {
        "post": "Single people, why are you single?",
        "body": "",
        "user": "u/ArdeParis",
        "comments": [
            {
                "text": "I don't know how to meet people anymore.",
                "user": "u/Kesooonya"
            },
            {
                "text": "Because I don't leave my house, I guess",
                "user": "u/AiditaBelle"
            },
            {
                "text": "Too introverted to approach someone, not good looking enough to be approached by someone.",
                "user": "u/SuchMathematician805"
            },
            {
                "text": "I'm single by choice, just not my choice 😭",
                "user": "u/RC414"
            },
            {
                "text": " I'm not really actively trying anymore. Years of rejections doesn't do wonders for the self-confidence. But I am comfortable being alone. I'm not super bothered by it, it's how it's always been for me..",
                "user": "u/ArmyUnpleasant7605"
            },
            {
                "text": "I'm a woman in my 70s, I've been married twice. First marriage  was awful, and I stayed single for 20 years but my second husband was a wonderful man.\n\n\nI lost him 2 years ago to cancer. \n\n\nThe cat and I are doing very well together.  I'm not interested in marrying again, because in my generation the men expect to be waited on and cleaned up after and catered to. Even the really good ones, like my Lou. But they will do yard work. \n\n\nMy house is clean, there are no wet towels on the floor , there are no dirty dishes scattered around the house, the dirty clothes are in the hamper, anything I put down is where I left it unless the cat pushes it to the floor, and I eat when I'm hungry instead of on a set schedule. \n\n\nAnd I have a lawn tractor for my acre of land. \n\n\nI have lots of women friends and many are widows, we have a lot of fun together. \n\n\nSingle works really well for me. Cats are easier and a lot less work than men. ",
                "user": "u/Any_Assumption_2023"
            },
            {
                "text": "I spend all my time arguing with the internet.",
                "user": "u/Vegan_Harvest"
            },
            {
                "text": "Being single is so peaceful",
                "user": "u/Local-Bass-5646"
            },
            {
                "text": "Depression.",
                "user": "u/lan60000"
            },
            {
                "text": "In the wise words of George Costanza: Oh, what's the point? When I like them, they don't like me. When they like me, I don't like them",
                "user": "u/grantrules"
            },
            {
                "text": "The people I’m interested in aren’t interested in me",
                "user": "u/Jimster1995"
            }
        ],
        "processed": true
    },
    "1essfcc": {
        "post": "What's a series that you can repeat every once in a while?",
        "body": "",
        "user": "u/Psytrancedude99",
        "comments": [
            {
                "text": "Band of brothers, at least once a year typically around Christmas",
                "user": "u/Tyrionsnow"
            },
            {
                "text": "Psych\n\nArcher - though this is more than once in a while. \n\nFuturama",
                "user": "u/SuperstitiousPigeon5"
            },
            {
                "text": "South Park",
                "user": "u/InternationalTest638"
            },
            {
                "text": "Arrested Development. It has so many quick fire jokes and intelligent depth while being silly and ridiculous.",
                "user": "u/wafflequest"
            },
            {
                "text": "Stargate",
                "user": "u/LadaOndris"
            },
            {
                "text": "I re watch Gravity Falls every once in a while when I'm in a bad mental place. Honestly a brilliant and fun show.",
                "user": "u/boxlessthought"
            },
            {
                "text": "Cowboy Bebop (1998)",
                "user": "u/squiddy-19"
            },
            {
                "text": "Grimm, it was cheesy in some places, but it knew what it was and had fun with it",
                "user": "u/silentdrestrikesback"
            },
            {
                "text": "The Americans. So many rich characters and subtleties to pick up on re-watches.",
                "user": "u/susysyay"
            },
            {
                "text": "The Sopranos.",
                "user": "u/TheGayGaryCooper"
            }
        ],
        "processed": true
    },
    "1ev2ou0": {
        "post": "What moment made you realise your gf/bf would never be your wife/husband? ",
        "body": "",
        "user": "u/Itsemmaxx",
        "comments": [
            {
                "text": "When we finally got into deep talks about how we viewed our futures and I realized our goals didn’t align.",
                "user": "u/Curious-Air4196"
            },
            {
                "text": "He couldn’t handle any serious conversation. Every time I brought up the future, he’d just joke around or change the subject. It made me realize he wasn’t in it for the long haul.",
                "user": "u/Perfect_ladybabe122"
            },
            {
                "text": "When we were looking for places to rent/buy for a home and she absolutely refused to compromise on where we'd be living. It's a long story, but her reasoning in that moment told me all I really needed to know about where I was placed as importance in her mind",
                "user": "u/Cyanora"
            },
            {
                "text": "When she asked her friend to flirt with me to test me.",
                "user": "u/Nelson4ay59"
            },
            {
                "text": "When I met her dad. \n\nI couldn't stand the man and I knew I couldn't put up with him for the rest of one of our lives. I tried extremely hard to stay with her but anytime we went to a family event or holiday it made me die a little inside. When we talked about our future she always said she wanted to live close to him. The thought of him being a grandfather to any possible kids we would have had sealed the deal and I had to call it off.\n\nEdit: Thanks for all the support and DMs, didn't expect that! For those asking we were together for 3 years, met during first year of college, and I met her dad about 6 months into the relationship for the first time at Christmas.",
                "user": "u/MoldyOldCrow"
            },
            {
                "text": "I don't want to trauma-dump, so I'll leave it at this: pay attention to how they treat you when you are physically unwell and reliant on them.",
                "user": "u/KittyCamino"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "He tried to control everything I did. He told me I couldn't go over to my friends house after school because \"he didn't trust them\", I couldn't babysit anymore because \"I need to be inside my house by 6pm every night\", I couldn't wear pink, red, or purple anymore and I could only wear long pants and turtleneck shirts as \"I need to dress modestly \".\n\nNot only did I NOT obey him, but even he came to my house before school, he told me, in front of my dad, that I had to change my clothes.  I was sent out of the room, and 23 years later, I'm still not sure what my dad said to him, but all his crazy demands stopped and I broke up with him a few weeks later.",
                "user": "u/SassyCatLady442"
            }
        ],
        "processed": true
    },
    "1ew4iag": {
        "post": "For those of you who grinded hard in your twenties, how did it pay off?",
        "body": "",
        "user": "u/FU2LUTHER",
        "comments": [
            {
                "text": "Startup didn’t pan out, never made my millions, now divorced after not putting that energy into my relationship instead. Don’t hate the hustle, but diversify your efforts.",
                "user": "u/veredox"
            },
            {
                "text": "\"When I was young, I was very poor.  Now after a lifetime of hard work and sacrifice, I am no longer young\"",
                "user": "u/Badaxe13"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Got me enough money to afford a down payment on a house just before the boom.",
                "user": "u/Vic_Hedges"
            },
            {
                "text": "[Thunderfury, Blessed Blade of the Windseeker]",
                "user": "u/basedlandchad27"
            },
            {
                "text": "Well now you have a very good income and you are not living at your parents' house.",
                "user": "u/littleangelmoon68"
            },
            {
                "text": "More freedom and financial stability.",
                "user": "u/MysticcWaves"
            },
            {
                "text": "I regret it, from a social angle. I worked full-time, straight from graduating college. No breaks. My friends took time to travel, etc. Now, in our mid-30s, we're now all settled in to careers, with spouses and kids -- but I've missed out on the travel and sowing of wild oats.",
                "user": "u/simongurfinkel"
            },
            {
                "text": "Exhausted.\n\nOne thing people don’t remind you is that people that you love age and get more sick. I was laser focused onto my career that I didn’t notice my family members getting sick until it was too late. \n\nI’m closing into my thirties but I already wish I could have spent more time with my family and not worry about my career so much.",
                "user": "u/Tabacia_bemisia"
            },
            {
                "text": "I worked hard but didn't save well. I am okay in my 40s. Not rich but not poor either. Own a house and got a nice retirement lined up.\n\nI know people in my 40's who earned a lot more then me in their 20's and are now homeless. All comes down to moderation.",
                "user": "u/MyLandIsMyLand89"
            }
        ],
        "processed": true
    },
    "1ewhtcr": {
        "post": "What is illegal but is done so much it feels legal?",
        "body": "",
        "user": "u/SPplayin",
        "comments": [
            {
                "text": "Speeding in vehicles",
                "user": "u/AgitatedPatience5729"
            },
            {
                "text": "Where I live… people running red lights. Blatantly running red lights that have been red for seconds. My son and I were almost t-boned a few weeks ago.",
                "user": "u/PsychFlower28"
            },
            {
                "text": "That stuff my neighbours keep smoking.",
                "user": "u/spacebuggles"
            },
            {
                "text": "downloading pirated movies, games, digital products for free...",
                "user": "u/Slutty_Ladybabe12"
            },
            {
                "text": "I think it is worth mentioning that the most commonly committed crime in the US is wage theft. That means employers stealing from their employees, in various ways, is the most common crime out there.",
                "user": "u/toadjones79"
            },
            {
                "text": "Jaywalking. \n\nIt’s illegal where I live to cross the road if your within 30m of a pedestrian crossing or traffic lights with a pedestrian cycle. \n\nEveryone does it.",
                "user": "u/Christopher135MPS"
            },
            {
                "text": "Android users know the deal—why pay when you can just grab the APK for free?",
                "user": "u/HOttie_babe97"
            },
            {
                "text": "Underaged drinking",
                "user": "u/Sexy_Ass2112"
            },
            {
                "text": "Yielding at a stop sign",
                "user": "u/Big-Carpenter7921"
            },
            {
                "text": "Insider trading.",
                "user": "u/Proddx"
            }
        ],
        "processed": true
    },
    "1ewkqc7": {
        "post": "What is something that you're unwilling to compromise on now that everything is so expensive? ",
        "body": "",
        "user": "u/bavelpazy",
        "comments": [
            {
                "text": "Motorcycle helmet. No point in saving money if you’re dead.",
                "user": "u/IceSweetgum"
            },
            {
                "text": "Running a window ac unit and 3 other fans all day. I don’t have ac and last summer was miserable sitting in a house over 90+ degrees. I will work the extra hours to make up for the comfort of a slightly cooler studio",
                "user": "u/SpicyL3mons"
            },
            {
                "text": "My toiletries and skincare. Finally found what worked for me and im not about to change that 😔",
                "user": "u/diyujian"
            },
            {
                "text": "Heating in the winter. I’m not about to freeze just to save a few bucks.",
                "user": "u/Amazingpusy212"
            },
            {
                "text": "i won’t compromise on quality coffee,, some things are worth the splurge",
                "user": "u/SnowfallNomad64"
            },
            {
                "text": "I refuse to buy margarine instead of butter even though it’s now $6.50/lb here. I may dole out pats of it like it’s congealed gold but you can pry it from my cold, dead hands.",
                "user": "u/CrazyCatLushie"
            },
            {
                "text": "Heating my home in the winter.\n\nI don't care how much it costs, I refuse to be cold in my own house.",
                "user": "u/SuggarLovey"
            },
            {
                "text": "Regular dental cleanings.",
                "user": "u/hongio_peery"
            },
            {
                "text": "A/C.  My house is going to be cold and I'm going to be really comfortable.",
                "user": "u/devilgator23"
            },
            {
                "text": "Shoes. Everything gives me blisters except the one kind I really like and being in pain ruins things for me, so if I want to enjoy anything I've gotta have shoes that work.",
                "user": "u/phoenix-corn"
            }
        ],
        "processed": true
    },
    "1ex3n04": {
        "post": "What's the smoothest pickup line you've been told?",
        "body": "",
        "user": "u/ArtsyAmalie",
        "comments": [
            {
                "text": "I was very intently looking at hot sauces at the grocery store and a guy walked past me, winked and went “you are what you eat”…..caught himself by surprise at how smooth it was, giggled and walked away.",
                "user": "u/viper8757"
            },
            {
                "text": "I was in a crowded karaoke bar with a bunch of coworkers and a dude kept looking at me. He walked over and said, “hey, tell your friend I think she’s cute”. Then he nodded over to my reflection in the mirrored wall. It caught me off guard in the most adorable way. I’m smiling right now thinking about it.",
                "user": "u/Wander_walker"
            },
            {
                "text": "Girl I used to very briefly work with dropped a piece of paper on the ground while I was behind her. I picked it up and said, \"Hey you dropped something\". She turned around and said, \"It's for you\". \n\nIt was her name and number. Kinda silly, but I always thought it was so cool haha.",
                "user": "u/facetown"
            },
            {
                "text": "I used to draw tic tac toe on a napkin and just walk to a chick at a table and slap it down with a pen and my x in the center. I’d put “phone number if win” and I’d get the number like basically every time. I always ruined it later by having a terrible personality and no money",
                "user": "u/not-read-gud"
            },
            {
                "text": "My buddy’s brother saw a cutie sitting with her friends in DQ. As he ordered at the till, he purchased an ice cream cake, had the staff write his number on it in icing, and then deliver it to her. She received it, and saw him as he was leaving. He winked at her as he walked out the door.\n\nIt worked",
                "user": "u/CoffeeGuzlingBastard"
            },
            {
                "text": "A buddy of mine is really good with women. He does this one thing on our uni campus where he'll go up to a random girl.\n\nHim: \"hey I have a question and need a woman's advice\"\n\nHer: \"sure what's up?\"\n\nHim: \"let's say I see a really cute girl, do I go up and talk to her or is that too direct?\"\n\nHer: 99.9999% of them say: \"you should totally go talk to her.\"\n\nHim: he then introduces himself.\n\nThe reason why this works is because you casually said a compliment and gave the girl a smile.\n\nP.S. I forgot to specify, you have to be very handsome...",
                "user": "u/SandPale2532"
            },
            {
                "text": "In college, a friend of mine used to go out with a toothbrush as a prop. When he saw a girl he liked he would put it in his front shirt pocket and approach them.\n\nThey would always say, ‘Why have you got a toothbrush in your pocket?’ , and he would reply, ‘Well I’m not going to use yours in the morning, am I?’\n\nAlways got a laugh. Sometimes got him more.  😂",
                "user": "u/mocoworm"
            }
        ],
        "processed": true
    },
    "1et0njk": {
        "post": "What was something you really got into but now \"it was a phase\"?",
        "body": "",
        "user": "u/Possible-Ad-1352",
        "comments": [
            {
                "text": "In my twenties I really got into sailing. Before that I used sit on the beach and watch the sail boats go by, and think how peaceful, and relaxing it looked. So I signed up at the local college and learned to sail. Did some competitive racing . I dreamed of racing in the Americas Cup, and sailing around the world, and living on a sail boat. I even built a wooden sailboat, and restored a few. After a number of years and getting caught in some bad storms, and getting tired of waiting for the perfect weather, then getting all rigged up just in time for the wind to die. I realized this sport is anything but peaceful and relaxing. Now I sit on the beach and watch the sailboats go by and think.... Poor saps... They could be lying on the beach relaxing . But there out there yanking on ropes and grinding winches.",
                "user": "u/BlackFlagandbones"
            },
            {
                "text": "Brewing Beer. \n\nIt was enjoyable but didn't spark a hobbyist passion. Plus, the beer belly.",
                "user": "u/TheDadThatGrills"
            },
            {
                "text": "I wore a cowboy hat for a year.",
                "user": "u/RKYThrowaway"
            },
            {
                "text": "I was all about knitting. My one and only scarf ended up being a blanket for my cat",
                "user": "u/Admirable_BodYPure"
            },
            {
                "text": "I cringe thinking about this now, but when I was in elementary school, I wanted to be a Mexican so badly (I'm Filipino-American) that I would watch Telemundo without subtitles, read the Spanish Bible at church during mass, & even bought a Mexican flag towel.",
                "user": "u/Upbeat_Tension_8077"
            },
            {
                "text": "My skateboarding phase from 12-14. I wore all the clothes, had the look, and could barely do a kickflip.",
                "user": "u/HockomockRock"
            },
            {
                "text": "Collecting things as a kid. Coins, marbles, rocks, etc",
                "user": "u/Didntlikedefaultname"
            },
            {
                "text": "I went through a phase of learning to juggle. The only thing I can juggle now is my schedule",
                "user": "u/LOvee_FreshBaby"
            },
            {
                "text": "Everything. I have adhd",
                "user": "u/Potential-Narwhal-"
            }
        ],
        "processed": true
    },
    "1ewyhfr": {
        "post": "what makes you not wanna die? ",
        "body": "",
        "user": "u/Impossible_Match6336",
        "comments": [
            {
                "text": "Curious to see what will happen",
                "user": "u/Lonely-Air-8029"
            },
            {
                "text": "Might miss something cool.",
                "user": "u/weird-oh"
            },
            {
                "text": "Transferring the pain to my daughter isn't fair",
                "user": "u/youmovedon"
            },
            {
                "text": "Knowing I’m someone’s favorite person, even if it’s just my cat.",
                "user": "u/Perfect_Loverbabe091"
            },
            {
                "text": "The suicide rates for children of survivors....",
                "user": "u/BuxomGata"
            },
            {
                "text": "Connections with the people around me.",
                "user": "u/Angeloflove71"
            },
            {
                "text": "I haven’t been to enough national parks yet",
                "user": "u/matchawaffles5034"
            },
            {
                "text": "My kids",
                "user": "u/Substantial-Hippo637"
            },
            {
                "text": "Alive I'm a burden to myself.  \nDead I become a burden to others.",
                "user": "u/varthalon"
            }
        ],
        "processed": true
    },
    "1euh8ul": {
        "post": "What’s the most ridiculous thing you believed as a child?",
        "body": "",
        "user": "u/irizih",
        "comments": [
            {
                "text": "As a child, I genuinely believed that if I dug deep enough in the backyard, I could reach the other side of the world. I spent hours with a shovel, convinced I’d end up in another country. Reality hit when I barely got past the dirt.",
                "user": "u/yourdigigirlfriend"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "I grew up very close to the ocean and on nice evenings we would take walks on the beach.\n\nMy mother would tell us that we should listen carefully when the sun was setting over the ocean because it would sizzle. (You know how when you put out a fire with water) \n\nMy sister and I went out of our ways to pretend to hear that.",
                "user": "u/Background-Two-8999"
            },
            {
                "text": "I used to believe that when your luggage went on a conveyor belt at the airport, that your luggage would go all of the way to your destination on that conveyor belt.",
                "user": "u/Apprehensive_Sand343"
            },
            {
                "text": "That waves came from whales slapping their tails on the water way far out in the ocean.",
                "user": "u/SpicySnails"
            },
            {
                "text": "I was convinced that the moon followed our car everywhere because it had a crush on my mom",
                "user": "u/Complex-Pass4023"
            },
            {
                "text": "When I was like 7-8 years old I was convinced I could see a small outline of the statue of liberty from our garden, in reality it was a big networking antenna. We're living in Germany lol",
                "user": "u/BodyPillowCollector"
            },
            {
                "text": "When I was a kid, my mom explained to me that we all had belly buttons because that’s how our moms fed us before we were born. So I thought when you got pregnant, your belly button opened up and you just put whatever you wanted to down there. Like I thought women were just shoving chicken legs in their belly buttons.",
                "user": "u/camila_applepie22"
            },
            {
                "text": "When people died in movies they died in real life. Never understood why an actor would take a part in a movie knowing he would be killed during filming.",
                "user": "u/SeductionWhisper"
            },
            {
                "text": "There was no colour in the world when black and white movies existed.",
                "user": "u/Thanossing"
            }
        ],
        "processed": true
    },
    "1evcpnj": {
        "post": "What’s something you do that really shows your age?",
        "body": "",
        "user": "u/Center_Power_Unit",
        "comments": [
            {
                "text": "Not recognizing most of the guests on late night talk shows or SNL. Maybe have heard the names but no idea what they do.",
                "user": "u/Curious_Kangaroo_845"
            },
            {
                "text": "Grunt any time I go from sitting to standing or standing to sitting.",
                "user": "u/MyPrimaryAcct"
            },
            {
                "text": "I was born in a country that doesn't exist anymore.",
                "user": "u/cutiesposter"
            },
            {
                "text": "Whenever I see a building in my town, I tell people about what used to be on that same site.\n\nExample: “See that grocery store. I remember when it was just a cow pasture.”",
                "user": "u/Juan_Calavera"
            },
            {
                "text": "I discover a great new band I've never heard of but when I google them I learn that they won like 10 Grammys and had a no. 1 album ten years ago.",
                "user": "u/GoKartMarlys"
            },
            {
                "text": "I put periods at the end of text messages.",
                "user": "u/Stipes_Blue_Makeup"
            },
            {
                "text": "You can pry my side-parted hair from my cold dead scalp. ",
                "user": "u/drainbead78"
            },
            {
                "text": "You know the lady who has a rose garden and who gives fresh picked tomatoes to the neighborhood kids? I've become her.",
                "user": "u/doublestitch"
            },
            {
                "text": "I call all video games Nintendo just to get a rise out of the kids",
                "user": "u/1920MCMLibrarian"
            },
            {
                "text": "I still say “tape a show” when I want to DVR something and occasionally refer to “hanging up” when ending a video call.",
                "user": "u/thirdtimesdecharm"
            }
        ],
        "processed": true
    },
    "1eykyn6": {
        "post": "Which show starts as a 10/10, but ends as a 1/10?",
        "body": "",
        "user": "u/BVTQT",
        "comments": [
            {
                "text": "Once upon a time. I LOVED the first two seasons but literally couldn’t watch after that",
                "user": "u/Virtual-Witness9579"
            },
            {
                "text": "I don’t know that it started as a 10/10, but Weeds absolutely collapsed after about the 3rd season and somehow kept going",
                "user": "u/professorfunkenpunk"
            },
            {
                "text": "PRETTY LITTLE LIARS !!! 📢 The way it ended was straight up insulting to everyone who spent years loyally watching that show.",
                "user": "u/WebkinzMurderer69"
            },
            {
                "text": "I absolutely LOVED Blacklist - I could watch James Spader in his element all day - but as the seasons went on I could no longer tolerate the character of Elizabeth Keen and the constant flip flopping of whether Reddington is her father or not. It got so old.",
                "user": "u/mcbeaz"
            },
            {
                "text": "House Of Cards \n\nEdit: The U.S. version.",
                "user": "u/jackiejacker23"
            },
            {
                "text": "I loved the first season of Heroes but it declined drastically to the point I stopped watching pretty abruptly",
                "user": "u/lurkbutdonttouch19"
            },
            {
                "text": "Once Upon a Time. \n\nIt should have stopped after Season 3-4. They starting doing to much and I could barely finish the show. I had to force myself to sit and watch till the end of each episode.\n\nAlso Belle and Rumpelstiltskin’s relationship made me uncomfortable. I didn’t like it at all.\nThey should have stopped after the Peter Pan arc imo",
                "user": "u/J_0_0_N"
            },
            {
                "text": "That 70s show.\n\nOnce Eric left for Africa everything fell apart.\n\nThis show was a staple in my house, we would all watch the new episodes when they came out, which i feel was on Sunday night before school.",
                "user": "u/Necrotitis"
            },
            {
                "text": "American Horror Story, the beginning seasons were so good, but over the last few seasons has fallen drastically.",
                "user": "u/FoxtrotMassie"
            },
            {
                "text": "Heroes. That first season is incredible. By the time the caravan/circus people show up, it's unwatchable.",
                "user": "u/maddieterrier"
            },
            {
                "text": "I think it’s safe to say Riverdale went south after season 1",
                "user": "u/goodbyetogepi"
            }
        ],
        "processed": true
    },
    "1ey1gx3": {
        "post": "What’s the scariest conspiracy theory  you’ve ever heard?",
        "body": "",
        "user": "u/OutlandishnessSea258",
        "comments": [
            {
                "text": "This is a regional one, but the idea that Robert picton (the pig farm serial killer) didn’t act alone. The theory goes that the farm was a common party spot for the Vancouver police department and hells angels, and that was the reason he got away with it for as long as he did. Recently he died in jail and the families of his victims are furious he was not able to testify. There were also a lot of sketchy things to do with evidence. When you start looking it’s pretty convincing.",
                "user": "u/longwinters"
            },
            {
                "text": "That the South Korean prosecution office bullies people into committing suicide. Don’t know if it’s the scariest, but considering the current president openly admitted this - idk.",
                "user": "u/EntertainmentPure955"
            },
            {
                "text": "That there is no such thing as \"food safe plastic.\"",
                "user": "u/tschris"
            },
            {
                "text": "That r/AskReddit is mostly a data scraping tool used by marketing companies to farm data from the masses based on what company x is selling, i.e. Disney wants to know what movie to remake next so let's pay someone to ask about favorite Disney films from their childhood and log the responses. Actually, I just made that up, but I have no doubt it's happening.....\n\nEdit: Yes, I'm aware that the idea of reddit selling data for market research is not exactly novel. The crux of the conspiracy theory is that many questions are not asked by real accounts. Consider a situation where something is trending somewhere else online, then a question is asked by a \"user\" to get a better idea of whether the trend is exploitable in some way or just a flash in the pan.",
                "user": "u/paradigmshift7"
            },
            {
                "text": "Dark Forest Theory: we can't find any evidence of extraterrestrial life because the smart ones are hiding, and the dumb ones have been killed by... something else.",
                "user": "u/aliasalt"
            },
            {
                "text": "Shrimp is bugs",
                "user": "u/attackcow94"
            },
            {
                "text": "Plants cultivate humans for the carbon dioxide",
                "user": "u/__kakashi__hatake___"
            },
            {
                "text": "in the early 1980s, Coca-Cola deliberately removed \"Coke Classic\" (made with cane sugar) from production and introduced \"New Coke\" (a.k.a. \"Coke II\") as a ruse, knowing full well that people would complain that it \"wasn't the same as before,\" so they staged an apology commercial from Coke's CEO saying \"we're sorry; we hear you\" (when has a CEO ever said that??? LOL), and re-introduced \"Coke Classic\" with corn syrup instead of cane sugar, knowing that by the time it was re-released, the market's inventory of the original \"Coke Classic\" had largely been distributed and consumed, so very few people (if any) could actually compare them side-by-side to see if they tasted the same.\n\nBTW, the tariffs on cane sugar were increased ginormously just before they did this, which was a way to encourage domestic corn production.\n\nTL;DR - Coke pulled a switch-a-roo by changing sweeteners and lied saying that it was the exact same as before",
                "user": "u/chocolate_yummy"
            },
            {
                "text": "The current social wars were designed to distract us from the trillions of dollars that went from the middle class to the wealthy. It will continue to happen while people fight over body parts and bedroom activities.  The people almost broke through with Occupy Wall St. but the PTB continue to divide people to make sure it can't happen again.",
                "user": "u/squirrely_danielson"
            }
        ],
        "processed": true
    },
    "1eyasgw": {
        "post": "What minor things are very attractive on men, but they never seem to realise it?",
        "body": "",
        "user": "u/FrighteninglyClassy",
        "comments": [
            {
                "text": "the way they listen intently and remember little details can be surprisingly charming",
                "user": "u/BubblyNovax"
            },
            {
                "text": "That subtle confidence in the way he speaks—never bragging, just comfortable with himself.",
                "user": "u/Character-Office-892"
            },
            {
                "text": "I have written down all the comments and will now become the sexiest man on earth. Thanks, reddit.",
                "user": "u/jeancv8"
            },
            {
                "text": "Genuine smile, good posture, or paying attention to details",
                "user": "u/xEmilySexy"
            },
            {
                "text": "I will study this thread quite closely so I can tempt my wife.",
                "user": "u/BigBoyShaunzee"
            },
            {
                "text": "Talking about something he's passionate about\n\nSimiling/laughing genuinely\n\nHaving a unique/unexpected way of thinking \n\nHands/forearms \n\nSmelling good\n\nBeing considerate with everyone\n\nSinging along to some music he's listening to, even if he doesn't sing well\n\nLeaning on the door frame with his arm above his head (as I write it it sounds dumb but it works on me)\n\nRubbing/patting/scratching his tummy (that's probably just me tho)\n\nPlaying with my hair",
                "user": "u/smooth_brain_0"
            },
            {
                "text": "Seeing a man truly smile. So many men are raised to be tough and never smile for photos. Seeing a man light up because he's happy or excited is amazing!\n\nAnd Blushing! If a man blushes, I'm done for. *swoon*",
                "user": "u/AlfalfaFloozy"
            }
        ],
        "processed": true
    },
    "1eyuvhi": {
        "post": "What’s something money can buy we poor people don’t even know of?",
        "body": "",
        "user": "u/Crocodile_Banger",
        "comments": [
            {
                "text": "In some countries, rich people hire poor people to serve prison sentences for them.",
                "user": "u/Cgk-teacher"
            },
            {
                "text": "There are companies that sell books by the foot. Usually leather bound. It’s for decorating so your in home library is stocked with books. Normally you can pick genres or just let the company fill your shelves, you just give them the length of your shelves and your color scheme and they send you books to fill the shelves in bindings that harmonize with your rooms color pallete.",
                "user": "u/buck746"
            },
            {
                "text": "I do IT for the hilariously rich in LA. My favorite thing you can buy is a $300,000 theater streaming device that allows you to watch just released movies directly into your home theater. It requires a background check and a huge amount of money, but then any movie released in theaters is directly uploaded into your system and then you can watch at home in your own little movie theater.",
                "user": "u/Big-Routine222"
            },
            {
                "text": "Personal concierge services. Pay an annual fee of several thousand dollars, and be able to request help getting.... whatever. Hard-to-get concert tickets, dinner reservations, you name it. \n\nExample: [https://quintessentially.com/](https://quintessentially.com/)",
                "user": "u/halfslices"
            },
            {
                "text": "The biggest thing is time - need to get to London for a meeting? Leave for the airport and your plane/charter waits for you. Need a haircut? A person comes to your house to do it for you. Imagine a lot of the things you go out to do on a daily basis and imagine having people to do all that. Need a new phone? Peter will get you the latest iPhone, programmed l, and working the way yours was before. Drop it in the toilet? He bought 5.",
                "user": "u/Delicious_Oil9902"
            },
            {
                "text": "Pet cloning. Ex boss was getting his dog cloned for $100k",
                "user": "u/CharmingGaze2"
            },
            {
                "text": "Luxury ice cubes.\r  \n\r  \nGläce Luxury Ice Co produces perfectly square ice blocks for “minimum dilution and maximum cooling”.\r  \n\r  \nHand-carved and completely clear, these cubes are sold in bags of 50 and each bag costs $325.",
                "user": "u/Whimsicall-Whisper"
            },
            {
                "text": "1) concierge medicine. You get your own dedicated doctor, perhaps your own whole clinic. You never wait for tests. You never wait for an appointment. Your doctor will make house calls and even diagnose and prescribe over the phone. \n\n2) concierge banking. You don't go to the bank to withdraw cash on the rare times you need cash. You call the bank rep and they will courier the money to you. \n\n4) family offices. The legal and financial equivalent of a private clinic of your own. One or more lawyers, one or more CPAs, both with the usual staff. Want to buy a property? Just call the office and they will handle all the paperwork. Even spin up a numbered Delaware company and sign deeds for you.\n\n5) bespoke cars. At the lower end, this means you sit down with a Rolls Royce rep and going over choices. They will arrange a custom paint colour and guarantee no other car will get that shade. Ditto for upholstery, dash treatment etc. In the middle, the likes of Lamborghini and Koenigsegg have lists of billionaire car collectors. When they come up with a concept, they consult with the members of that list before any metal gets shaped. When they release the latest hyper car and say only 25 will be made, that's because only 25 billionaires said they wanted one. Being able to say you have a 1 of 25 car is valuable over and above the car itself. At the very high end, you can call them and pitch your own concepts and they will build a complete 1 of 1 car for you. The Sultan of Brunei famously had a lot of total one off cars made to his exact specifications from many different manufacturers. The \"Rainbow Sheikh\" Sheikh Hamad bin Hamdan Al Nahyan has also done this numerous times.",
                "user": "u/Barbarian_818"
            },
            {
                "text": "I saw this while installing cabinets in a mansion. Espresso machine in the bathroom.",
                "user": "u/PNW35"
            },
            {
                "text": "Citizenship in other countries. Costs about as much as a house for less desirable countries, and about as much as starting a small business for the nicer ones.",
                "user": "u/CampusTour"
            }
        ],
        "processed": true
    },
    "1exnzel": {
        "post": "What’s a toxic trait you recognize in yourself?",
        "body": "",
        "user": "u/youngGod928",
        "comments": [
            {
                "text": "I don't communicate my needs and then get frustrated when they aren't met.",
                "user": "u/unisetkin"
            },
            {
                "text": "Inflexible. I want to do things my way. Trying to learn to overcome this but old habits die hard",
                "user": "u/workinghardyes"
            },
            {
                "text": "I tend to overthink a lot which sometimes makes me my own worst enemy.",
                "user": "u/mnbvyjdghhs"
            },
            {
                "text": "I'm lazy.... essentially I'm like a cat...",
                "user": "u/Typical_Leg1672"
            },
            {
                "text": "I don’t talk about my feelings at all. It’s hard to know if I’m sad or mad about something.",
                "user": "u/Avocado-Toast-93"
            },
            {
                "text": "I don’t set boundaries with people which leads to me becoming angry with them at a later date because they are taking advantage of my being too nice.",
                "user": "u/rando_mike"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "I judge people too quickly and I'm really petty",
                "user": "u/ULTRAPUNK18"
            }
        ],
        "processed": true
    },
    "1eygx5v": {
        "post": "Which aspect of married life makes you want to stay single?",
        "body": "",
        "user": "u/MorningSavant",
        "comments": [
            {
                "text": "Overall, I love being married. The thing I probably miss the most is when I was single, I cleaned the house and it STAYED clean. Now, it stays clean for about 5 minutes. :-(",
                "user": "u/Vivienne1973"
            },
            {
                "text": "Deal with extended family members that I heavily dislike nor get on with. Worse is to have to help them or get involved their problems.",
                "user": "u/542Archiya124"
            },
            {
                "text": "Not having any totally personal space.\n\n\nI lived alone before I met my husband and I still miss that feeling of closing the front door and knowing I had every room to myself.",
                "user": "u/LordyIHopeThereIsPie"
            },
            {
                "text": "inlaws and their views",
                "user": "u/OasisJunkie"
            },
            {
                "text": "I love my wife. She’s complementary to me in a lot of ways, and was the first person who I met that made me feel like I could be myself.\n\nShe also hogs the covers, leaves lights on, and can’t seem to close any drawers she opens.\n\nETA: spelling",
                "user": "u/JangusCarlson"
            },
            {
                "text": "When my wife sits down in the living room, sees what I’m watching and says “Can’t we watch something we BOTH want to watch?” \n\nThis means she wants me to put on FRIENDS on Netflix for the millionth time so she can ignore it and stare at her phone. She does not like when I point out that she can stare at her phone while I’m watching what I want to watch.",
                "user": "u/-Words-Words-Words-"
            },
            {
                "text": "Having to compromise on the thermostat settings all the time.",
                "user": "u/petalxfantaasy"
            },
            {
                "text": "Having someone talk to you all the time",
                "user": "u/IceSmiley"
            },
            {
                "text": "I'm pretty minimal when it comes to possessions. I don't like to have a lot of *stuff* that I have to organise and keep track of. Being married though (and having kids) means having to live in a house with *so much stuff*. I also think it's a lot easier to manage money by myself, as I can get by on relatively little.",
                "user": "u/AlterEdward"
            },
            {
                "text": "Accountability to someone else but yourself. Obligations.",
                "user": "u/Saxon2060"
            },
            {
                "text": "You have to meet the in-laws and get to know them. Let alone, accept them and them.. You!",
                "user": "u/skumplesn"
            }
        ],
        "processed": true
    },
    "1eytd5a": {
        "post": "What TV show has a 10/10 finale?",
        "body": "",
        "user": "u/Mean_Ad_4762",
        "comments": [
            {
                "text": "Band of Brothers. \nEspecially the voiceover at the Baseball match and the Veteran's interviews at the end always make me absolutely speechless.",
                "user": "u/Ok_Musician_1072"
            },
            {
                "text": "Six Feet Under\n\nIt actually has a 9.9 on IMDB\n\n[https://www.imdb.com/search/title/?count=250&series=tt0248654&sort=user\\_rating,desc](https://www.imdb.com/search/title/?count=250&series=tt0248654&sort=user_rating,desc)",
                "user": "u/blimkat"
            },
            {
                "text": "Justified \"We dug coal together\"",
                "user": "u/debatesmith"
            },
            {
                "text": "Better call Saul\n\n\"My name is McGill. I'm James McGill\"\n\nGoosebumps",
                "user": "u/Total-Prize-9246"
            },
            {
                "text": "MASH",
                "user": "u/swibirun"
            },
            {
                "text": "Schitt’s Creek",
                "user": "u/CandidTrade6528"
            },
            {
                "text": "gravity falls. two seasons. lots of mystery. perfect ending.",
                "user": "u/blondestipated"
            },
            {
                "text": "Bojack Horseman \n\nBojack has this thing that the penultimate episode of each season is the actual finale, and the last episode is a sort of epilogue. So with that said, View from Halfway Down is amazing",
                "user": "u/fixingmewank"
            }
        ],
        "processed": true
    },
    "1exth4u": {
        "post": "How do you get better at flirting?",
        "body": "",
        "user": "u/hovelybeatmalls",
        "comments": [
            {
                "text": "A guy told me that he liked my shoes and asked where I’d gotten them.\n\nWe were in a bowling alley.",
                "user": "u/toto123public"
            },
            {
                "text": "I always just thought of it as a game, but one you’re not really trying to win, it’s just fun to play.\n\nWhen you find an opponent that makes it more fun is when you know you’re doing it right. \n\nIf not, then concede the match, and move on.",
                "user": "u/Plantayne"
            },
            {
                "text": "Good at flirting also means recognizing when the other party isn't receptive.\n\nIf they're answering briskly and killing conversation, cut your losses and move on.",
                "user": "u/Glad_Entrance3802"
            },
            {
                "text": "Listen more than you talk; people love to feel heard.",
                "user": "u/Inside_Literature280"
            },
            {
                "text": "Perhaps forget flirting. Just talk to people and be interested in what they say. Ask real questions. Listen to the answers. Work on improving your feel for the flow of conversation. But the trick is to ACTUALLY be interested in what they are saying 😄",
                "user": "u/sleepybeek"
            },
            {
                "text": "People don’t care that much if you say something embarrassing or weird, so you shouldn’t care either. From what I’ve learned most girls actually like it when you’re just talking about whatever you feel like even if it’s kinda goofy or weird because it brings up genuinely good conversation that isn’t the boring stuff they always talk about with guys trying to flirt with them",
                "user": "u/jello_schnoogle19"
            },
            {
                "text": "Same way your get to Carnegie Hall. \n\n\"Practice, practice, practice.\"",
                "user": "u/daithisfw"
            },
            {
                "text": "GREETINGS FAIR MAIDEN. I APPROACH THEE WITH ROMANTIC INTENT.",
                "user": "u/oohjam"
            },
            {
                "text": "Try to find your personal profile and seek to flirt with the most synchronized profiles.",
                "user": "u/blackycat50"
            }
        ],
        "processed": true
    },
    "1ey4861": {
        "post": "What are some unwritten rules for men?",
        "body": "",
        "user": "u/supernfsj",
        "comments": [
            {
                "text": "You will return the head nod.",
                "user": "u/cutie_laughter05"
            },
            {
                "text": "When you have a set of tongs, clap them at least twice to make sure they are working.",
                "user": "u/YellowStar012"
            },
            {
                "text": "Stand up to shake someone’s hand.",
                "user": "u/Western-Bad-667"
            },
            {
                "text": "When you drop a girl (or later, your kid's friends) off at home you never drive off until they are inside the house.",
                "user": "u/SoMuchSpentBrass"
            },
            {
                "text": "When you finish pumping gas into your car, you have to shake the nozzle to get the last drops out. We all know why.",
                "user": "u/BoredomFestival"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Direct the stream to clean off the gunk in a toilet.",
                "user": "u/pm_me_coffee_pics"
            },
            {
                "text": "Don't throw a friend under the bus to impress someone. Ever.",
                "user": "u/WeakAd9656"
            },
            {
                "text": "Don't take off another man's hat",
                "user": "u/Ye3tm4n"
            }
        ],
        "processed": true
    },
    "1eyceg4": {
        "post": "what's something innocent you're hiding?",
        "body": "",
        "user": "u/hovelybeatmalls",
        "comments": [
            {
                "text": "I have a drawer in my bedroom with almost every card I've ever gotten. When I'm having a bad day I'll take a few out and read them. They're just the generic store ones but there's always a handwritten message and it's a nice reminder that at some point people have loved me.",
                "user": "u/TheCoolerL"
            },
            {
                "text": "Everytime i visit my gf, i hide a little money in her apartment.\nSometimes she calls me and is excited that she found some money at home.\n\nI earn a lot more than she does and she would never accept money, even if she really needs it",
                "user": "u/sexyhairynurse"
            },
            {
                "text": "I have a old co-worker that went on disability years ago and we are friends on social media. A very kind and generous person who got unlucky. Whenever they post about something they are looking for on market place, I send it to them from Amazon. It ain't much but it makes me happy. I hope it makes them happy.",
                "user": "u/laclair1000000"
            },
            {
                "text": "i hide snacks like they’re treasure?? gotta keep my secret stash safe from roommates who snack attack me when i’m not looking",
                "user": "u/violettagaia"
            },
            {
                "text": "When my father passed away, I was tasked with finding all of his business documents on his computer. \n\nHis last ten unsent emails were asking me for advice on leg exercises when he gets out of the hospital bed.",
                "user": "u/Krijali"
            },
            {
                "text": "i secretly have a stash of vintage comic books that i tell no one about",
                "user": "u/SexyxRae"
            },
            {
                "text": "I have a collection of old concert tickets I never show anyone.",
                "user": "u/angel_sparkles"
            },
            {
                "text": "I'm not happy, I'm just friendly",
                "user": "u/ElleSter52"
            },
            {
                "text": "I secretly love 'bad' pop music when I'm alone, it's a guilty pleasure that makes me happy. Anyone else have an embarrassing musical taste?",
                "user": "u/ShiningSassafras"
            },
            {
                "text": "I have to make eye contact with my cats as I close the door to my place when leaving. They are my sons and I: 1. Want to make sure they’re solid before I go. 2. Tell them I love them 3. Take a visual snapshot in my mind that all is well at home so that I can revisit it whenever I need to settle my OCD.",
                "user": "u/newellz"
            }
        ],
        "processed": true
    },
    "1ez1kaa": {
        "post": "Men of reddit, what little things do women do that you really appreciate?",
        "body": "",
        "user": "u/bavelpazy",
        "comments": [
            {
                "text": "Random hugs or physical affection. It's nice to feel wanted.",
                "user": "u/ResearchDisastrous38"
            },
            {
                "text": "My girlfriend told me once, \"I can't solve every problem, but I know I can always be here for you when you need help.\" Really made me feel supported and loved.",
                "user": "u/Big-Routine222"
            },
            {
                "text": "My wife told me I looked good in my shirt today. I've been on the moon all day",
                "user": "u/TheRealOcsiban"
            },
            {
                "text": "I really like how they exist I mean it’s like the bare minimum but it’s pretty nice that they exist",
                "user": "u/itsahex"
            },
            {
                "text": "When your sitting down next to her & she places her head on your shoulder and smiles",
                "user": "u/steezyx94"
            },
            {
                "text": "When they remember small details about my day or surprise me with my favorite snack",
                "user": "u/xPrettyLadyxx"
            },
            {
                "text": "Random act of cuddles like scratching your head while driving",
                "user": "u/Mission-Army2142"
            },
            {
                "text": "You guys are making me feel like I want to be in a relationship again, you are so sweet",
                "user": "u/Just_Chair_2681"
            },
            {
                "text": "There are lots of them, but today my dearly beloved came up behind me as I was sitting at the kitchen table and just kinda bent down and hugged me from behind and just stayed that way for a bit.",
                "user": "u/SnoopsBadunkadunk"
            },
            {
                "text": "Put in so much effort for us even when sometimes we're just not worth it",
                "user": "u/Civil-Contract3908"
            },
            {
                "text": "The look they give you that let's you know, you are their whole world.",
                "user": "u/sjwoodwalker"
            }
        ],
        "processed": true
    },
    "1eyuxw9": {
        "post": "What song seems to always make you cry?",
        "body": "",
        "user": "u/TruthBeWanted",
        "comments": [
            {
                "text": "Lord Huron- the night we met- it’s like being frustrated with falling in love",
                "user": "u/bradharri"
            },
            {
                "text": "The scientist",
                "user": "u/Acciosab"
            },
            {
                "text": "Somewhere Over the Rainbow/What a Wonderful World medley - Israel Kamakawiwoʻole \n\nWind Beneath My Wings - Bette Midler",
                "user": "u/BraveDragonfly1848"
            },
            {
                "text": "I will follow you into the dark \n\nGot me a good man and I sure would follow him into the dark 🥹",
                "user": "u/ArtoftheEarthMG"
            },
            {
                "text": "Adagio For Strings by Samuel Barber.  One of the most beautiful pieces of music I've ever heard.",
                "user": "u/Fessy3"
            },
            {
                "text": "Face Down - Red Jumpsuit Apparatus\n\nPlayed a lot on the radio when I was leaving an abusive relationship, definitely scream cried this song in my car a bunch. Still makes me weepy years and years later.",
                "user": "u/Sensual_Muse"
            },
            {
                "text": "i get hit hard by fast car by tracy chapman like every time?? it’s like a emotional rollercoaster without the seats tho...",
                "user": "u/omixtaliay"
            },
            {
                "text": "Father and Son by Cat Stevens destroys me",
                "user": "u/MirthfulGlow"
            },
            {
                "text": "I first heard the song \"If I Die Young\" by the Band Perry driving home from work a few days after my wife had miscarried. I had to pull over to the side of the interstate, I was crying too hard to see the road.",
                "user": "u/CyclopeanBifocal"
            },
            {
                "text": "Somewhere only we know - keane\n\nThe other woman - lana del rey",
                "user": "u/CharmingGaze2"
            }
        ],
        "processed": true
    },
    "1ezt8xn": {
        "post": "What discontinued food/product do you still mourn today?",
        "body": "",
        "user": "u/lesspoisonousivy",
        "comments": [
            {
                "text": "Sobe. \n\nGive me back my lizard milk I beg you",
                "user": "u/verysorepeepee"
            },
            {
                "text": "Lifesavers crème savers and sour altoids",
                "user": "u/Legacy0904"
            },
            {
                "text": "I miss when jelly came in jars that you could re- use as juice glasses. We had dinosaurs, endangered species, Tom and Jerry, and some others. ",
                "user": "u/RagingAardvark"
            },
            {
                "text": "Choco Tacos",
                "user": "u/SoberBarney"
            },
            {
                "text": "Sobe drinks.",
                "user": "u/cheercheer00"
            },
            {
                "text": "Altoids tangerine sours",
                "user": "u/Quesadillasaur"
            },
            {
                "text": "McDonald’s box cookies from the 80s/early 90s",
                "user": "u/Melody5556"
            }
        ],
        "processed": true
    },
    "1f0cbvf": {
        "post": "What’s a common trope in movies that NEVER happens in real life?",
        "body": "",
        "user": "u/mak0sthrowaway",
        "comments": [
            {
                "text": "Living in an enormous apartment in Manhattan while you are a bike messenger and your roommate works at a coffee shop.",
                "user": "u/foxmag86"
            },
            {
                "text": "Shoot the gas tank of a car once and it explodes into a huge fireball.",
                "user": "u/vayyiqra"
            },
            {
                "text": "A rando person with no prior training etc. is selected for a special task at which he later succeeds.",
                "user": "u/grumpy_me"
            },
            {
                "text": "Typing a few things into the computer and magically hacking into extremely complex systems.",
                "user": "u/redsnowman45"
            },
            {
                "text": "100 bad guys versus the hero. Bad guys come at him *one at a time*. Always.",
                "user": "u/PanicAtTheShiteShow"
            },
            {
                "text": "Hawk making noise every time they're shown",
                "user": "u/punarob"
            },
            {
                "text": "Pulling a fire alarm and the sprinklers start pouring out water. Also, the water inside those sprinklers is disgusting.",
                "user": "u/DStew713"
            },
            {
                "text": "Turning on the news at the exact moment the plot relevant portion is on.",
                "user": "u/StrykersWeaponX"
            },
            {
                "text": "Firing a pistol inside a car or small enclosed room and no one has any lasting hearing damage. Guns, especially handguns, are ridiculously loud, and when the sound bounces off enclosing walls or objects, it's amplified greatly. \n\n\n(there's a small number of instances where it is portrayed regularly, but it's super rare)",
                "user": "u/AngryGames"
            },
            {
                "text": "The lack of considerable paperwork from any police-action movie.",
                "user": "u/Zoey_Moon"
            },
            {
                "text": "When I'm chasing someone in my car and they're on foot, they don't typically run down the middle of the road like in movies.",
                "user": "u/Dizzy_Store_760"
            }
        ],
        "processed": true
    },
    "1f07vnr": {
        "post": "What's something that most people your age have, but you don't?",
        "body": "",
        "user": "u/boeiejoh",
        "comments": [
            {
                "text": "One or two deceased parents. \n\nI’m in my 50s and sadly quite a few of my friends have lost at least one parent. I’m truly grateful that mine (both age 78) are alive and in pretty good health. ",
                "user": "u/AllTheChurros"
            },
            {
                "text": "Kids",
                "user": "u/Fafurion"
            },
            {
                "text": "A friend ",
                "user": "u/Chance_Caterpillar17"
            },
            {
                "text": "A house",
                "user": "u/Wyoming_Okie"
            },
            {
                "text": "An air fryer",
                "user": "u/User-1967"
            },
            {
                "text": "A retirement plan",
                "user": "u/discardafterusage"
            },
            {
                "text": "Financial stability. Im in my 30s.",
                "user": "u/PettyAssWitch420"
            },
            {
                "text": "Comparing your life to others lives is a soul crusher and a no win approach.",
                "user": "u/rckymtnbud"
            },
            {
                "text": "A group of friends to talk to on a daily basis",
                "user": "u/Bubudel"
            }
        ],
        "processed": true
    },
    "1eznrl1": {
        "post": "What secret have you kept from everyone?",
        "body": "",
        "user": "u/DaSGuardians",
        "comments": [
            {
                "text": "If you ever need help, then please know that there are many qualified people who would like to help you.\n\nhttps://www.iasp.info/resources/Crisis_Centres\n\nhttp://www.befrienders.org/\n\nhttp://www.suicidepreventionlifeline.org/GetHelp/LifelineChat.aspx\n\n\nhttp://www.samaritans.org/how-we-can-help-you [UK]\n\nhttps://www.lifeline.org.au/Get-Help/ [AU]\n\nThere are crisis services worldwide that are trained to provide support. They are designed to give temporary relief from feelings that are overwhelming you and while they are unlikely to fix any underlying problems, can help you get through a tough hour/night/week. Chat services are usually available on these sites. In the US, calling 211 or going to their website is a free referral source. They have providers who will see you regardless of your ability to pay. Just as you would see a doctor when you are sick, you deserve to take care of your mental health.",
                "user": "u/AskRedditModerators"
            },
            {
                "text": "I spilled beer on a wedding dance floor. Grooms aunt slipped and broke her leg.",
                "user": "u/Minge516"
            },
            {
                "text": "My mother had an ongoing secret affair with the guy I was dating in my 20s (while I was dating him). I'm 60 now. It's still hurts she would do that to me.",
                "user": "u/lizzietnz"
            },
            {
                "text": "I make music under a fake identity and I'm approaching 400k monthly listeners on spotify. None of my friends know, not even my kids.",
                "user": "u/flounderjaw"
            },
            {
                "text": "When my dad died he left me about 1M in assets. My family has no idea how much he left me only one friend knows.",
                "user": "u/Apolllo69"
            },
            {
                "text": "I just went through bladder cancer surgery and treatment. Now I’m fine but I told very few people, not even my family. I’m not totally sure why.",
                "user": "u/kkultyer"
            },
            {
                "text": "Cash for life winner. Took the annuity to fund retirement in the near future. $1K a week for life!",
                "user": "u/Existing_Leg_5329"
            },
            {
                "text": "I won 2nd place at my works annual chili competition using a bunch of cups of Wendy’s chili that I put in a crockpot.",
                "user": "u/emarquis"
            },
            {
                "text": "The kids have been eating regular Cheerios for years. Maybe 5 years now out of the same Honey Nut Cheerios box, lol.",
                "user": "u/I_agreeordisagree"
            },
            {
                "text": "I was secretly having 10-15 drinks a day for over 2 years. I’d have 2-3 in the open but snuck the rest. Sober over a year now and nobody to celebrate it with\n\nEdit: thanks for everyone’s congrats and words of encouragement.",
                "user": "u/Sufficient_Ad2222"
            }
        ],
        "processed": true
    },
    "1f05e4c": {
        "post": "What's a luxury that most people don't realize is a luxury?",
        "body": "",
        "user": "u/Dattguyshere77",
        "comments": [
            {
                "text": "There was a great AskReddit thread a while ago asking people in third world countries what people in first world countries don’t understand about the difference and most of the answers amounted to “nothing works the way it should… power goes out, water stops working, things go out of stock all the time, nothing happens on time, etc.”",
                "user": "u/CactusBoyScout"
            },
            {
                "text": "Having free time without any obligations—seriously underrated.",
                "user": "u/curiouschloexo"
            },
            {
                "text": "Coming back home and feel safe",
                "user": "u/GelineAstra"
            },
            {
                "text": "Having clean, safe to drink tap water in your home.",
                "user": "u/Mysterious_Piglet833"
            },
            {
                "text": "Air conditioning",
                "user": "u/Factsaretheonlytruth"
            },
            {
                "text": "Travel. For most of human history it was pretty rare to leave the city or region you were born in. Now almost everyone in developed countries are able to go on a long road trips",
                "user": "u/Sansquach"
            },
            {
                "text": "Teeth that dont hurt.",
                "user": "u/GreenEyedHawk"
            },
            {
                "text": "having a full night of uninterrupted sleep",
                "user": "u/SexyxRae"
            },
            {
                "text": "Libraries. The American public library system is very advanced. It's also, general speaking, free to use.",
                "user": "u/Sea-Bet5249"
            },
            {
                "text": "Having options.\n\n\n\n\\* You get to pick what food you eat? Luxury\n\n\n\n\\* You get to pick what car you buy? Luxury\n\n\n\n\\* You get to pick what clothes to wear? Luxury",
                "user": "u/sloping_wagon"
            },
            {
                "text": "Being able to buy things that make your life easier",
                "user": "u/EastFrosting8452"
            }
        ],
        "processed": true
    },
    "1eytq74": {
        "post": "What everyday skill becomes suspicious if you are too good at it? ",
        "body": "",
        "user": "u/fertility--goddess",
        "comments": [
            {
                "text": "We went to a shooting range and fired a variety of guns for the first time. \n\nMy wife’s accuracy with a glock was very impressive and she topped the group scores by quite a way despite never firing a gun before. \n\nThe trainer leant into me and with his strong Eastern European accent quietly said “check her background”. \n\nShe still tells that story to somebody almost monthly.",
                "user": "u/MoodyBernoulli"
            },
            {
                "text": "My grandpa used to work in the film industry making fake money for movies. He got so good that it started looking TOO real.  He was then visited by the FBI. He didn't get in trouble or anything. They just told him he had to make the money look more fake.",
                "user": "u/Shatter3327"
            },
            {
                "text": "Walking silently. It's always a good skill to have to be able to be quiet in a moment's notice, but do it too well and you start \"appearing\" behind people and freaking them out. *\"How long have you been there?!\"* type things.",
                "user": "u/CelestialSerenade678"
            },
            {
                "text": "I don't know how weird this actually is but I always worry that people will think it's weird if I remember random details they mentioned in passing too often. Sometimes it's not even a conscious decision",
                "user": "u/yeetgodmcnechass"
            },
            {
                "text": "My buddy can get into a house pretty quickly, like in seconds. Not always quiet, not always noisy, but on at least two occasions he's gotten into a house when someone locked a key inside.",
                "user": "u/frank-sarno"
            },
            {
                "text": "Sales. Its done by millions of people everyday, but real good salespersons creep me out.",
                "user": "u/Yeetmaster1301"
            },
            {
                "text": "Knowing all the ways a drug test can provide a false positive better than your attorney does.",
                "user": "u/GreedyNovel"
            },
            {
                "text": "Digging deep holes. Got a lot of strange looks in basic training when I dug a foxhole faster than anyone else by myself. Grew up with a small farm, learned to dig efficiently as a child to dispose of dead animals.",
                "user": "u/Oodora"
            },
            {
                "text": "Knowing where things are. \n\n“Where did I leave the Snickers bar?”\n\n“Over there.”\n\nStared at suspiciously. \n\n“Where’s my keys?”\n\n“You dropped them by your bag.”\n\n“Why do you know that!?!”\n\n“I saw you drop them.”",
                "user": "u/GraemeMakesBeer"
            }
        ],
        "processed": true
    },
    "1f0r43t": {
        "post": "What’s the biggest secret you been hiding from your partner? ",
        "body": "",
        "user": "u/bw162",
        "comments": [
            {
                "text": "I have a box of little crochet critters in the garage, that I make when I'm bored/inbetween clients. I let my fiance know that if anyone at work would like one (she's a hospice nurse) she can just take them from the box, no questions asked.\n\n\nThat's what I told her, anyway. \n\n\nThe secret is that I purposefully make stuff for her to take. I even have a lil spreadsheet so I know what animals/colours are the most popular, and make sure that there's always spares. Obviously I don't know WHO they go to, 'cause of confidentiality, but I try to get as big a range as I can. ",
                "user": "u/CrazySnekGirl"
            },
            {
                "text": "-We’ve been together for 5 years \n-Met at a football game \n-our biggest thing in common is our love for “our team” \n-every Sunday for years we get together to watch the games with her family \n\n-I’m not really into football \n-I was at the game we met at because someone bought tickets and I was off so sure \n- I’ve never really understood it so for YEARS anytime the family cheers I just follow with cheers and when they BOOOO I do the same",
                "user": "u/Both-Outcome1586"
            },
            {
                "text": "As someone who absolutely hated dancing and always declined invitations to go dancing, I've learned the basic steps of Bachata which is her favourite dance. \n\nNot sure how long I'll keep it as a secret. I'm just waiting for the right moment to reveal this suprise.",
                "user": "u/IxdrowZeexI"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "When he proposes to me, I have an engagement watch for him. \n\nMy dad gave it to me a few months into dating him and said that I could do what I want with it. It’s been 5 years and all I need is a nice box and ribbon.",
                "user": "u/Shams_the_only"
            },
            {
                "text": "I want to marry him much sooner than I thought but also as an immigrant I worry if bringing that up will raise any eyebrows and cause him or his family and friends to think that I want to do this to get permanent residence quickly. So I've been working extra hard to qualify for it on my own.",
                "user": "u/Few-Music7739"
            },
            {
                "text": " I'm gone once a month for a mysterious workshop that he's not allowed to ask about. What he doesn't know is that it's a workshop blacksmithing and I'm currently making him a sword to propose to him with",
                "user": "u/TsundereKitty"
            },
            {
                "text": "probably how many snacks I really sneak at midnight",
                "user": "u/TenderElise"
            },
            {
                "text": "I don't think his youngest son is his.  The story about how this child came to be is very shady. Between having his vasectomy reversal and how low he said his count is. Combined with the fact that he caught the boys' mom cheating during the time they were trying, and how fast she came back with the paternity results, it all feels very wrong.  13 years later, when we are talking about his youngest, he always brings up how similar they look. I just agree. This kid looks nothing like him or his other 2 kids. My BF is 5'7 blue eyes black hair with a lean build. The youngest is already over 6 feet tall brown eyes, brown hair, and kinda chubby. His mom is very slim, blue eyes and blonde hair. He wanted to get them all 23 and me for Christmas, I talked him out of it, I think it would ruin Christmas for him if it came out.",
                "user": "u/Cramit82"
            },
            {
                "text": "She farts in her sleep. LOUD.",
                "user": "u/Higanbana_-"
            }
        ],
        "processed": true
    },
    "1ezeju1": {
        "post": "What was the first red flag you ignored in your worst relationship?",
        "body": "",
        "user": "u/HappyHappyJoyJoy44",
        "comments": [
            {
                "text": "Flakiness and excuses.",
                "user": "u/Extension_Lack194"
            },
            {
                "text": "dismissive comments about my interests seemed minor until they became a pattern",
                "user": "u/ElegantMia"
            },
            {
                "text": "Rage. Sudden outburst of rage.",
                "user": "u/Strike_Anywhere_1"
            },
            {
                "text": "when they brushed off my boundaries like they were suggestions",
                "user": "u/SnowyShoreline09"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Even though they were \"too busy\" to respond to texts, they managed to spend the entire day posting on social media.",
                "user": "u/imurdigigirlfriend"
            },
            {
                "text": "so many! I feel like an idiot thinking back.  \nBut the biggest one: he kept saying ¨Im not good at relationships¨  \nplot twist, he wasnt\n\ninsert shocked pikachu face",
                "user": "u/Extension_Lack194"
            },
            {
                "text": "She left her boyfriend to be with me.",
                "user": "u/Same-Squirrels"
            },
            {
                "text": "Didn't want to spend his free time with me.",
                "user": "u/merri_is_ok"
            }
        ],
        "processed": true
    },
    "1f0fu2i": {
        "post": "What is the worst thing to be addicted to apart from drugs? ",
        "body": "",
        "user": "u/-Z-3-R-0-",
        "comments": [
            {
                "text": "Starving or binge-eating.",
                "user": "u/imaginechi_reborn"
            },
            {
                "text": "Gambling. Not apart from drugs, it's worse than even drugs.\n\nI worked in a casino and I could write a novel about the things I saw. It was the saddest place on earth.",
                "user": "u/Any-Yellow-7059"
            },
            {
                "text": "\n\nShopping. A friend’s GF barely leaves the house except for work, and she shops online obsessively. Their garage is a solid cube of stuff, much of it unopened. Every inch of their home is crammed. There must be 150 scented candles in that house.\n\nHe says he comes home every day to a stack of deliveries.",
                "user": "u/NinaNebula"
            },
            {
                "text": "Isolation. Once you get used to it it can be addicting and it is a real hole to dig yourself out of.",
                "user": "u/AtreusFamilyRecipe"
            },
            {
                "text": "Food because you can never give it up completely",
                "user": "u/catcrazy12"
            },
            {
                "text": "phone",
                "user": "u/hatecockroaches"
            },
            {
                "text": "Food. \n\nUnlike alcohol or drugs, you can't just cut it out of your life.",
                "user": "u/tc0n4"
            },
            {
                "text": "Well I know that Fabergé eggs nearly ruined Bleedin’ Gums Murphy’s life and career…",
                "user": "u/defundTheFireDept"
            }
        ],
        "processed": true
    },
    "1eyqnyz": {
        "post": "What’s the biggest lie we’re all told in life? ",
        "body": "",
        "user": "u/Puzzleheaded_Eye8358",
        "comments": [
            {
                "text": "That people get what they deserve. The reality is the world is unjust. Some evil people flourish, some kind people struggle all their lives.",
                "user": "u/CuriousTuljan"
            },
            {
                "text": "This will probably upset some people, but the biggest lie is \"you are perfect just the way you are\". If you go through life thinking that you don't need to change than you will live a sad and unfulfilled life. You aren't perfect, you need to change.",
                "user": "u/JobEmbarrassed521"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "You can be anything you want to be.\n\nYes but also very much no.",
                "user": "u/xxwerdxx"
            },
            {
                "text": "That everything gets easier with time—sometimes you just get better at handling the chaos.",
                "user": "u/remi_own_w0rds"
            },
            {
                "text": "What goes around comes around. Sometimes it doesn't",
                "user": "u/SereeneSuun"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "What's the best way to make a million dollars? Work hard? no, start with 2 million dollars.",
                "user": "u/aidensproofoflife"
            },
            {
                "text": "The biggest lie? That adults have it all figured out. Spoiler: we’re all just oversized kids faking confidence, using words like \"mortgage\" and \"401k\" to cover up the fact that we’re Googling how to boil an egg for the third time this month.",
                "user": "u/Tantalizing_Olivia"
            },
            {
                "text": "Just one more episode...",
                "user": "u/janarebelle"
            },
            {
                "text": "\"You'll be okay.\"\n\n-Former EMT",
                "user": "u/Nova_-_Jade"
            }
        ],
        "processed": true
    },
    "1f01kwc": {
        "post": "What was the tipping point that made you leave your job on the first day?",
        "body": "",
        "user": "u/Head_Somewhere3770",
        "comments": [
            {
                "text": "When I saw the 'Employee of the Month' picture and realized it was a framed photo of the exit door.",
                "user": "u/WsbIshq"
            },
            {
                "text": "Went to the first day of training and realized it was a MLM. Stayed for the lunch they provided and then dipped.",
                "user": "u/Due_Purchase_7509"
            },
            {
                "text": "I once showed up to a new warehouse job as a student and the person who was supposed to train me never even showed up. Everyone else just kept passing me off to someone else, like no one wanted to deal with me. I get I'm a dumb student and all in their eyes but man does it feel condescending. By lunch I was outta there.",
                "user": "u/Gothic_D0ll"
            },
            {
                "text": "At 17, I worked in pre-cast concrete. I wouldn't use a rusty ladder, and my supervisor taunted me. He climbed it, and after a few steps, the ladder gave way, and I heard his foot snap. I called an ambulance and walked out.",
                "user": "u/Grand_Demand_8474"
            },
            {
                "text": "Not quite the first day, but I’d been promised a quite generous pension scheme as part of the overall package.\n\nInduction day comes along and the pension scheme is described. And it’s not generous at all - in fact, it’s the legal minimum. \n\nI made every effort to address this, but they were quite clear: that’s the rules, sorry you were misinformed, take it or leave it. \n\nThey were astonished when I chose “leave it”.",
                "user": "u/jimicus"
            },
            {
                "text": "when my boss didn’t show up",
                "user": "u/GameWaveExplorer99"
            },
            {
                "text": "When they said I would be expected to do unpaid overtime.\n\n\"oh really? Bye then\"",
                "user": "u/EitherChannel4874"
            },
            {
                "text": "So, it turns out this “company” wasn’t even legit—they weren’t registered and had no license. They even threatened to make us pay if we quit during the 60-day training period. Fast forward a few months, and they were shut down.",
                "user": "u/Mediocre-Food-2292"
            },
            {
                "text": "I worked for a bread factory that put me on the first shift, within the first 10 minutes of being there an employee asked me if HR had told me they have been forced to work 17-hour days. Most of the employees were single moms, one employee told me about her struggles with child care. She wanted to leave so badly but it was the first time she had health insurance. She lifted up her shirt and showed me a big hernia she needed to get taken care of. It felt like prison, I left and never came back at lunch.",
                "user": "u/misslady420"
            },
            {
                "text": "Interviewed for a barista position. Showed up the first day, and they asked if I was ok with a few days of “unpaid training”, which I know that they knew was illegal. I said no.",
                "user": "u/Green-Krush"
            }
        ],
        "processed": true
    },
    "1f0rjzn": {
        "post": "What couldn't you believe you had to explain to another adult?",
        "body": "",
        "user": "u/BlueCaracal",
        "comments": [
            {
                "text": "Volunteered in a charity shop. Lady came to the counter with a top and asked if I could look in the back for one of the same colour but a larger size. Tried to explain we don't do that because we're a charity shop. She insisted that other shops, like H&M, have done that for her. Wouldn't take no for an answer.\n\nEventually I just went in the back for a few minutes, made a cup of tea for a co-worker, and came out saying we don't have any. She got mad at that too.",
                "user": "u/Aquashinez"
            },
            {
                "text": "That no matter how much you might want to put a camo pattern on your walls, you (not the paint) have to determine what that pattern looks like and you will also have to purchase multiple cans of paint tinted differently because \"camo\" doesn't come out of a can that way.",
                "user": "u/VelvetWhisperer12"
            },
            {
                "text": "Why a room below sea level on a cruise ship would not have a balcony",
                "user": "u/rosiewayffu"
            },
            {
                "text": "In regards to the North and South poles, neither is \"the one that is always hot.\"",
                "user": "u/LeraViiiiii"
            },
            {
                "text": "That New Zealand, the country we were both born, raised and living in, is not in Europe.",
                "user": "u/AriasK"
            },
            {
                "text": "Africa is a continent and not a country",
                "user": "u/Mission_Literature44"
            },
            {
                "text": "Abraham Lincoln was assassinated and Italy is not a town in France. Same guy. My sister dated him for far too long.",
                "user": "u/GravityLands2018"
            },
            {
                "text": "That each country does not, in fact, have its own sun.",
                "user": "u/Reasonable-Cat5767"
            },
            {
                "text": "North is not whichever way you’re facing!",
                "user": "u/Tobias---Funke"
            },
            {
                "text": "That you have to have a printer to print things at home.  Tech support, and I wish I was lying.",
                "user": "u/i__hate__stairs"
            },
            {
                "text": "My husband had to explain to a co-worker that she couldn’t take a train from the U.S. to Europe.   She insisted she had to because she didn’t like flying.",
                "user": "u/Munchkin-M"
            }
        ],
        "processed": true
    },
    "1f2rkri": {
        "post": "For the ones who make over $150k a year, what do you do to get that?",
        "body": "",
        "user": "u/Iliketrainsz1",
        "comments": [
            {
                "text": "So this doesn't help anyone...but it certainly fits.  I worked sales for a company that sold ATMs.  We hired a new guy first week on the job a Chinese bank cold call him and order no joke 20k ATMs.  The dude got his bonus check and quite.  He make over 200k that year (lol).",
                "user": "u/baldieforprez"
            },
            {
                "text": "What would be neat is if everyone also included the number of hours they work per week.",
                "user": "u/ImReellySmart"
            },
            {
                "text": "Orthopedic surgeon. Made big sacrifices socially/traveling/income during 20s and early 30s while training. I’m 36 years old just starting my 3rd year of practice and make $840k straight salary. Probably work about 55 hours/week. It’s incredibly rewarding but also very stressful.",
                "user": "u/CrzyJoeDavola"
            },
            {
                "text": "Ship captain, 250k-ish for about 180 days of work.",
                "user": "u/Attitudde_Doll"
            },
            {
                "text": "I'm in B2B technical sales. I sell industrial starch to paper mills and charcoal plants. Base salary is $135K/yr, over the past 5 years bonus has ranged from $40K - $70K based off company performance.\n\nWe mostly hire engineers or at least people with technical background for our sales roles.",
                "user": "u/peon2"
            },
            {
                "text": "I do transport for a mortuary in the SF Bay Area (picking up dead bodies). My base pay is about 80k, but I get plenty of extra hours and overtime because I'm pretty much the only one who volunteers to do the So-Cal and out of state trips (we will only go as far as Nevada, Arizona, Oregon, and the border towns of Mexico). With all the overtime I easily make $150k+.",
                "user": "u/Jack_Torrance80"
            },
            {
                "text": "Lawyer (USA). Undistinguished academic record from an undistinguished law school. Took me a while to get my first legal job, which I still have. Started at 65k. About to start my 4th year at 150k. Strictly WFH, no billable requirement, generally very easy and low-stress. Occasionally I get to help people. Can't complain!\n\nBy the standards of the profession I am not paid well. By the standards of the profession in my geographic area, it is a fine living. By my standards - grew up rural and pretty poor - I am doing just *dandy*.\n\nThe real questions is going to be: do I try to job-hop to increase my salary (and possibly find more stimulating work, too!) - or do I just look in the mirror every morning and say \"bro we are SO lucky\" and use my copious free time for other things?",
                "user": "u/daxelkurtz"
            },
            {
                "text": "Slot game mathematician.  You know how they say the games are rigged? I'm the guy that rigs it from math scratch work to the code that runs it.",
                "user": "u/Trickishwheat8"
            },
            {
                "text": "Trauma Surgeon",
                "user": "u/Thin-Midnight291"
            },
            {
                "text": "I’m a fundraising consultant. Anyone who can write well, look into writing grants. It’s an incredibly niche skill.\n\nEdit: I’m still keeping a look out in my DMs and Chats for unique questions, but just to let you know, a ton of the questions you all have are probably answered in the replies below. From how to get into it to my take on AI in the future. If you have a truly unique question, feel free to reach out still, but know it may take a couple days.",
                "user": "u/akablacktherapper"
            },
            {
                "text": "Just want to say this has been a solid informative thread.",
                "user": "u/3legcat"
            }
        ],
        "processed": true
    },
    "1f1vfqq": {
        "post": "What’s something you tried once and instantly knew it wasn’t for you?",
        "body": "",
        "user": "u/Best-Palpitation-915",
        "comments": [
            {
                "text": "Gambling. I gambled for the first time against my cousins when I was around 13, I lost 100 bucks, that was a lot for me. Never gambled again since lol",
                "user": "u/carleezy89"
            },
            {
                "text": "Sales. I don't like convincing people they need things, they can decide themselves lol. Don't want a phone? Thats cool with me. \n\nMy boss once questioned why I didn't try to push an iPhone 14 onto an old man who came in asking for advice on how to use his flip phone, always loved that one. \n\nThe only time I ever had good performance was when I got a lucky streak and the customers came in wanting something already.",
                "user": "u/DriedUpSquids"
            },
            {
                "text": "Living with roommates. Cannot stand it. I'm fine living with a partner, family, or by myself. But a stranger, no thank you.",
                "user": "u/what_is_fondant"
            },
            {
                "text": "Getting into management…no thank you.",
                "user": "u/whiskey_endeavors"
            },
            {
                "text": "I once tried to be a morning person. We both agreed it wasn't going to work out.",
                "user": "u/Swimming_Twist_3717"
            },
            {
                "text": "Waitressing. I knew instantly I was objectively terrible at it. Quit same day I started.",
                "user": "u/ILikePlantsNow"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Tinder (actually online dating in general)",
                "user": "u/Express_Flight_966"
            },
            {
                "text": "I was shocked at how much I hate weighted blankets. People say so many good things about them! I put it over me, boom, instant claustrophobia. I don't even have claustrophobia. Except with weighted blankets.",
                "user": "u/wombatIsAngry"
            },
            {
                "text": "Telemarketing",
                "user": "u/22Taco"
            }
        ],
        "processed": true
    },
    "1f2wack": {
        "post": "Who's an actor with zero chops or range yet somehow keeps getting work?",
        "body": "",
        "user": "u/maverick1ba",
        "comments": [
            {
                "text": "Michelle Rodriguez always plays mean, kinda sexy, I'm glaring at you, but you like it girl. \n\nBut I'm fine with that. She actually got questioned about being typecast, and said she would rather play herself so she doesn't have to act.",
                "user": "u/EternalMage321"
            },
            {
                "text": "One day my brother let me know that Paulie Shore's mother owned The Comedy Store and suddenly the 90s made more sense to me.",
                "user": "u/Ixothial"
            },
            {
                "text": "Steven Seagal.",
                "user": "u/Cuteee_Drama"
            },
            {
                "text": "Calculon.",
                "user": "u/Ameisen"
            },
            {
                "text": "Ruby Rose. The kind of actor best appreciated in promo pics.",
                "user": "u/LupitaScreams"
            },
            {
                "text": "Cara Delevigne. Terrible actress",
                "user": "u/LonelyBiochemMajor"
            },
            {
                "text": "Troy McClure is in too many infomercials",
                "user": "u/TickleBunny99"
            },
            {
                "text": "Steven Seagal. How that guy ever got famous is beyond me.",
                "user": "u/10PieceMcNuggetMeal"
            },
            {
                "text": "Kevin Hart and The Rock\n\n\nI'm sure they're both nice people when they want to be but their acting sucks",
                "user": "u/ConReese"
            },
            {
                "text": "Might get some hate for this, but Kevin Hart is Kevin Hart in every movie.  He’s hilarious and works well in the roles he’s in. I have nothing against the guy. I don’t think his acting has much range, though.",
                "user": "u/SerRikari"
            },
            {
                "text": "Jennifer Lopez",
                "user": "u/xrc20"
            }
        ],
        "processed": true
    },
    "1f1o9ir": {
        "post": "People who “never get tired” what’s your secret? ",
        "body": "",
        "user": "u/RegisterAfraid",
        "comments": [
            {
                "text": "That’s my secret, Cap, I’m always tired",
                "user": "u/Bethorz"
            },
            {
                "text": "Im a person who experiences great laziness. And sometimes ridiculous amounts of energy - and I've finally understood that at least for me it's all tied to level of interest.\n\nIf something is fascinating to me - I have ridiculously few limits.\n\nIf something is boring, I'm ridiculously unmotivated.\n\nUnfortunately it seems about 80% of life is in the boring category.",
                "user": "u/redditizio"
            },
            {
                "text": "Daily excercise, good sleep, lots of water, balanced diet, interaction with people - and all that in a cycle of good habits",
                "user": "u/heavyer93"
            },
            {
                "text": "Decent diet and sleep.",
                "user": "u/brashet"
            },
            {
                "text": "Everyone in here is saying caffeine. But for me cutting out caffeine completely was the best thing I ever did for my energy levels. No coffee and no tea.",
                "user": "u/FunkyDutch"
            },
            {
                "text": "You just don't see me sleeping haha",
                "user": "u/kitty_loove__"
            },
            {
                "text": "iron deficiency and coffee\n\nYou get used to the tired so extra tired doesn't have an effect",
                "user": "u/tupsvati"
            },
            {
                "text": "Bills to pay, very effective",
                "user": "u/earth2mac"
            },
            {
                "text": "Daily exercice",
                "user": "u/pontiflexrex"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "I'm pretty sure my friend is on amphetamines, possibly cocaine. Her day is packed from the moment she wakes up to the moment she goes to bed, if she goes to bed. \n\nIt's not just work, she just packs her day with so much stuff. She always has to be doing stuff, running places, meeting up with people. No one can keep up with her. \n\nYou can't just hang out and smoke a bowl for an afternoon. It's always running errands, going out for ice cream, stopping at stores, cleaning a shed, she just has lists of objectives and she's balls to the wall from the moment she wakes up to the moment she goes to bed. \n\nI don't know how she does it, and I could never live that life. \n\nI need a nap. Just thinking about it.",
                "user": "u/MyDarlingCaptHolt"
            }
        ],
        "processed": true
    },
    "1f38u2b": {
        "post": "What actor is a major turn off for you to stop watching a show/movie? ",
        "body": "",
        "user": "u/Bountsie",
        "comments": [
            {
                "text": "Steven Seagal",
                "user": "u/Street_Ad_863"
            },
            {
                "text": "Elizabeth Moss. Scientologist’s make me uncomfortable and I can’t get it out of my mind when I see her on screen.",
                "user": "u/Akmaster87"
            },
            {
                "text": "Jared Leto.  I was excited about the new Tron movie until I heard he was in it.",
                "user": "u/essaysmith"
            },
            {
                "text": "Lea michele",
                "user": "u/RepresentativeGur749"
            },
            {
                "text": "She's not an actor (and that's the problem) but Kim Kardashian is the reason I didn't bother watching the latest AHS, a show that I've adored since it came out and have rewatched several times. I have just zero interest in anything that could remotely support her.",
                "user": "u/TheCelloIsAlive"
            },
            {
                "text": "Kevin Hart \"I'm short and I'm black\" literally every joke he has.",
                "user": "u/MadarasLimboClone"
            },
            {
                "text": "Surprised Ezra Miller isn't here yet.",
                "user": "u/Initial_Constant4786"
            },
            {
                "text": "Jennifer lopez",
                "user": "u/dragonjss44"
            },
            {
                "text": "Whenever I see an actor who's notorious for playing themselves in every role, I can't help but check out. It's like, \"Oh look, it's \\[Actor's Name\\] pretending to be a scientist/lawyer/superhero, but really just being \\[Actor's Name\\] in a lab coat/courtroom/cape.\"",
                "user": "u/lily_book"
            },
            {
                "text": "Gwyneth Paltrow",
                "user": "u/Missus_Aitch_99"
            }
        ],
        "processed": true
    },
    "1f173e5": {
        "post": "What's a daily inconvenience that you still can't believed hasn't been solved?",
        "body": "",
        "user": "u/AVeryBadMon",
        "comments": [
            {
                "text": "When I select “open in app” and it brings me to the App Store for an app I already have downloaded",
                "user": "u/acrusty"
            },
            {
                "text": "Successfully cleaning the inside of a windshield.  What's up with that science?",
                "user": "u/FalstaffsMind"
            },
            {
                "text": "Junk mail. Robo calls. Spam emails. Wasteful communication of all sorts. Feel like this is something trained AI could deal with pretty easily. No idea how we've progressed this far with junk; not even nefarious junk just communication that's absolutely unnecessary.",
                "user": "u/the-watch-dog"
            },
            {
                "text": "The buildup that happens in lotion/soap pumps of hardened product. You go to use the product and that buildup acts as a stopper until the pressure pushes it loose and also shoots a stream of lotion/shampoo/whatever across the room.",
                "user": "u/h3lpfulc0rn"
            },
            {
                "text": "Why do printers so reliably not print?",
                "user": "u/Underwater_Karma"
            },
            {
                "text": "I'd really like it if google and youtube would stop asking me if I want to sign in. Just let me look up whatever it is and leave me alone! If I wanted to be signed in, I would've done it already! All it does is annoy me when they randomly ask while I'm trying to do something.",
                "user": "u/idratherchangemyold1"
            },
            {
                "text": "Not having zipper-loc bags inside cereal boxes.",
                "user": "u/rlw1138"
            },
            {
                "text": "Unsynchronized traffic lights",
                "user": "u/Prestigious-Wall5616"
            }
        ],
        "processed": true
    },
    "1f2uss6": {
        "post": "What’s a phrase somebody may say that indirectly indicates that they’re wealthy?",
        "body": "",
        "user": "u/KlLLERS",
        "comments": [
            {
                "text": "Had a classmate when I was about ten who was telling me all about the summer him, his parents, and his brother had in Switzerland. Then, out of nowhere, he asks me \"What's your favorite part of Switzerland?\" When I told him I'd never been before he seemed genuinely baffled, didn't even believe me at first, then asked \"Why?\" I said \"Well we probably can't afford it\" and the look on his face told me that such a concept had never even occurred to him.",
                "user": "u/kingcorning"
            },
            {
                "text": "When discussing finances and they say we do okay they typically do better than you would expect",
                "user": "u/1d0m1n4t3"
            },
            {
                "text": "I was in a group setting for new parents, and one of them said, and I quote: \"we took our baby out on the small boat\". \n\nVery nice people, but own both a small and apparently large boat.",
                "user": "u/Socalgardenerinneed"
            },
            {
                "text": "We've been very fortunate",
                "user": "u/Ancguy"
            },
            {
                "text": "\n\nI got this guy extra sauces at my job and he slipped me a $20.",
                "user": "u/pipay1291"
            },
            {
                "text": "Any activity that takes place at \"The Club\" or any reference to \"The Yacht Club\".  IRL, my childhood bedroom window looked out at the yachts docket at one of the neighborhood yacht clubs.",
                "user": "u/NYC_DILF"
            },
            {
                "text": "\"Yeah we got a little place on the water,\"\n\nEdit: yeah, you don't have to be rich to own some lakeside or riverfront property, but this comment is best understood by hearing it in person. It's the way they say it. \"Little\" is not what it is btw.",
                "user": "u/its-have-not-of-"
            },
            {
                "text": "They're \"retired\" but in their 30s.",
                "user": "u/readsalotman"
            },
            {
                "text": "\"Just buy another one\"",
                "user": "u/jcunicornartsy12"
            },
            {
                "text": "referring to your ivy league education only by its city name “yes i went to new haven for my undergraduate degree and then boston for my medical”",
                "user": "u/vftgurl123"
            },
            {
                "text": "Student job at uni, some rich kid; \"why do you even work for fun, just ask your parents to give you more money\".",
                "user": "u/adz86aus"
            }
        ],
        "processed": true
    },
    "1f2dj4g": {
        "post": "What simple piece of advice has significantly improved your life?",
        "body": "",
        "user": "u/Roboaut",
        "comments": [
            {
                "text": "“If you can’t beat the fear, do it scared.”\n\nMy anxiety and panic attacks often paralyze me to the point of convincing me I can’t do anything. This quote helped me a lot to overcome those feelings and feel more in control while recognizing the feeling of discomfort.",
                "user": "u/AleneElora"
            },
            {
                "text": "You can't control the emotions you feel but you can control the actions you do regards those emotions.",
                "user": "u/MoonlitStar"
            },
            {
                "text": "Do what you want, not what others expect of you",
                "user": "u/honeyxevelyn"
            },
            {
                "text": "\"You can't keep blaming yourself. Blame yourself once and then move on.\"  \nFrom Homer Simpson of all people, but it has been helpful with me moving forward.",
                "user": "u/Sea-Security9680"
            },
            {
                "text": "Never accept criticism from someone who you wouldn’t accept advice from.",
                "user": "u/ukman29"
            },
            {
                "text": "“I spent 89 years worrying about things that might happen that never did.”   \n\nWW2 vet fishing bro. ",
                "user": "u/ANAL_QUEENisyourmom"
            },
            {
                "text": "Self-abuse is also abuse. Talk kindly to yourself.",
                "user": "u/reptrept"
            },
            {
                "text": "\"Don't compare your behind-the-scenes to someone else's highlight reel.\" It's made me appreciate my own journey and achievements instead of constantly feeling inadequate.",
                "user": "u/PhantomFateee"
            },
            {
                "text": "It's okay to be jealous of someone, but you have to be jealous of the whole package, not just part.  For example, if you want to be jealous of their nice house, you have to be jealous of their soul-crushing job too.",
                "user": "u/thearroyotoad"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            }
        ],
        "processed": true
    },
    "1f0thf5": {
        "post": "What's the saddest episode of a show?",
        "body": "",
        "user": "u/BVTQT",
        "comments": [
            {
                "text": "Modern Family when Phil goes down to visit his dad in Florida because he thinks his dad isn’t okay and the entire episode he has a great day with him and it cuts to Phil in the future saying “I’m so glad I had the best day with my dad… but what I didn’t realize is that it would be my last” and it cuts to his dad’s funeral",
                "user": "u/Pigeon_Barf"
            },
            {
                "text": "The scrubs episode where Dr Cox keeps seeing Jordan's brother everywhere, then right at the end he realises that they are at his funeral. not much media makes me cry, but this definitely had me in bits. easily the saddest episode ever.",
                "user": "u/jeremy-irons-cereal"
            },
            {
                "text": "House MD, S5 EP24. He realises his last few memories were all hallucinations and you can see him mentally break down when he realises. Topclass acting by Hugh Laurie",
                "user": "u/bunny_kissesXO"
            },
            {
                "text": "The View From Halfway Down kinda broke me for a while (Bojack Horseman)",
                "user": "u/PalladiuM7"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Buffy - The Body",
                "user": "u/fieschen"
            },
            {
                "text": "Tales of ba sing se..",
                "user": "u/Dorsie_"
            },
            {
                "text": "The Good Place, last ep. \n\nHoly waterworks Batman, that one gets me every time.",
                "user": "u/WorldAncient7852"
            },
            {
                "text": "Doctor Who episode about Vincent Van Gogh.  That final scene will always be a tearjerker!  (Getting teary-eyed just thinking about it!  lol)",
                "user": "u/dragonmom1"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            }
        ],
        "processed": true
    },
    "1f1zsy4": {
        "post": "What was the easiest money you've ever made in your life?",
        "body": "",
        "user": "u/Infosignalsol",
        "comments": [
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "I made $100k selling dicks.\n\n\nI thought up a play on the old \"eat a bag of dicks\" insult, and made a website to anonymously send people a bag of gummy dicks with the message \"eat a bag of dicks\". Simple.\n\nAfter getting the website live over a few drinks, I shared it with some friends, posted some pics on Imgur saying \"look what I got in the mail!\" With a link and boom... Within 3 days there was $100k in orders and offers to buy the company (I sold it).\n\nSpent about $100 for the domain and a dozen bags of gummies, then went to a distributor for wholesale when things took off.",
                "user": "u/Twice_Knightley"
            },
            {
                "text": "My friend dragged me to the Casino with him and convinced me to play a slot machine. I walked around for a bit and found a cool looking monopoly slot machine (1$ machine).\n\nFirst spin I hit the bonus wheel which ended up paying out about $3000. Cashed out and didnt play anymore 😆",
                "user": "u/poontato"
            },
            {
                "text": "I used to freelance software development. \n\nI had a regular client who had a project that I was contributing to here and there. \n\nHe’s in the US I’m in Ireland. \n\nOne night, at 3am, I woke up to go to the toilet and saw an email on my phone with “urgent” in the subject line. \n\nI read it and he said “man if you can fix this one last bug the project is complete… I’ll send you whatever is left in the project budget if you can fix this in the next 2 hours”. \n\nI grabbed my laptop on my bedside table…. saw the bug … fixed a simple variable name. Closed my laptop and went to bed. All in all it took 40 seconds. \n\nWhen I woke up there was £5500 in my Stripe account. \n\n£5500 for less than 1 minutes work is pretty good going! I wish they were all like that. 😂😂",
                "user": "u/Tinpotray"
            },
            {
                "text": "$50k retention bonus at work when I had no intention of leaving.\n\nI started not carrying about work, so I would take half days off randomly to do stuff I enjoyed.\n\nMy boss thought I was interviewing for other companies so fought to get me the retention bonus. Free money. I'll take it.",
                "user": "u/New2ThisThrowaway"
            },
            {
                "text": "Filled out a form and got a check for $5,000 for \"unclaimed property\". I dug into it; someone made a banking error when settling the sale of a condo I used to own.",
                "user": "u/tastytang"
            },
            {
                "text": "For three quarters at school I got paid full T/A  salary for watering plants in a greenhouse and watering and feeding animals in the animal room on the weekends. Less than an hour a day.",
                "user": "u/LifeHappenzEvryMomnt"
            },
            {
                "text": "In the early 2000's, it was being an expert at Adobe software. People would pay me to do portions of their project because they never bothered to learn how to use Illustrator and do it themselves. Easy money. Charged hundreds to \"vectorize\" raster logos which took a few clicks and maybe 30 seconds for me to do.",
                "user": "u/permafacepalm"
            },
            {
                "text": "$500 to use my Jeep in a Selsun Blue commercial. I sat in an air conditioned trailer for 2 hours.",
                "user": "u/afm00dy"
            },
            {
                "text": "Box of new Braun electric shaver replacement heads at the thrift store. 77 of them new in individual packages marked $4.99 each. They go for $15-20 on eBay and would be easy to sell as a lot so I grabbed the box.\n\n\"How much if I buy all of them?\"\n\nThem: \"Umm, well there's a lot of them in there, how about $40?\"\n\n\"Uhh, sure\"\n\nThey sold for $1,000USD within a week (~$12 each)",
                "user": "u/gfanonn"
            }
        ],
        "processed": true
    },
    "1f3indl": {
        "post": "What TV show would you rate 10/10 that has fewer than 50 episodes ?",
        "body": "",
        "user": "u/yassinebtr",
        "comments": [
            {
                "text": "Plenty tbh  \nOver the Garden Wall  \nMIND HUNTER!  \nChernobyl too\n\nI will have to go on and on",
                "user": "u/Hallrgw17"
            },
            {
                "text": "Just rewatched Gravity Falls with my daughter. Still holds up.",
                "user": "u/OldDipper"
            },
            {
                "text": "Freaks and Geeks - one season of absolute perfection that deserved way more than 18 episodes",
                "user": "u/Sudden-Meaning-2297"
            },
            {
                "text": "Spaced",
                "user": "u/beakersoft360"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Police Squad",
                "user": "u/Bordighera12"
            },
            {
                "text": "Over the Garden Wall",
                "user": "u/OEMichael"
            },
            {
                "text": "Chernobyl, without a doubt",
                "user": "u/sofi_thenotsofi25"
            },
            {
                "text": "MindHunter",
                "user": "u/InterviewTotal6066"
            },
            {
                "text": "Deadwood",
                "user": "u/raised85"
            },
            {
                "text": "If you like World War II, Bands of brother is a good option",
                "user": "u/thecutehill_Ava24"
            }
        ],
        "processed": true
    },
    "1f1fi8l": {
        "post": "which celebrity did you used to admire but now hate and why?",
        "body": "",
        "user": "u/lemonscentedrose",
        "comments": [
            {
                "text": "I don't admire any celebrity except Fred Rogers.\n\nAnd I PRAY nothing terrible ever comes out about him.",
                "user": "u/xcoalminerscanaryx"
            },
            {
                "text": "I grew up in an era where Bill Cosby was THE wholesome, upright family comedian. I listened to his stand up on cassette tapes for gosh sake. Finding out that he was a scumbag and had been for a long time was sad.",
                "user": "u/Ornery_Seat_6205"
            },
            {
                "text": "As a teenager I was a big Lost Prophets fan. Safe to say I don’t appreciate Ian Watkins’ work quite as much anymore.",
                "user": "u/dcpb90"
            },
            {
                "text": "Honestly Lea Michele. I used to think all the diva stuff was just nasty rumours.",
                "user": "u/TurnoverTechnical262"
            },
            {
                "text": "Rolf Harris was an Australian icon. Everyone in Australia could recognise him and knew at least one of his songs. His paintings were displayed in galleries and buildings across the country. \n\nTurns out he was molesting underaged girls. Almost as soon as he was arrested, his paintings were taken down and plaques dedicated to him disappeared. His music was removed from radio stations. There were some holdouts, but those gave in after he was convicted. \n\nThe creepiest part? In the 80’s, he filmed an educational video that taught children how to avoid being molested. \n\nWhen he died, his family kept his death a secret for ten days so protestors wouldn’t find out and disrupt his funeral.",
                "user": "u/Walter_Armstrong"
            },
            {
                "text": "Ellen DeGeneres. Loved her show growing up. Now I can’t stand her",
                "user": "u/Usual-Smell-1214"
            },
            {
                "text": "Jebediah Springfield. \n\nI used to think he was a hero until Lisa Simpson exposed his true past.",
                "user": "u/beers_n_bags"
            },
            {
                "text": "I used to be a huge Nicki Minaj fan, but she’s said/done a lot of questionable things over the past few years",
                "user": "u/vilify97"
            }
        ],
        "processed": true
    },
    "1f6fr0b": {
        "post": "What’s something obvious for everyone, but you only just realized?",
        "body": "",
        "user": "u/Ratich2",
        "comments": [
            {
                "text": "This was a long time ago but the first time I got my eyes checked I was in first or second grade or something. The optometrist told my mom I'm almost completely blind in one eye. She looks at me and asks why I wouldn't say anything?? I said I thought everyone only had one working eye 🤦🏻‍♀️",
                "user": "u/arifern_"
            },
            {
                "text": "An old archaeologist moved in next door when I was about 6, and he asked me to go look on his driveway to help find fossils that he might dropped while moving in. I found two, that I still have to this very day (he told me to keep them)\nI was an adult before I realised he placed them there for me to find. \nHe was a very nice old professor.\n\nNot not mention how cool I became in the eyes of my friends for owning fossils.",
                "user": "u/henriktornberg"
            },
            {
                "text": "I didn’t know my mom had a name until in first grade the teacher asked us what our mothers’ name was, everyone answered but me I nevar realized my mom had a name I questioned my entire existence! I went to her straight after school she was cooking in the kitchen I asked her mama what’s your name? She smiled stopped cooking and came down to my height and told me her name. it was a sweet memory but man I felt shame that I didn’t know that sooner :/",
                "user": "u/EnvironmentalPiece29"
            },
            {
                "text": "I was 30 before I found out that the lights doing that stretchy thing at night wasn't normal - I have astigmatism",
                "user": "u/StatusUnknown_"
            },
            {
                "text": "So I'm not a native speaker which might make this somewhat excusable. But for the longest time, I thought sitcoms were named that because the main characters spend most of their time sitting (in a living room, in a bar, ...)",
                "user": "u/AfRotaker"
            },
            {
                "text": "That you can click ‘don’t accept any cookies’ and websites work just fine. I always thought that would also disable essential cookies so would either accept all or go through the motions of only allowing essential ones..",
                "user": "u/mitchw87"
            },
            {
                "text": "A few years back, I realized that the Christmas song, I saw Mommy kissing Santa Claus, wasn't actually about the mother being unfaithful and putting out for St. Nick, but it was just the dad dressed as Santa. \n\nFor almost my entire life, I thought the mom just got around. I was 26 when I realized otherwise.",
                "user": "u/Shodspartan"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "I didn’t realize until a couple of years ago it’s “pitch black” as in pitch aka tar.",
                "user": "u/c_girl_108"
            },
            {
                "text": "For the longest time, I always thought Prima Donna was Pre-Madonna",
                "user": "u/Firm-Answer-148"
            }
        ],
        "processed": true
    },
    "1f74ywx": {
        "post": "What is something you tried once but will most likely never do again?",
        "body": "",
        "user": "u/truth2991",
        "comments": [
            {
                "text": "Going to Costco the day before Thanksgiving 🫠",
                "user": "u/Bwhite0425"
            },
            {
                "text": "Clicked “view my rate” for a mortgage home equity loan on one of those brokerage sites. I got 167 calls in 2 hours. Took a month to stop getting calls no matter how many numbers I blocked.",
                "user": "u/PharmToTable15"
            },
            {
                "text": "Bungie jump. Still amazed I actually did it. Was amazing, but no desire to go through it again. Once was enough just to tick the box.",
                "user": "u/AlternativeCry2206"
            },
            {
                "text": "Beg someone to stay when they don't want to.",
                "user": "u/iblamehadid"
            },
            {
                "text": "Attempted a DIY home renovation project. The only thing I renovated was my patience",
                "user": "u/Last-Court5382"
            },
            {
                "text": "Skydiving. It was thrilling but I spent most of the time trying to settle in and enjoy it but frankly, it didn't last very long considering the exorbitant cost and time spent getting out there, suiting up, and getting back afterwards.",
                "user": "u/lockednchaste"
            },
            {
                "text": "Not taking care of my teeth, now I'm dealing with pain and medical bills from dental implants. Seriously, take care of your teeth guys",
                "user": "u/Perfect-Treat-6552"
            },
            {
                "text": "Tickle the person who absolutely hate tickles.",
                "user": "u/anonymousesoldier"
            },
            {
                "text": "Ate a raw egg including the shell once on a dare. It was worse than you can imagine.",
                "user": "u/Blinky_"
            }
        ],
        "processed": true
    },
    "1f60j54": {
        "post": "What’s something that improved your sleep quality significantly?",
        "body": "",
        "user": "u/Due_Plate6864",
        "comments": [
            {
                "text": "i got a blackout curtain that turns my room into a cave. my roommate calls it the bat cave but hey i sleep like a rock now",
                "user": "u/oheartlixi"
            },
            {
                "text": "Trying to study. As soon as I try to study, I fall asleep immediately",
                "user": "u/tanvirina"
            },
            {
                "text": "Daily consistent movement.  For example, 20 minutes of elevated heart rate, stretching, and 6000+ steps per day.  Biggest difference.",
                "user": "u/gahooa"
            },
            {
                "text": "Sleeping separately from my snoring partner.",
                "user": "u/seahorse382"
            },
            {
                "text": "Regular exercise and a better diet.",
                "user": "u/justanormalwhitedud"
            },
            {
                "text": "100% not drinking alcohol",
                "user": "u/massholeboater"
            },
            {
                "text": "CPAP machine unfortunately 😔",
                "user": "u/endotoxin"
            },
            {
                "text": "Blindfold and weighted blanket. If its hot out pull out the window fan",
                "user": "u/7_Rowle"
            },
            {
                "text": "Walking A LOT. I get like 20,000 steps in a day and I sleep so good and don't need to sleep as much cause the sleep I get is quality. Honestly exercise in general and magnesium has been amazing in improving my sleep.",
                "user": "u/Known-Salamander-821"
            },
            {
                "text": "White noise machine, also not drinking",
                "user": "u/No_Check3660"
            }
        ],
        "processed": true
    },
    "1f6u2f7": {
        "post": "What deceased person was younger than most people think when they died?",
        "body": "",
        "user": "u/TPCC159",
        "comments": [
            {
                "text": "Mozart died at 35. He composed over 800 works.",
                "user": "u/applestem"
            },
            {
                "text": "Otis Redding was 26. Had just recorded “Dock of the Bay,” but didn’t live to see it released. \n\nListening to his music, it is absolutely astounding that his incredibly soulful voice belonged to someone so young.",
                "user": "u/MerryTexMish"
            },
            {
                "text": "Buddy Holly died at 22. He left enough unfinished recordings and transcriptions behind that his label was able to release Buddy Holly singles for 10 years after his death.",
                "user": "u/probably-the-problem"
            },
            {
                "text": "Mama Cass from the Mama's and the Papa's was only 32.",
                "user": "u/DefendTheStar88x"
            },
            {
                "text": "Alexander the Great was 32.",
                "user": "u/klsmv"
            },
            {
                "text": "Bob Marley was only 36.",
                "user": "u/12345_PIZZA"
            },
            {
                "text": "bruce lee was only 32, crazy right",
                "user": "u/mindfulmuserx"
            },
            {
                "text": "Van Gogh was only 37 when he died.",
                "user": "u/choose2hope"
            },
            {
                "text": "Joan of Arc was only 19 when they burned her to death",
                "user": "u/Himeh_Canknow"
            },
            {
                "text": "MLK was only 39. Marilyn Monroe was 36.",
                "user": "u/Competitive_Crew_983"
            },
            {
                "text": "Robert Wadlow - tallest man in the world  died of a foot infection at age 22.  He went to high school with my husband's grandparents.  He was 8' 11.1\" tall when he died.  He had to go up the stairs at school sideways.",
                "user": "u/catladyx65"
            }
        ],
        "processed": true
    },
    "1f8ds9w": {
        "post": "What tastes so good you can’t believe it’s healthy?",
        "body": "",
        "user": "u/Dry_Reply_5660",
        "comments": [
            {
                "text": "A freshly made salsa or pico de gallo",
                "user": "u/VariationEarly6756"
            },
            {
                "text": "All the berries.",
                "user": "u/Paula75brsp"
            },
            {
                "text": "Perfectly ripe cherries.",
                "user": "u/barneyrubbble"
            },
            {
                "text": "Juicy peaches. ",
                "user": "u/Traditional-Hat-952"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Garlic",
                "user": "u/Careful-Cod-4124"
            },
            {
                "text": "mango and kiwi",
                "user": "u/Strong0toLight1"
            },
            {
                "text": "Pico de gallo, it's easy to make and doesn't need a lot, makes anything you're making so good",
                "user": "u/Loving-Paige"
            },
            {
                "text": "Air-fried chickpeas. Season with salt and pepper or go fancy with popcorn seasoning. ",
                "user": "u/Eurymedion"
            },
            {
                "text": "Cold water",
                "user": "u/mentallymental"
            },
            {
                "text": "Pomegranates. It’s like eating candy",
                "user": "u/unfeatheredbards"
            }
        ],
        "processed": true
    },
    "1f4n1pd": {
        "post": "What careers are a turn-off for a serious relationship?",
        "body": "",
        "user": "u/theonlinepartofme",
        "comments": [
            {
                "text": "Clown, I don't need the competition.",
                "user": "u/saunaton-tonttu"
            },
            {
                "text": "I think it'd be difficult for me to date a person in the bar scene. \n\n\nI work a standard 8-5. My free time to do anything fun is weekends.\n\n\nThey work like 6-2a on weekends, and are pretty flexible mid week, but even then, will work a lot of weekday nights, and even spend their free time at their bar or their friends' bars. \n\n\nIt's a lifestyle I just can't live, even when I really have strong feelings for someone.",
                "user": "u/DangerSwan33"
            },
            {
                "text": "Just anyone that is on a different shift/schedule than you is difficult. Only seeing each other one day a week even when living together.\n\nNot impossible, but a turn-off for sure",
                "user": "u/noncreative_creative"
            },
            {
                "text": "Long-haul trucking or constant travel jobs",
                "user": "u/xUrGirl"
            },
            {
                "text": "Film and tv workers . Brutal on families and partners.",
                "user": "u/Enough_Owl_1680"
            },
            {
                "text": "Pilots and Flight Attendants. Irregular hours and long periods away from home can make maintaining a stable relationship challenging.",
                "user": "u/omrahul"
            },
            {
                "text": "Actor. No money. On the off chance that they do make money it’s because they’re famous which sucks for you",
                "user": "u/Parking-Party1522"
            },
            {
                "text": "Anything with long hours. After a 12 hour day, you just want to shower, eat, vague out for 30 mins and then sleep.\n\nNot ideal for building a relationship.",
                "user": "u/dntdrmit"
            },
            {
                "text": "Bartender",
                "user": "u/des19nervcu"
            },
            {
                "text": "\n\nI've always wondered if people are turned off dating a therapist.\n\nAs for me, I would rather not date someone heavily involved in politics as their career. Seems like far too much stress and difficult to disconnect from.",
                "user": "u/AlluringCutiePie"
            },
            {
                "text": "anything involving constant travel or sketchy hours",
                "user": "u/CharmingHazel"
            }
        ],
        "processed": true
    },
    "1f4dhzj": {
        "post": "What’s something small you notice that shows someone has been through a lot?",
        "body": "",
        "user": "u/LuminousShadow27",
        "comments": [
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Hypervigilance",
                "user": "u/LikeReallyLike"
            },
            {
                "text": "There are a lot of negative responses here, which is completely understandable.. But I do want to add a positive sign of someone who's seen some things. They can be incredibly empathetic and patient, willing to listen with an open mind and emit a warmth from them that seems to say, \"I feel your pain, and my heart is with you.\"\n\nComing out of a painful part of life can really help a person understand why other people are the way they are, because they know what pain does to them.",
                "user": "u/nya9019"
            },
            {
                "text": "A lack of trust in most people. Often dismissed as just maybe a cynic but probably stems from a a lifetime of betrayal  maybe as early as childhood.",
                "user": "u/Neutrino-Quark"
            },
            {
                "text": "Disproportionate reactions. Their reactions to most things are normal or even low key, but occasionally they have a huge response to something minor. Key sign of trauma.",
                "user": "u/Tawands"
            },
            {
                "text": "Something scary or maddening happens and they just look bored or resigned.\n\nNo biggie, seen worse.",
                "user": "u/travlynme2"
            },
            {
                "text": "I work with parents/children who have endured (and some regularly still enduring) trauma. One thing I notice is in times of serious immediate stress, like an active shooter nearby as a real example, they go into a totally calm, rational state. Their brains seem to be trained to be more comfortable in chaos, they also seem to create chaos (often drama) when things start going too smoothly. A lot of people see this as self sabotage, but if you’re used to living in chaos, calm can feel really unfamiliar and frankly scary.",
                "user": "u/mydogisfour"
            },
            {
                "text": "Apologize for things constantly, particularly if they didn't do anything wrong.",
                "user": "u/Pluviophilism"
            },
            {
                "text": "People who are really kind with others but not with themselves.",
                "user": "u/thetwilightbandit"
            }
        ],
        "processed": true
    },
    "1f53yma": {
        "post": "what kind of people will you never understand?",
        "body": "",
        "user": "u/Sandra_Ell",
        "comments": [
            {
                "text": "People who visit beautiful trails, parks and/or beaches and leave their litter everywhere.",
                "user": "u/MooseMalloy"
            },
            {
                "text": "People who take other people's food out of a workplace fridge.",
                "user": "u/Keyboard_Warrior98"
            },
            {
                "text": "People who are mean to service/retail workers for NO reason",
                "user": "u/VeryAnnoyedTurtle"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Child abusers.",
                "user": "u/ScientistEasy368"
            },
            {
                "text": "People who abandon their dog at the side of the road when they're tired of it or want to get to vacation without it.",
                "user": "u/TheTroubledChild"
            },
            {
                "text": "People who keep having kids when they can't look after the ones they have.",
                "user": "u/Western-Mall5505"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Abusive people who take joy in making other people miserable",
                "user": "u/Connect_Entrance_644"
            },
            {
                "text": "People who hurt animals",
                "user": "u/Burnt__pasta"
            },
            {
                "text": "People who ask your opinion then get mad because it isn't the same as theirs.",
                "user": "u/NyshaBlue"
            }
        ],
        "processed": true
    },
    "1f68j4f": {
        "post": "Boomers whose children don't talk to you, what's stopping you from picking up the phone and talking to them?",
        "body": "",
        "user": "u/Status-Platypus",
        "comments": [
            {
                "text": "I work in healthcare and sometimes you call a patient's adult children and they politely ask that I do not contact them again. I trust that they have their reasons.",
                "user": "u/MMMojoBop"
            },
            {
                "text": "All of my kids are adults and very busy with their own lives and families... None of them are really \"Talk on the phone types\" and they know when I call it is important.\n\nI have health issues that limit my ability to go out and visit and I also work third shift 6pm-3:30am and my hours don't really match up to being too active with them. I live in a loft and do not have much room to have them over...\n\nBut I do try to text my daughters a couple times a week and play online games with my boys and chat with them on Discord... I've also learned to ask how they are all doing (seriously) and not just updating them on news and health.\n\nI truly love my kids but things are much different in my life being 60+ and single - I imagined differently, and own up to the fact a lot is on me.",
                "user": "u/strongdad"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "This thread is all the children talking about their parents rather than the boomers answering the question.",
                "user": "u/Altruistic-Falcon552"
            },
            {
                "text": "Bad communication skills mainly. I’ll admit my oldest son and I have never been very outwardly affectionate, but we’ve always had a good relationship as adults. We’ll go weeks or a couple months without talking sometimes, and it boils down to neither of us realizing that the other was wanting to hear from them the whole time. \n\nI was a military father, serving on navy submarine for nearly 3 decades. I was constantly away or unable to be present in my children’s lives. I’ll never regret my service to my country, but I will regret all the time I lost with my family and the relationships that never developed as well as they should have. \n\nI wasn’t raised in an affectionate family like my wife was, I’ve had to do a lot of reflecting at this stage in life to realize that maybe I actually wasn’t the best or most supportive father I should’ve been. Luckily these days our relationship is better than it has been in several decades, and I’m beyond thankful for it.",
                "user": "u/Tricky-Swordfish4490"
            },
            {
                "text": "I had an uncle that didn’t talk to his kids. He wasn’t a boomer, he was older, and his kids are just slightly too young to be boomers. It was a complicated childhood, and they didn’t want to talk to him after he left their mother (never them, according to them as well). They told him to stop calling, so he did. He said he understood where they were coming from but he deserved to be happy too. \n\nHe never called first to break the silence that had built between them, and it lasted for over a decade. However, he wrote letters to them every week. He respected that they didn’t want to talk to him but refused to accept that they never wanted to hear from him again (he was stubborn). So he thought about it long and hard and spoke with my grandmother about it. \n\nThey agreed that letters would work. It came in the mail and then if they wanted to read it, they could, if they didn’t, they could toss it out. No harm no foul. But they would know he thought of them every time they threw one away. After 12 years, the kids called him, and he told them he wouldn’t be the one to call first because they said not to and until they said otherwise, they’d have to call him. \n\nEventually everything was rebuilt and it was fine, but it was one time where I saw someone get it right.",
                "user": "u/TangledUpPuppeteer"
            },
            {
                "text": "Waiting to see whether anyone will say, \"They asked me to stop calling, and if I want to rebuild any trust the first step is to respect that boundary.\"",
                "user": "u/doublestitch"
            },
            {
                "text": "Gen X reporting in. My children refuse to answer any of my phone calls because they are convinced that I am a servant of the devil.\n\nIt's partly my fault because I helped to brainwash them into the same cult my parents indoctrinated me in. \n\nIt's probably my biggest regret in life.",
                "user": "u/stdio-lib"
            },
            {
                "text": "fear of opening old wounds and making things worse",
                "user": "u/SexyxAlly"
            },
            {
                "text": "Prison is not a very social place.  Calls are rare, expensive and one-way.",
                "user": "u/QuestionMean1943"
            },
            {
                "text": "My dad exclusively calls and texts when he knows I'm at work.  He doesn't actually want to talk, he wants to be the victim when I don't pick up. \n\nHow does he know I'm at work? I've had a 9-5 for 20 years. When he complains why I don't answer, I copy and paste the same message I've used for the past 5 years: \"I'm at work until 5.\" \n\nHe once called me 4x at 1am because I was \"off work.\"  \n\nWhat do we talk about when I do answer? Well, I don't talk, he does. And it's always about the money he *would* give me if I would visit. He's getting older, you know. Not much time to visit. All this for an hour, never asking about me or my life, then hanging up because he's tired of his constant stream of consciousness blather and doesn't actually want to hear what I have to say. \n\nToo bad he abandoned me as a kid, refused to have me on his custody weekend, only called me 4x in my 20s to ask for money, and now wants to try and start being a dad at newly 60. \n\nHe only started actively calling me as of 2022/2023 (4x a week) rather than the old quarterly texts.",
                "user": "u/IAmBabs"
            }
        ],
        "processed": true
    },
    "1f869uz": {
        "post": "What's something that some people have that they don't realize is a huge flex?",
        "body": "",
        "user": "u/daemon_ritus",
        "comments": [
            {
                "text": "Good parents",
                "user": "u/__ThePasanger__"
            },
            {
                "text": "Extremely supportive parents that are also financially able to help me out from time to time",
                "user": "u/a-little-stitious420"
            },
            {
                "text": "No allergies",
                "user": "u/87lonelygirl"
            },
            {
                "text": "Patience. Impulse control. Most people are a lot more reactive than they realize.",
                "user": "u/Former-Finish4653"
            },
            {
                "text": "the ability to fall asleep quickly anywhere",
                "user": "u/capricornthings"
            },
            {
                "text": "Parents who love them unconditionally,",
                "user": "u/e11spark"
            },
            {
                "text": "A partner who loves them",
                "user": "u/mithridateseupator"
            },
            {
                "text": "Friends. I have one that would complain how she barely managed to find someone to hang out with that day because everyone else was busy. Meanwhile I'm crying inside knowing full well this is the first time I'm hanging out with someone in last two weeks.",
                "user": "u/SweetLikeBerry"
            },
            {
                "text": "People skills and being able to read a room instantly",
                "user": "u/LynxEqual9518"
            },
            {
                "text": "Existing while not being in constant pain",
                "user": "u/Fyrrys"
            },
            {
                "text": "Savings each month instead of digging deeper into a debt hole.",
                "user": "u/YounomsayinMawfk"
            }
        ],
        "processed": true
    },
    "1f4pj38": {
        "post": "What are hints that women give that most men don't pick up on?",
        "body": "",
        "user": "u/Dee_Religion",
        "comments": [
            {
                "text": "I had a coworker girl ask me one time if I could help her move her bed which I thought was odd, it's pretty doable with one person. I get to her house and she has like a 18 year old brother, I was like why didn't you ask him to help? I moved the bed then left. The next day at work, I had some girl friends ask did I get lucky? I was confused and said no, I just moved her bed for her and left. They all laughed at me hahaha",
                "user": "u/_maxxwell_"
            },
            {
                "text": "If I keep glancing down at the pickle sitting on your plate that you're not eating, I want it",
                "user": "u/shawnaeatscats"
            },
            {
                "text": "I once got yelled by my female coworker. She said “haven’t you noticed that for the last two months the first thing I do when I arrive is come to your desk and say hello? And that I don’t do that for anyone else?”\n\nI honestly hadn’t noticed. \n\nI did notice she always arrived later than me. That is the only thing I had noticed. Honestly. \n\nAnyway after that little bit of frustration and yelling we did end up having a thing for a while.",
                "user": "u/Kriskao"
            },
            {
                "text": "I once asked a guy if I could kiss him (we had been hanging out in a way that was conducive to that), and he said yes. I kissed him. It was great. But then we just parted ways naturally.\n\nThree days later, this man called me all shocked that I was hitting on him. He told a friend about the interaction, and they had to point it out.\n\nSir... I literally kissed you.",
                "user": "u/Neat-Requirement-959"
            },
            {
                "text": "Ladies reading this thread, I've had a 100% success rate with asking a guy for his phone number to start working towards a relationship.\n\nGet to know them, start up a rapport, make sure they're single, then get their number.  Be direct.  Tell them you like them and want to go on a date.\n\nIf he likes you, he'll be flattered.  If he doesn't like you, then you don't need to date him.  That's it.  If he tries to make you feel bad for asking, then you dodged a bullet and have lost nothing.",
                "user": "u/NeedsItRough"
            },
            {
                "text": "All of them. \n\nSeriously, if you're a man like me, I'm TERRIBLE at hints. She'd have to explicitly tell me that she likes me / wants to be with me. And even then, I'd be scared that I'm getting pranked (because... that's happened to me before).",
                "user": "u/jaysornotandhawks"
            },
            {
                "text": "A sizable number of guys don't want to come off as being creepy, or overly forward. The result is that people of this sort will see a clear hint and brush it off as, \"they probably don't mean it that way\".\n\nAnecdotally, back in high school a pretty girl sat next to me for about two weeks at lunch and would make comments like, \"I could really see myself with someone like you!\" while also being exceptionally handsy. I naturally assumed she didn't mean *literally* me and just thought, \"Neat! I guess I'm not hopeless after all!\". After she realized that I wasn't being very responsive to her hints, she just stopped joining me at lunch.\n\nLadies, if you're reading this and you've got your eye on a fella, just go ahead and be blunt about it. We are incredibly dense at the best of times. We won't think you're weird. We won't think you're a creep.",
                "user": "u/TheBaconmancer"
            },
            {
                "text": "Keeping the conversation short, no intention in prolonging the conversation at all.",
                "user": "u/BewitchingSiren1"
            },
            {
                "text": "After a thorough analysis of this thread, I’ve concluded that both men and women are terrible at this.",
                "user": "u/Lord_Battlepants"
            }
        ],
        "processed": true
    },
    "1f7b0cw": {
        "post": "What's worth spending 15 minutes on every day? ",
        "body": "",
        "user": "u/ChronoTracker",
        "comments": [
            {
                "text": "Decluttering your space - it’s amazing how much lighter you feel when you’re not tripping over random stuff all the time",
                "user": "u/Head-Doctor7852"
            },
            {
                "text": "Stretching - your future self will thank you for not walking around like a human pretzel",
                "user": "u/IceRevolutionary2641"
            },
            {
                "text": "A hobby.  I got back into creative writing in late July and some days, I only write about 200 words (like two paragraphs).  But I'm up to 20,000 words now and it is so fulfilling to be engaging in a creative process I enjoy now.",
                "user": "u/bluecaliope"
            },
            {
                "text": "Cleaning your living space, and doing something meditative to reconnect with yourself. \n\nListen to music, read a book, go for a walk, listen to a podcast or an inspirational speech, create art, play an instrument, etc. \n\nWe can't control all the chaos in the world, but a tidy space and an insightful mind can help us feel like we have some control over the chaos in our immediate environment, and calm some of the storm *within* us.",
                "user": "u/Vintage-Grievance"
            },
            {
                "text": "Absolutely exercising",
                "user": "u/Leather_Team_1327"
            },
            {
                "text": "personal hygiene (dental, skin care routine, shaving)",
                "user": "u/Williaf"
            },
            {
                "text": "Mobility exercises",
                "user": "u/SarahEH"
            },
            {
                "text": "Doing something that makes you happy.",
                "user": "u/That_FTM_Femboy"
            },
            {
                "text": "Def not Reddit",
                "user": "u/chemicalchameleon786"
            },
            {
                "text": "Skincare.\n\nMoisturizer and SPF at the very least. Believe me, I’m a man who’s been using moisturizer and sunscreen his whole life and, while my friends don’t look quite old enough to be my dads yet, they could definitely pass as my young uncles.",
                "user": "u/RealBowsHaveRecurves"
            }
        ],
        "processed": true
    },
    "1fbz1mk": {
        "post": "Whats a thing that is dangerously close to collapse that you know about?",
        "body": "",
        "user": "u/_Fossy_",
        "comments": [
            {
                "text": "The Colorado river as the main water supply for 3 states with major cities.",
                "user": "u/ImprovementFar5054"
            },
            {
                "text": "The Rio Grande levees in El Paso's Upper Valley are old and need repair, and will fail in a major flood. The low lying suburbs in the Upper Valley were recently deemed to be in a FEMA flood plain.",
                "user": "u/oddlotz"
            },
            {
                "text": "Factual information on the Internet. There's a churn of AI created content that's being taken as fact, and used as the basis for new articles and content. Sifting through information to validate it is already too much effort for many and will only become more difficult.",
                "user": "u/allbrightwes"
            },
            {
                "text": "Publicly traded companies constantly being like \"we did good not great. More money next quarter. Oh that's good not great. Even more money next quarter\" in the 4 years ive been with my company, my production quota has tripled and it's unsustainable. Every quarter has to make more money than the last otherwise it's failing. This is almost every single publicly traded company. Corners being cut, profits maximised, employees compromised. It's endlessly happening",
                "user": "u/16RabidCats"
            },
            {
                "text": "Antibiotic effectiveness.",
                "user": "u/Crafty_Bad_6232"
            },
            {
                "text": "Literally all infrastructure in North America. The majority of underground infrastructure (pipes, water lines, sewer systems) has been completely ignored in terms of maintenance, and has been TOTALLY ignored in terms of budgeting replacing the assets.\n\nThere are towns that have coming bills of 10s-100s of millions (not even mentioning larger cities) that have saved approximately 0% of the required amount by constantly pushing out the life time estimation of the assets.\n\nlots and lots of bills are coming due shortly if the engineering estimates are accurate and very few towns have saved anything for this scenario.\n\nWe're basically living in a world where no one wants to be the person to say that we need to save money for long term planning, and instead everyone hopes things don't fail while they are leading and they can pass the buck.",
                "user": "u/spinmove"
            },
            {
                "text": "The Ogallala Aquifer.  You know how Kansas and Nebraska are known for essentially being endless fields of wheat and corn?  Well they do that by drilling wells to one of the world's largest aquifers deep under the Midwest. There isn't enough consistent rain fall in those areas for all those crops, so well water makes up the difference. But, we're draining it and it can't be replenished. Once it's drained, it's Dust Bowl 2.0 and no more large scale farming in the Midwest.",
                "user": "u/Judge_Bredd3"
            },
            {
                "text": "The Garisenda -- one of two remaining 12th century towers in Bologna, Italy.\n\n\nI saw them in April. It looks pretty ridiculous to be honest. They have the area blocked off by some shipping containers because that towers probably going to fall any day. It looks like there are some half-hearted restoration attempts happening but no idea what their plan is...",
                "user": "u/doodle_rooster"
            },
            {
                "text": "Lots of things according to r/collapse \n\nPersonally I live in a city called Lowell MA and there's the Rourke Bridge built 40 years ago that was meant to be temporary. Honestly it reminds me of those horrible scary bridges you've seen over rivers in Siberia or some other place in central Asia. It's loud and bumpy and you can feel the whole thing sway because it gets 25,000 cars crossing it EVERY DAY.\n\nNot only that... you can actually walk under it since there's a river walk pathway it connects to, and you can see  rusted sections just rotting away. About 6 months ago a truck crossed it and a panel on the surface somehow see-sawed up into the gas tank. The truck made it across but not before losing probably 80 to 100 gallons of diesel onto the bridge and into the river below. The river had a marshy / swampy area near the bridge and you could see the fuel slick eddying and collecting into that area. I can't imagine much survived underneath. I'm sure a lot of fish eggs and small aquatic animals died down there.\n\nThe city, state and feds have known this bridge needs replacing for decades and they know about the rust and rot, but they continue to say that it will last for now. Don't they always say that though? \n\nThere is a plan to make a new one next to it... but it won't be done until 2028... which we all know means it'll probably drag on into 2029, 2030, etc.\n\nI honestly don't think it will last that long.",
                "user": "u/Engelgrafik"
            }
        ],
        "processed": true
    },
    "1f9763p": {
        "post": "What is likely to die along with the baby boomers generation?",
        "body": "",
        "user": "u/DioriteLover",
        "comments": [
            {
                "text": "95% of politicians",
                "user": "u/Entire-Inflation-627"
            },
            {
                "text": "Formal living rooms",
                "user": "u/vbpatel"
            },
            {
                "text": "Not listing the salary on a job posting",
                "user": "u/NoeyCannoli"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Fancy unused china sets",
                "user": "u/thundering-horse"
            },
            {
                "text": "TEXT MESSAGES AND FACEBOOK POSTS IN ALL CAPS. -LOVE, GRANDMA",
                "user": "u/Worchestershshhhrrer"
            },
            {
                "text": "Porcelain figurine collections",
                "user": "u/nonesuchnotion"
            },
            {
                "text": "Timeshares",
                "user": "u/CityOutlier"
            },
            {
                "text": "The cellphone holder that clips on to the belt.",
                "user": "u/Junior-ME14"
            },
            {
                "text": "Cable news",
                "user": "u/ocarina97"
            }
        ],
        "processed": true
    },
    "1fc3vbg": {
        "post": "what is something that feels like a \"cheat code\" in life, but most people don't realise it?",
        "body": "",
        "user": "u/Lowertier4848",
        "comments": [
            {
                "text": "Listening to understand, not to reply. This is all the vast majority of people need for you to be on their good side.",
                "user": "u/SpecialSauceSal"
            },
            {
                "text": "honestly learning how to say no without feeling guilty is like a life cheat code it saves you so much time energy and stress",
                "user": "u/Valentinaiuiu"
            },
            {
                "text": "asking for help.",
                "user": "u/justtrustmeokay"
            },
            {
                "text": "Keeping your mouth shut and just observing.",
                "user": "u/p0tty_mouth"
            },
            {
                "text": "Getting enough sleep. It’s like a secret hack for everything—productivity, mood, health.",
                "user": "u/lusciousxogirl"
            },
            {
                "text": "Saying \"I appreciate your help\" instead of \"sorry to bother you\"—people are way more willing to assist when they feel valued, not burdened",
                "user": "u/Hayleigh3120"
            },
            {
                "text": "I often feel lightheaded if I stand up too quickly since I have rather low blood pressure. If it occurs, instantly force the blood back upward by clenching your abdominal muscles.",
                "user": "u/ammatume"
            },
            {
                "text": "Learning how to make use of all the free stuff provided by the local library - audiobooks, movie rentals, museum tickets, access to major newspaper publications, free wifi hotspot rentals, tax assistance, etc, etc, etc",
                "user": "u/mysteriouswayz"
            },
            {
                "text": "A good reliable trustworthy partner.  ",
                "user": "u/Leee33337"
            },
            {
                "text": "Not being afraid to speak up, really. It is difficult only in some cases, but if you learn it, it will help you a lot in life.",
                "user": "u/cookieangel____"
            }
        ],
        "processed": true
    },
    "1f9b97m": {
        "post": "What’s the most annoying “that’s bad for you!” myth that drives you crazy because people still believe it?",
        "body": "",
        "user": "u/Beepbeepboopb0p",
        "comments": [
            {
                "text": "my asian parents have a grudge against cold foods and drinks",
                "user": "u/Environmental_End548"
            },
            {
                "text": "If you swallow gum it will stay in your stomach for 7 years",
                "user": "u/ComfortableService8"
            },
            {
                "text": "When I was pregnant, I was grocery shopping, and I reached up to get something . Some lady said, \"If you reach up, the umbilical cord will wrap around the baby's neck.\" What?",
                "user": "u/Smart-Top3593"
            },
            {
                "text": "“Because it’s natural that it is safe/ healthy”\n\nLady, please dont accidentally eat the wrong type of wild mushrooms.\n\nDrinking an ancient herbal supplement can actually harm the liver/ kidneys etc",
                "user": "u/fritosfeet"
            },
            {
                "text": "That frozen vegetables aren’t good for you. Just because they’re easy and cheap doesn’t make them unhealthy",
                "user": "u/FoghornLegday"
            },
            {
                "text": "Pulling a gray hair will cause 2 more to sprout up.",
                "user": "u/randomfactaholic"
            },
            {
                "text": "Cracking your knuckles",
                "user": "u/nlm101"
            },
            {
                "text": "I saw someone on r/cats whose landlord wanted her to get rid of her cat because it's black. I can't believe people still think like this to this extent. Unreal.",
                "user": "u/strawberrdies"
            },
            {
                "text": "My MIL believes that eating or drinking cold things is bad for you and will make you sick.",
                "user": "u/trickybritt"
            }
        ],
        "processed": true
    },
    "1fabbom": {
        "post": "Who isn't as smart as people think?",
        "body": "",
        "user": "u/Ceo_Potato",
        "comments": [
            {
                "text": "sometimes people put a lot of trust in celebrities or influencers for their opinions on things outside their expertise and they’re not always as knowledgeable as they seem",
                "user": "u/Ginebabe"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Dr.Phil, Dr.Drew, Dr.Oz.    Call yourselves doctors but one isn’t one and the others are shills with outdated medical advice.",
                "user": "u/happylittlepixie"
            },
            {
                "text": "I'm beginning to think Homer Simpsons was not the brilliant tactician I thought he was",
                "user": "u/Caramel_Forest"
            },
            {
                "text": "Finally my username is relevant",
                "user": "u/notassmartasithinkia"
            },
            {
                "text": "Most anyone interviewed on television.\n\n\nI've worked in the same industry for 30+ years.  I (like to think ) I have a decent amount of knowledge on \"my\" subject, but it is a niche subject.   \n\n\nA few times a year,  there will be a news event , or a crime show (think Dateline or 20/20) that uses part of my knowledge base.  The people being interviewed will completely bastardlize the science, and many times be completely wrong.\n\n\nIt makes me wonder how many other stories/subjects I see on the news, areas I only have cursory knowledge about, where I'm completely receiving the wrong information, but don't know enough to recognize it. ",
                "user": "u/nosoup4ncsu"
            },
            {
                "text": "Pretty much everyone. Myself absolutely included.",
                "user": "u/nohairday"
            },
            {
                "text": "Terrance Howard",
                "user": "u/Ben_Thar"
            },
            {
                "text": "The \"I had my IQ tested to 140 as a kid, but I kinda just burnt out and got lazy as an adult\" type of guy that makes up like 75% of Reddit.\n\nEdit: feels like the 75% found my comment and are all replying.",
                "user": "u/D-Rez"
            },
            {
                "text": "Themselves.",
                "user": "u/Ratakoa"
            }
        ],
        "processed": true
    },
    "1fbdldb": {
        "post": "If every job paid the same, what would you do for a living?",
        "body": "",
        "user": "u/6ft2Baller",
        "comments": [
            {
                "text": "Something conservation based, out in the wilderness",
                "user": "u/Crystal_Skulls"
            },
            {
                "text": "I’d work a bunch of jobs to see what I’d like lol",
                "user": "u/MegaPenguin063"
            },
            {
                "text": "I worked a job as a janitor in an office building and my shift was after hours so I never saw anybody and the kicker was that I didn't have to clean the restrooms.  I blasted music and casually cleaned offices all night.  It was pretty chill.",
                "user": "u/dirtyburgler"
            },
            {
                "text": "Work at a bookstore, library, or warehouse just stocking books.",
                "user": "u/Sufficient-Berry-827"
            },
            {
                "text": "My current job because I like it but I don’t get paid as much so I would just get paid more to do what I like.\n\nEDIT - Because so many people have asked me the same question, i’ll just answer it here - Yes the question says nothing about me getting paid more but even if everyone else’s jobs get paid the same amount, I’m fine with that because it still has the same effect.",
                "user": "u/Smart_But123581321"
            },
            {
                "text": "Food critic",
                "user": "u/StarMasterAdmiral"
            },
            {
                "text": "Meals on wheels for the elderly give them a bit of company and some food, let them keep their independence hear their stories and just enjoy being alive",
                "user": "u/croghan2020"
            },
            {
                "text": "Testing cars and reviewing them.",
                "user": "u/UncleBenThe1st"
            },
            {
                "text": "Photography",
                "user": "u/EHA17"
            },
            {
                "text": "Cemetery keeper",
                "user": "u/freddyfazmuzzle"
            },
            {
                "text": "I would play the piano in a piano bar",
                "user": "u/Applepie_4"
            }
        ],
        "processed": true
    },
    "1faqzg5": {
        "post": "What immediately tells you that a person wasn’t raised right?",
        "body": "",
        "user": "u/habsforIife",
        "comments": [
            {
                "text": "Entitlement- everything on the planet belongs to them and everyone on it is their servant",
                "user": "u/Alternative-Speed-89"
            },
            {
                "text": "Always taking but never giving",
                "user": "u/Princesss_Lily"
            },
            {
                "text": "A complete lack of respect for stuff that doesn't belong to them.  An example:\n\nMiddle school, they finally built an addition onto the building so they could get rid of the temporary trailer classrooms out back.  Brand-new everything, from the concrete all the way up to the roof.\n\nFirst day of class I was in the bathroom using it for its intended purpose, and I watched another student walk in, walk into the stall, and turn in a circle while peeing the whole time.  All over everything.  When he was done he zipped up, walked out, said something like \"Hmh,\" and that was that.",
                "user": "u/virtualadept"
            },
            {
                "text": "Cutting queues",
                "user": "u/louloutre75"
            },
            {
                "text": "People who litter",
                "user": "u/Sunstang"
            },
            {
                "text": "When someone looks down at others based on what they do. That just clearly shows that they've learned the same thing from their caregivers.",
                "user": "u/LovelyLavenderrr_"
            },
            {
                "text": "Not being able to maintain other people's privacy. \n\n\nMet someone who, within hours of meeting and without any specific prompt, was telling me about the medical issues/conditions one of our mutual friends has which was clearly told in confidence, and now I know about it against my will. I feel like *I* need to apologize to the mutual friend about hearing it.",
                "user": "u/DasGaufre"
            },
            {
                "text": "People leaving their Starbucks cups in random shelves and stuff in target or wherever.\n\nEdit: I'm not talking about the accidental leaving of trash, that's fine I get it lol! It's the ones who purposefully hide their trash behind stuff or in weird places that I have beef with.",
                "user": "u/pigeon_idk"
            },
            {
                "text": "ppl who simply cannot even begin to fathom that they might be the problem\n\n(lack of self awareness, playing victim 24/7, having an excuse for everything, no integrity)",
                "user": "u/Scared-Still-3436"
            },
            {
                "text": "Lack of manners or being impolite in general.",
                "user": "u/SgtPepperoni9"
            }
        ],
        "processed": true
    },
    "1fahqrz": {
        "post": "What type of job seems appealing but ends up being quite disappointing?",
        "body": "",
        "user": "u/Head_Somewhere3770",
        "comments": [
            {
                "text": "Veterinarian. \n\nExpectation: Ooo, lots of animals!\n\nReality: Death. SO MUCH DEATH.",
                "user": "u/rekniht01"
            },
            {
                "text": "I often see graphic design touted as an escape route for people who find themselves wanting to change career, I honestly think it’s pretty irresponsible of the people who run these courses promising that, as it’s a really difficult industry to get into, and even if you can get into it, it’s then really hard to get the fun creative work you were picturing when you signed up. I’m sure a lot of people end up disappointed.",
                "user": "u/recycled-throwaway7"
            },
            {
                "text": "A friend of mine is a marine biologist, and they spent the past week measuring thawed fish heads.",
                "user": "u/Aggressive-Nerve-961"
            },
            {
                "text": "A friend of mine is a forensic scientist, and whenever he's on dating apps, it's the only thing people want to talk about. His work is actually pretty technical and involves a lot of routine tasks.",
                "user": "u/Beneficial-Pop7235"
            },
            {
                "text": "After four years in the military, my biggest complaint was the lack of sleep and the irregular schedule.\n\n\nFirst job after that was a security guard. I couldn't believe how lucky I was...getting paid to stand there and do nothing.\n\n\nUntil that job, I had not realized how much I would hate being bored.",
                "user": "u/series_hybrid"
            },
            {
                "text": "Working at a flower shop is just like any other retail position, but everyone assumes it’s more enjoyable than it really is. Assisting families in selecting flowers for funerals is definitely not the fun part either.",
                "user": "u/Serious-Baseball-321"
            },
            {
                "text": "I’d say most jobs end up being “disappointing” in a never meet your heroes kind of way.\n\nI’d rather know which jobs seemed unappealing but turned out to be surprisingly satisfying.",
                "user": "u/Unique_Accountant420"
            },
            {
                "text": "Social services. You’re made to think you’re gonna change the world, but you’re expected to overwork for “passion” without being properly compensated.",
                "user": "u/BratS94"
            },
            {
                "text": "Barnes & Noble: your role has absolutely no connection to books, yet it clearly draws in a lot of book lovers, including me.",
                "user": "u/Equal_Mammoth4571"
            },
            {
                "text": "I work as a scientist. I'm not sure if people generally view that profession as enjoyable, but I believe they expect it to be filled with more “Eureka!” moments and a lot less “I have to manually process this data for 600 hours before I can start analyzing it.”",
                "user": "u/Ancient_Bowl_3634"
            },
            {
                "text": "Video game developer",
                "user": "u/numbersev"
            }
        ],
        "processed": true
    },
    "1fbddxe": {
        "post": "For those who spend long periods of time at sea for work, what’s the eeriest thing you’ve ever encountered out on the water?",
        "body": "",
        "user": "u/Itsyourcamila",
        "comments": [
            {
                "text": "The churning chaos of sealife you can attract just by shining a light in the water at night.",
                "user": "u/Alysma"
            },
            {
                "text": "A dead body floating in the water.\n\nThe crew got it into a stretcher, double bagged it, kept it in the freezer, and turned it over to the local authorities at the next port visit. I had a role in that.\n\nIt was in an advanced state of decomposition but there was enough remaining to get an identification by dental records. Some family got closure.",
                "user": "u/doublestitch"
            },
            {
                "text": "We were cruising in the Bahamas one night in the Devil's Triangle. All the sudden we hear this chain dragging down the hull  for like a minute. Just scraping. it was unnerving. And it was in Exhuma sound which is like thousands of feet deep. Which means it would have been floating and hanging off the bottom of something like an old mine drifting for years. We came about to try and find it but we could never find it again, It just disappeared.\n\nAnother time we were under the polar ice cap and the ice sheet moans all the time. Like what you think a mermaid siren would sound like. And sometimes you can hear it through the hull.  For about 65 days straight. Non-Stop\n\nThe North Pole is absolutely the quietest place you can ever be and in November it has this fog that's always there you can't tell how far anything is away. It gets very unnerving after a while.",
                "user": "u/monkeywelder"
            },
            {
                "text": "We responded to a sailboat that was taking on water. \n\nIt became clear that the sailboat wasn't going to make it - we brought the crew of the sailboat onto our vessel and then we sort of waited around and watched the sailboat sink. \n\nWhat struck me is how silent it was. No fuss. No drama. It wasn't like a dark and stormy night or anything - it was a picture-perfect day. Glassy ocean with not a cloud in the sky and it didn't matter. It was the kind of day that most seafarers dream about and yet these blokes had been in a fight for their lives trying to keep their boat afloat. \n\nAfter it sank, there were a few bubbles and then that was it. You'd have never known there was ever a sailboat there. Just a beautiful day without a trace of struggle. \n\n*Sailboat? What sailboat? Around here? I didn't see a sailboat.*",
                "user": "u/WatchTheBoom"
            },
            {
                "text": "Weirdest thing ive seen by far is coming out of a fog bank and seeing thousands of giant red  humbolt squid with their tentacles waving in the air.\nIt was sureal  and something i will never forget  like a bunch of little aliens.",
                "user": "u/woolybuggered"
            },
            {
                "text": "I was on a night dive. It was a dive site I was familiar with and as is common practice, the captain had fixed a steady strobe light to the anchor line of the boat so we could find our way back. \n\nAs I was readying to complete my dive and ascend, I wondered why the strobe was no longer blinking and now just a steady beam. Looking at my compass I was doubly confused by how I had gotten my navigation so wrong. I felt foolish — had I been cocky and overexcited because I was comfortable with this site? How could I have miscalculated my direction so? It’s a dangerous mistake at any time for a diver, much more so at night. \n\nBut as I was ascending, the brightness of the light really irked me. Why would the captain change the strobe on us? Was something wrong?\n\nThen it hit me. \n\nI wasn’t swimming toward the boat at all. I was swimming toward the moon. The water was so clear and calm, I had mistaken it for a light. \n\nLuckily I hadn’t ascended fully and wasn’t too far off. I was able to redirect to my original navigation, eventually finding the strobe, the boat, and a renewed respect for the ocean’s ability to make you second guess yourself.",
                "user": "u/NJshore_77"
            },
            {
                "text": "seeing bioluminescent waves at night that make the water glow like something out of a sci-fi movie it’s both beautiful and unsettling",
                "user": "u/Maryanaxoxo"
            },
            {
                "text": "Another ship that was miles away looked like you could reach out and touch it. It’s an optical phenomenon I’ve seen many times, to varying degrees. School of thousands of hammerhead sharks all swimming in the same direction. Whale swimming along that was half eaten. Being in storms where seas were tall and thinking back on wooden ships in the past traversing through such storms always weirded me out a bit.",
                "user": "u/GeromeDB"
            }
        ],
        "processed": true
    },
    "1f8x7v5": {
        "post": "What is the worst thing that has ever happened to you in a relationship? ",
        "body": "",
        "user": "u/Forsaken-Banana6936",
        "comments": [
            {
                "text": "Found out the day that we closed on our house that he was cheating.",
                "user": "u/STLCityAmy"
            },
            {
                "text": "He ended things out of blue. He had previously said he wanted to marry me. We’d started planning a life together. I had never been happier in my life with someone. Never felt so sure about something. It devastated me - I had felt in my bones he was IT. I haven’t felt that way about anyone since…it’s been ten years. \n\nIt took a while to process. If I’m honest, years. I don’t miss him or love him anymore - I just wish I could have what he took from me.",
                "user": "u/marieboston"
            },
            {
                "text": "He died.\n\nWaking up in the middle of the night and seeing he was very unwell. Calling for an ambulance while fruitlessly trying to wake him. Seeing paramedics start CPR and knowing that life won't be the same. Having to ring his family and explain what had happened. Making the decision to remove life support.\n\nIt was all unimaginably awful.",
                "user": "u/Viking_Face"
            },
            {
                "text": "I discovered she was cheating on me with my older brother. It felt like I was getting stabbed in the back by two loved ones.",
                "user": "u/Infinite_Change5141"
            },
            {
                "text": "My wife cheated on me and left me for my friend. \nWe have the same name. \nIt greatly confused our one year old.",
                "user": "u/flearhcp97"
            },
            {
                "text": "My ex put her new relationship status on Facebook, and that's how I found out I was single.",
                "user": "u/SLJ7"
            },
            {
                "text": "I once crashed my girlfriend's dad's car, we broke up because of that, her dad couldn't see me. I finished paying him in 1 year :(",
                "user": "u/Goddesofcake72"
            }
        ],
        "processed": true
    },
    "1f9m777": {
        "post": "What's a weird thing you find attractive in people?",
        "body": "",
        "user": "u/PhenomenalPancake",
        "comments": [
            {
                "text": "When someone is talking about a subject and they're at first a little hesitatnt to sound too enthusiastic but you can tell they're really wanting to discuss it and then you mention find it interesting and suddenly they're telling you about bones in a parking lot or the lucky find of some rusty coins with all the excitement of a kid at Christmas. Or when someone brings you a rock and is near screaming because it's stripey and they launch into an explanation of rocks and what makes this rock different than that other rock because first the color and then the color.",
                "user": "u/frank-sarno"
            },
            {
                "text": "honestly i find weird laughs super attractive like the more unique and dorky the laugh the better i dunno why",
                "user": "u/marlenawxoxo"
            },
            {
                "text": "Smiles. My husband has this adorable little tooth that shows when he is really happy and it just melts my heart every time. I know he means that smile.",
                "user": "u/Petrichor_Panacea"
            },
            {
                "text": "I like a man who looks like he’d make a really good mall Santa",
                "user": "u/BJs4Bildad"
            },
            {
                "text": "Small imperfections, like on the teeth, beauty  marks etc.",
                "user": "u/Sensual_Pinetree"
            },
            {
                "text": "when there's a raspiness in their voice",
                "user": "u/gurlfantacz"
            },
            {
                "text": "Nerds , a good laugh that sounds hahaha",
                "user": "u/aristosachean"
            },
            {
                "text": "The back of the neck, its not like instant turn on material. But I find it kinda hot",
                "user": "u/MrGundel"
            },
            {
                "text": "That little crease some people get between their eyebrows when they’re focused or confused—it’s weirdly cute.",
                "user": "u/friendsWbenefitss"
            },
            {
                "text": "A visible, pulsing carotid artery. No idea why, it just feels really intimate, like \"I can see your heartbeat\"\n\nI probably shouldn't be allowed out in public...",
                "user": "u/Circumzenithal"
            }
        ],
        "processed": true
    },
    "1f7ncdb": {
        "post": "Would you cut 10 years off your life in exchange for $20 million? Why or why not?",
        "body": "",
        "user": "u/GigiBrit",
        "comments": [
            {
                "text": "Most people are trading time for money anyway in the form of 40-60 hours a week. So yeah, if you want to retire now on that for sure. Good deal. All the time not working lets you live and travel.",
                "user": "u/Strange_farm77"
            },
            {
                "text": "Absolutely. Ten year shorter life but I could spend all the remaining years doing whatever I wanted instead of wasting them on work. I'd gain far more time than I'd lose.",
                "user": "u/timawesomeness"
            },
            {
                "text": "Admittedly its the worst 10 years",
                "user": "u/Ok-Bit6037"
            },
            {
                "text": "If you want to cut more, I'd be up for that, too!",
                "user": "u/theedgeofoblivious"
            },
            {
                "text": "yes, I'm poor and don't want to be old",
                "user": "u/52mschr"
            },
            {
                "text": "I'd be willing to die next Monday if I get 20 mil",
                "user": "u/Whatupitsv"
            },
            {
                "text": "Not sure how it would work out, I am poor and have health issues.  If I was 20 million richer it might extend my life such that I'd still end up with a gain in years.",
                "user": "u/ZebraZealot"
            },
            {
                "text": "No guarantee you'll make it to a specific age, accidents happen.\n\nTake the deal. At worst, you kick it before you are infirmed by old age.\n\n20 million means that you can live everyday to the fullest. Which is significantly better than living 10 years in a constant struggle.",
                "user": "u/None"
            },
            {
                "text": "Yes, I'm here for a good time, not a long time",
                "user": "u/Porschedog"
            },
            {
                "text": "Do I get to know when I die?",
                "user": "u/ReVo5000"
            }
        ],
        "processed": true
    }
}