{
    "1et6rgd": {
        "post": "What's something that no matter how it's explained to you, you just can't understand how it works?",
        "body": "",
        "user": "u/n0dust0llens",
        "comments": [
            {
                "text": "Space, it's so big that it is unfathomable and I think it's expanding?! Into what? How did it start? It's all a mindfuck ",
                "user": "u/VVinstonVVolfe"
            },
            {
                "text": "Electricity.",
                "user": "u/pvtguerra"
            },
            {
                "text": "How airplanes can be so big and heavy and fly",
                "user": "u/TangyCornIceCream"
            },
            {
                "text": "How my cat always knows exactly when I’m about to sit down with a snack",
                "user": "u/Gracelovey12"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Magnets. Don't understand how they have that physical force locked up in them. Seems to break the laws of physics or something. I don't trust them",
                "user": "u/minnesota2194"
            },
            {
                "text": "Quantum mechanics. No matter how many times it's explained, the idea that particles can exist in multiple states at once or influence each other instantaneously across vast distances just feels like nature's most elaborate inside joke that I'm not quite in on.",
                "user": "u/jane66x"
            },
            {
                "text": "**The stock market**.\n\nHow can it be possible for the value of an item to change so drastically? I understand supply and demand, but the large flunctuations are amazing.",
                "user": "u/britishmetric144"
            }
        ],
        "processed": true
    },
    "1ew56dj": {
        "post": "What difficult truths, the sooner you accept them, the better your life will be?",
        "body": "",
        "user": "u/Rare_Can_5418",
        "comments": [
            {
                "text": "That some people won't like you. And sometimes for no reason.",
                "user": "u/PurahsHero"
            },
            {
                "text": "There will always be someone better looking, better educated, younger, more experienced, more intelligent or wealthier than you. Do your best, live without regret, have empathy and kindness, give when you can, expecting nothing in return.Focus on your heart value more than what others have.",
                "user": "u/Realistic_River_868"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "You can do your best with someone and still be the villain in their story.",
                "user": "u/gathee"
            },
            {
                "text": "There are many things that are out of your control.",
                "user": "u/ChicodePolonia"
            },
            {
                "text": "This is more of a saying, but I feel it helps shed light on a few things: \"we judge ourselves by our intentions. We judge others by their actions.\"\n\n\nIOW people are going to look at you for what you do and your intentions are mostly irrelevant.",
                "user": "u/Knight_Owls"
            },
            {
                "text": "you can only help people who actually want it. If they’re not ready to change or put in the effort, there’s not much you can do. Realizing this can save you a lot of frustration and help you focus on people who actually appreciate your help",
                "user": "u/GoldenGlimmer2"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Just because you're right, doesn't mean people will agree with you and might work against you either way.\n\nMy wife struggles with this.  She has an idea that works and gets the company more money, but the owner and other workers are against it because they disagree with it.  Even with the evidence that it works better for them financially.  \n\nAll the data in the world won't change the mind of a person who won't listen.",
                "user": "u/outerproduct"
            },
            {
                "text": "Things are just things. They don’t have feelings. They don’t care if you give them away or sell them or throw them out. If a thing is useful, keep it. If not, get rid of it.",
                "user": "u/bowlbettertalk"
            },
            {
                "text": "You can’t change the past, but you can decide what to do next.",
                "user": "u/SexyAngelbabe012"
            }
        ],
        "processed": true
    },
    "1eryhlk": {
        "post": "What’s a social habit everyone seems to accept but you find really annoying?",
        "body": "",
        "user": "u/spacewalkerstarfield",
        "comments": [
            {
                "text": "When people don't understand that listening is the most important part of the conversation.",
                "user": "u/mrp0013"
            },
            {
                "text": "Not everything has to be filmed.",
                "user": "u/CraftyAttitude1321"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "People congregating in doorways, particularly when there is plenty of non-doorway space available",
                "user": "u/Oil8524"
            },
            {
                "text": "people who stop in the middle of a busy walkway to check their phones. it's like they think they've hit pause on the world.",
                "user": "u/NotBeginningAnew"
            },
            {
                "text": "Kids blasting whatever TV show on their iPads in the middle of a restaurant while I’m trying to eat. The kids can watch whatever but somebody teach them to use headphones.",
                "user": "u/SecretProgramor"
            },
            {
                "text": "Filming strangers. It's one thing if you're just taking a holiday snap or something and there's people in the background but actually pointing your camera at strangers without consent solely for the purpose of making videos of them to post online is not cool. I get it's legal to do so in most public places.",
                "user": "u/beesandsids"
            },
            {
                "text": "Being expected to be constantly available via social media chat, text, call at any & all hours. If you try to ‘opt out’ it’s seen as weird or antisocial.",
                "user": "u/p0ndfaerie"
            },
            {
                "text": "Being on your phone while having an in person conversation with someone. Like hello, I’m right here not in your screen!",
                "user": "u/Hot_Potential_5732"
            }
        ],
        "processed": true
    },
    "1euru0m": {
        "post": "What dead celebrity would absolutely hate their current fan base? ",
        "body": "",
        "user": "u/DrunkenSkunkApe",
        "comments": [
            {
                "text": "Confucius. \n\nHe'd walk around all day saying, \"I DIDN'T SAY THAT\"",
                "user": "u/NorwalkAvenger"
            },
            {
                "text": "Alexander Hamilton would be very, very confused.",
                "user": "u/DomingoLee"
            },
            {
                "text": "Sir Arthur Conan Doyle.\n\n“WHAT DO YOU MEAN SHERLOCK HOLMES IS STILL POPULAR!?!”",
                "user": "u/StanDaMan1"
            },
            {
                "text": "Nietzsche. In fact, I would guess a lot of philosophers would feel frustrated with how badly they have been reinterpreted.",
                "user": "u/allmybadthoughts"
            },
            {
                "text": "Probably Frida Kahlo. I don’t think she’d be a huge fan of her likeness on everything from socks to the side of an apartment building I saw the other day.",
                "user": "u/andreaxtina"
            },
            {
                "text": "Nikola Tesla",
                "user": "u/artesre"
            },
            {
                "text": "Bob Marley",
                "user": "u/Adorable-Writing3617"
            },
            {
                "text": "George Carlin. He gets quoted by people who he’d despise.",
                "user": "u/Waste-knot"
            },
            {
                "text": "Marilyn Monroe would despise the Tumblr girls who use that fake quote \"if you can't handle me at my worst\" that she never actually said",
                "user": "u/dauntless91"
            },
            {
                "text": "Hunter Thompson would take a 5 minute glance around and shoot himself again.",
                "user": "u/Aggressive_Day2839"
            },
            {
                "text": "George Carlin would absolutely abhor seeing some of these people quoting him",
                "user": "u/nickl104"
            }
        ],
        "processed": true
    },
    "1eukjes": {
        "post": "Men of reddit, what is a 100% myth about men? ",
        "body": "",
        "user": "u/booksmylove",
        "comments": [
            {
                "text": "Thinking someone is attractive is not the same as wanting to sleep/pursue a relationship with someone.",
                "user": "u/antlerpanda"
            },
            {
                "text": "You can change something about me that I don’t want to. ",
                "user": "u/maddieterrier"
            },
            {
                "text": "We’re all car fanatics. I don’t know a thing about cars",
                "user": "u/pizzagamer35"
            },
            {
                "text": "We're fine..",
                "user": "u/Trick-Possesion684"
            },
            {
                "text": "I'm not \"babysitting\" when I'm with my daughter; I'm being a father.",
                "user": "u/Caradepacman123"
            },
            {
                "text": "That men don't want or need compliments. That men don't cry. That men have to \"man up and deal\" with hard things. That men prefer to pursue over being pursued.\n\nMen crave all the same emotional/mental stimulation that is generally associated with women, society just tells us we shouldn't want or need them.",
                "user": "u/WoWLaw"
            },
            {
                "text": "Erections are not consent.",
                "user": "u/bobbery5"
            }
        ],
        "processed": true
    },
    "1etu6ic": {
        "post": "What's hard about dating you?",
        "body": "",
        "user": "u/Routine-Award-3382",
        "comments": [
            {
                "text": "i'm terrible at opening up and communicating about my needs.",
                "user": "u/Realistic-Cow-3140"
            },
            {
                "text": "I create delusional scenarios in my mind",
                "user": "u/Puzzlehead_k"
            },
            {
                "text": "When I have a bad day I don't want to talk to anyone. I don't want to be helped either. I just want to exist in silence for a while",
                "user": "u/SenhorSus"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Dealing with my low self esteem",
                "user": "u/UselessAndUnlovable"
            },
            {
                "text": "Sometimes I need extended periods alone.",
                "user": "u/Missgrumpy00"
            },
            {
                "text": "I don’t love myself yet.",
                "user": "u/No-Mind5337"
            },
            {
                "text": "I don't talk when I'm angry. I always need some time before I can open up what's my problem.",
                "user": "u/Unlikely-Ad-2855"
            },
            {
                "text": "My anxiety",
                "user": "u/Haunting-Employ3307"
            },
            {
                "text": "I am told I can't accept someone's own different way of love. That I only know and understand one way, and not appreciate or acknowledge other ways",
                "user": "u/cold_conclusion8147"
            },
            {
                "text": "I enjoy my time alone very much.",
                "user": "u/Charlie_NLG"
            }
        ],
        "processed": true
    },
    "1ert1mo": {
        "post": "What’s the worst thing an american president has ever done?",
        "body": "",
        "user": "u/TheAXCLord",
        "comments": [
            {
                "text": "On a personal level?\n\nGrover Cleveland groomed his wife from infancy.  He met her when she was a literal baby, bought her baby gifts through her childhood, and when her father died (she was 11) Cleveland became her formal guardian.\n\nThe girl's mother actually thought that Cleveland was courting her as an eligible widow, but that notion was quickly dissuaded when Cleveland's attentions were almost entirely directed at her daughter.  \n\nThey were married 10 years later, when he was 49 and she was 21.",
                "user": "u/Milocobo"
            },
            {
                "text": "Andrew Johnson’s undermining post-Civil War Reconstruction has caused cumulative and enduring damage to the United States. Measured in terms of the immensity and duration of harm he is the worst not just by miles, but by galaxies.",
                "user": "u/Chispacita"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Probably that native American ethnic cleansing Andrew Jackson did.",
                "user": "u/Sleepy_Senju"
            },
            {
                "text": "Andrew Jackson- Trail of Tears. Case closed.",
                "user": "u/chakrablockerssuck"
            },
            {
                "text": "Using chemicals like Agent Orange in Vietnam was really horrendous",
                "user": "u/Shifisu"
            },
            {
                "text": "IIRC Andrew Jackson killed a lot of Indians. Like, a lot.",
                "user": "u/LeavesOfBrass"
            },
            {
                "text": "Andrew Jackson's trail of tears",
                "user": "u/Bardlie"
            }
        ],
        "processed": true
    },
    "1etfes3": {
        "post": "[Serious] What was said, that forever changed your relationship with someone?",
        "body": "",
        "user": "u/YoungJack23",
        "comments": [
            {
                "text": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies.\n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
                "user": "u/AutoModerator"
            },
            {
                "text": "About a year into our marriage and after I had moved across the world for them and left everything I’d ever known: “the more I get to know you, the less I like you.”\n\nI am ashamed to say it took 3 more years before we were done.\n\nEDIT:\nI did NOT expect this comment to blow up! Was pretty buzzed when I originally posted it, too, so here’s some edits/updates.\n\n- It took 4 more years, not 3.\n\n- He made the decision to call it quits… which makes me feel even more ashamed, in a way. However, after the first days of just complete shock, I felt incredibly free. His decision forced me to give up on the idea that somewhere deep inside of him he still had a resemblance of the man I fell in love with.\n\n- I did of course let him know that his comment really hurt my feelings. He just doubled down on why he felt that way and why he had a right to tell me.\n\n- Only afterwards did I realize the kind of abuse this man put me through. It is almost impossible to recognize it while you’re in the midst of it, especially when it escalates so gradually.\n\n- To everyone replying with your kind comments: thank you so much! It has been just over a year and I am indeed thriving now :) And he definitely is not.\n\n- To everyone who is in a similar situation: it may seem overwhelming and impossible to get out. It may feel like it’ll be the hardest thing you’ll ever do. Just know that it will NEVER be harder than staying.",
                "user": "u/fitnessnfrenchfries"
            },
            {
                "text": "In my late 20s I was thinking about going to college, but I was afraid I was too old. Someone said to me, \"Next year you will be older.\" I applied the next day.",
                "user": "u/Cosimia1964"
            },
            {
                "text": "My mother told me that she believed that I hate her while I was at her house giving her money because she needed help to get through the week. I can still feel the hole that statement left in my heart.",
                "user": "u/P0ncle"
            },
            {
                "text": "My father said \"yes I know and I don't support you.\" (I will never forget those words) when I told him that I filed a police report on the man who molested me as a child. \n\nHe didn't even look like the same man to me the next time I saw him.",
                "user": "u/billymackactually"
            },
            {
                "text": "For 3 years, someone and I worked together side by side and developed a close friendship. One day I got promoted to manager and became his boss. He threw a tantrum and screamed for hours, then refused to talk to me (Now his boss) for three days.\n\nWhen I finally scheduled a one on one meeting, he told me \"My sole job now is to make it clear they made the wrong decision. It's in my best interest to make sure that you fail.\"\n\nI tried for about a month to make it work, but eventually he had to be let go.\n\nThat was the end of that friendship.",
                "user": "u/muscledhunter"
            },
            {
                "text": "My mom was dying. A friend told me \"you have your whole life to freak out about this-- *don't do it in front of her.* \"\n\nIt really helped me to understand that my feelings are not always what's important. It IS possible to delay a freakout, and that skill has served me innumerable times.",
                "user": "u/SweetheartAndSin"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "I was in the car with my dad, I was about 40, and he said “Out of all my children, you are the most intelligent, but also the greatest disappointment “. Just out of the blue, like he was talking about the weather.",
                "user": "u/CartographerKey7322"
            }
        ],
        "processed": true
    },
    "1euo85k": {
        "post": "Brits of Reddit, now that it’s been a few years, has Brexit been a success?  Why or why not? ",
        "body": "",
        "user": "u/accountname789",
        "comments": [
            {
                "text": "Brexit destroyed my online business. I got a lot of orders from Europe. Brexit went through.  Now they have to pay import fees that they never had to pay before and then eventually VAT that they never had to pay before.   \nThey didn't want to pay all of that extra stuff so they stopped ordering. My sales went down, down, down until I had to close my shops.",
                "user": "u/jaime4brienne"
            },
            {
                "text": "Brexit has:\n\n- Increased queues for Brits at airports in Europe as we must now be subject to additional checks and have our passports stamped. It has also limited stays to 90 days in 180. \n\n- Reduced opportunities for people from England, Scotland and Wales to live, work, study and retire freely across our own continent. Northern Irish citizens retain these benefits since they can apply for an Irish Passport. \n\n- Contributed to labour shortages in key industries such as hospitality, farming, health and social care DESPITE record levels of immigration from the rest of world. \n\n- Added administrative bureaucracy for importers and exporters, widening our trade deficit and reducing business investment and foreign direct investment.\n\nFor any Brit who wishes to…\n\nLive in the EU*, \nWork in the EU,\nStudy in the EU,\nTravel for longer than 90 days in the EU,\nExport to the EU,\nImport from the EU \n\nThings are definitely, objectively, worse.\n\n*EU/EEA",
                "user": "u/Known_Cheesecake2036"
            },
            {
                "text": "Brexit was probably the biggest influence on why my business ultimately failed.  \n\nGoods and supplies I needed became incredibly expensive to acquire from the EU. In some cases, my suppliers stopped shipping to the UK altogether.\n\nAnd for me to ship my goods in the other direction into the EU, it became more expensive and complicated to deal with.\n\nI lost a massive chunk of business and all of the convenience of trading in the EU overnight.\n\nSo I'm my eyes,  Brexit is a complete failure",
                "user": "u/darth-small"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "One of the reasons people voted for Brexit was to stop immigration. Last year we had 700k net migration. Doesn't sound like a great success to me.",
                "user": "u/mymokiller"
            },
            {
                "text": "Brexit assisted with the downfall of my business. So if you ask me, no.",
                "user": "u/Viazon"
            },
            {
                "text": "In terms of actual impact on a normal person, all Brexit has done for me is:\n\n- Makes it more expensive or difficult to buy things from Europe. Lots of places now won't even do UK shipping.\n- Makes it more difficult to travel to Europe\n\nIn my jobs\n- In the hospital lab, we had a big old hoo-ha because all our equipment is provided by Roche, which is a swiss company and all the stuff we buy has to move through Europe. \nThere was a brief period where a warehouse moved that caused us to be unable to provide blood tests for anything but the most urgent cases. There was additional faffing about with German companies over import taxes and such that caused us a shortage of other materials. All sorted now, but it was a tense few months. \n\n\n- At the university lab, in addition to above difficulties with suppliers, getting kicked out of the EUs Horizons program lopped a huge amount of funding out from British science. Numbers of EU students have also dropped, so now because of the drop in funding  our financial department is cracking down hard. \nThis leads to ridiculous situations like having to go get 3 alternative quotes for a piece of machinery that is only manufactured by a single company, even when your grant is specifically for that machine.",
                "user": "u/Hayred"
            },
            {
                "text": "Depends\n\nThose who voted brexit to reduce immigration are disappointed that it has only deterred EU migrants who are mostly white and nominally christian and that migration from other places has been unaffected\n\nThose who voted brexit because they believed the side of a bus that said there'd be more money for the NHS are disappointed to see much more money than that spaffed away by Truss and Kwarteng or syphoned off to give to politicians and their cronies\n\nThose who voted brexit because of \"Brussels bureaucrats\" were never able to properly explain what they meant by that anyway. \n\nThen there's those like that fella from Wetherspoons who supported brexit for reasons known only to himself and has seen his business hit by the lack of cheap euro labour. They aren't particularly happy.\n\nBut those who promoted and voted brexit to dodge european measures against tax avoidance or because they saw opportunities to get rich at the expense of the british tax payer, well some of those ones are happy.",
                "user": "u/DripDry_Panda_480"
            },
            {
                "text": "Migration from other places has greatly increased: legal migration has trebled and illegal migration up 10x. Our withdrawal from the Dublin convention has meant that we can no longer return illegal migrants to the last EU country they passed through.",
                "user": "u/azw413"
            },
            {
                "text": "I think it says a lot that Farage, Johnson etc al aren't shouting about how they made it happen any more.",
                "user": "u/watchman28"
            },
            {
                "text": "Speaking as someone from Northern Ireland, Brexit has done two good things for us: The Windsor Framework which keeps us under some of the EU Rules and allows us to trade in both the UK and EU markets which makes us a prime spot for investment and it has also speed up the talk of a United Ireland as well",
                "user": "u/Lie_Diligent"
            }
        ],
        "processed": true
    },
    "1ety0a0": {
        "post": "What worrisome trend in society are you beginning to notice?",
        "body": "",
        "user": "u/[deleted]",
        "comments": [
            {
                "text": "Ads in the comment section",
                "user": "u/PatheticGirl46"
            },
            {
                "text": "Believing all the advice given in tiktoks or instagram videos without doing any research\n\nEdited to add: Reddit, Facebook, podcasts. Literally all social media platforms.",
                "user": "u/Sufficient-Citron936"
            },
            {
                "text": "Total lack of awareness of other people, see it on the roads, in supermarkets etc. People have become zombies, or selfish",
                "user": "u/stever71"
            },
            {
                "text": "Media literacy seems close to nonexistent.",
                "user": "u/Talismato"
            },
            {
                "text": "Lack of critical thinking",
                "user": "u/Shadow948"
            },
            {
                "text": "People believing everything they see on social media.",
                "user": "u/ImaginationMajor5062"
            },
            {
                "text": "everyone is so mean ☹️",
                "user": "u/apresonly"
            },
            {
                "text": "The quality of education going down",
                "user": "u/TeodoroCano"
            }
        ],
        "processed": true
    },
    "1evkcrp": {
        "post": "What is a thing that isnt taken seriously but it actually should?",
        "body": "",
        "user": "u/Ilove_gaming456",
        "comments": [
            {
                "text": "Stress",
                "user": "u/No_Angle875"
            },
            {
                "text": "The current state of education. \n\nI realize that yeah it's a big topic but it feels like it's brushed off so quickly as like \"welp what can you do?\"",
                "user": "u/anonymooseuser6"
            },
            {
                "text": "Dental hygiene",
                "user": "u/Carl-99999"
            },
            {
                "text": "Constant pain in your body. It be taken seriously to avoid more complications in the future. You never there could be an underlying condition with those pains.",
                "user": "u/SweetGirlCutie"
            },
            {
                "text": "Shopping addiction. It sounds crazy until you deal with it.",
                "user": "u/JuggernautScary7026"
            },
            {
                "text": "Collapsing insect populations",
                "user": "u/downvotedbylife"
            },
            {
                "text": "taking breaks seriously can actually boost productivity and well-being",
                "user": "u/SnowGamerJourney70"
            }
        ],
        "processed": true
    },
    "1es5iph": {
        "post": "What are signs that you might not be as attractive as you believe?",
        "body": "",
        "user": "u/Waste_Cup7237",
        "comments": [
            {
                "text": "Target checkout cameras.",
                "user": "u/HiVi48"
            },
            {
                "text": "Without info, people assume you're single.",
                "user": "u/UltimateWaluigi"
            },
            {
                "text": "You have to make a certain face when you look in the mirror.",
                "user": "u/Substantial-Rub1571"
            },
            {
                "text": "ive straight been told by an ex,  \"you aren't hot enough to be this much of an asshole\"    So that I guess.",
                "user": "u/iceplusfire"
            },
            {
                "text": "Nobody looks at you or acknowledges you. If you don’t insert yourself into social situations you aren’t seen unless someone needs something from you.",
                "user": "u/Mr_Mediator"
            },
            {
                "text": "Always being told you look tired",
                "user": "u/passthedrink"
            },
            {
                "text": "Feeling like a ghost.",
                "user": "u/beccacee"
            },
            {
                "text": "You hear, “there’s somebody out there for everyone” a lot",
                "user": "u/Zahfier"
            },
            {
                "text": "people just don't pay as much attention to you",
                "user": "u/cumwithmehunny"
            },
            {
                "text": "automatic doors never open for you.",
                "user": "u/rainbowroobear"
            }
        ],
        "processed": true
    },
    "1ewwetf": {
        "post": "What's something you only understand if you have lived it?",
        "body": "",
        "user": "u/mrbigglesworthjr",
        "comments": [
            {
                "text": "One thing that’s hard to truly understand unless you’ve lived it is the experience of deep grief. Whether it's losing a loved one, going through a major life change, or dealing with any kind of profound loss, the emotions that come with it can be incredibly complex and overwhelming.",
                "user": "u/valentinarozee"
            },
            {
                "text": "Being in a warzone in any capacity.",
                "user": "u/primal_machine_22109"
            },
            {
                "text": "chronic pain. you’ve experienced pain before, so you think you get it, but nothing prepares you for when pain becomes your new baseline normal",
                "user": "u/confusedaboutdoctors"
            },
            {
                "text": "Poverty",
                "user": "u/frakas21"
            },
            {
                "text": "Chronic illness and disability",
                "user": "u/Lower-Ad-6293"
            },
            {
                "text": "The mindfuckery of addiction.",
                "user": "u/ImACavediver"
            },
            {
                "text": "Having a child die.",
                "user": "u/JCKligmann"
            },
            {
                "text": "frozen in time grief and grieving someone who is still alive",
                "user": "u/Ok_Humor7323"
            },
            {
                "text": "Feeling suicidal",
                "user": "u/Late-Republic2732"
            },
            {
                "text": "Being sexually abused as a child",
                "user": "u/Honest_Offer9406"
            }
        ],
        "processed": true
    },
    "1ewqoq6": {
        "post": "Single people, why are you single?",
        "body": "",
        "user": "u/ArdeParis",
        "comments": [
            {
                "text": "I don't know how to meet people anymore.",
                "user": "u/Kesooonya"
            },
            {
                "text": "Because I don't leave my house, I guess",
                "user": "u/AiditaBelle"
            },
            {
                "text": "Too introverted to approach someone, not good looking enough to be approached by someone.",
                "user": "u/SuchMathematician805"
            },
            {
                "text": "I'm single by choice, just not my choice 😭",
                "user": "u/RC414"
            },
            {
                "text": " I'm not really actively trying anymore. Years of rejections doesn't do wonders for the self-confidence. But I am comfortable being alone. I'm not super bothered by it, it's how it's always been for me..",
                "user": "u/ArmyUnpleasant7605"
            },
            {
                "text": "I'm a woman in my 70s, I've been married twice. First marriage  was awful, and I stayed single for 20 years but my second husband was a wonderful man.\n\n\nI lost him 2 years ago to cancer. \n\n\nThe cat and I are doing very well together.  I'm not interested in marrying again, because in my generation the men expect to be waited on and cleaned up after and catered to. Even the really good ones, like my Lou. But they will do yard work. \n\n\nMy house is clean, there are no wet towels on the floor , there are no dirty dishes scattered around the house, the dirty clothes are in the hamper, anything I put down is where I left it unless the cat pushes it to the floor, and I eat when I'm hungry instead of on a set schedule. \n\n\nAnd I have a lawn tractor for my acre of land. \n\n\nI have lots of women friends and many are widows, we have a lot of fun together. \n\n\nSingle works really well for me. Cats are easier and a lot less work than men. ",
                "user": "u/Any_Assumption_2023"
            },
            {
                "text": "I spend all my time arguing with the internet.",
                "user": "u/Vegan_Harvest"
            },
            {
                "text": "Being single is so peaceful",
                "user": "u/Local-Bass-5646"
            },
            {
                "text": "Depression.",
                "user": "u/lan60000"
            },
            {
                "text": "In the wise words of George Costanza: Oh, what's the point? When I like them, they don't like me. When they like me, I don't like them",
                "user": "u/grantrules"
            },
            {
                "text": "The people I’m interested in aren’t interested in me",
                "user": "u/Jimster1995"
            }
        ],
        "processed": true
    },
    "1essfcc": {
        "post": "What's a series that you can repeat every once in a while?",
        "body": "",
        "user": "u/Psytrancedude99",
        "comments": [
            {
                "text": "Band of brothers, at least once a year typically around Christmas",
                "user": "u/Tyrionsnow"
            },
            {
                "text": "Psych\n\nArcher - though this is more than once in a while. \n\nFuturama",
                "user": "u/SuperstitiousPigeon5"
            },
            {
                "text": "South Park",
                "user": "u/InternationalTest638"
            },
            {
                "text": "Arrested Development. It has so many quick fire jokes and intelligent depth while being silly and ridiculous.",
                "user": "u/wafflequest"
            },
            {
                "text": "Stargate",
                "user": "u/LadaOndris"
            },
            {
                "text": "I re watch Gravity Falls every once in a while when I'm in a bad mental place. Honestly a brilliant and fun show.",
                "user": "u/boxlessthought"
            },
            {
                "text": "Cowboy Bebop (1998)",
                "user": "u/squiddy-19"
            },
            {
                "text": "Grimm, it was cheesy in some places, but it knew what it was and had fun with it",
                "user": "u/silentdrestrikesback"
            },
            {
                "text": "The Americans. So many rich characters and subtleties to pick up on re-watches.",
                "user": "u/susysyay"
            },
            {
                "text": "The Sopranos.",
                "user": "u/TheGayGaryCooper"
            }
        ],
        "processed": true
    },
    "1ev2ou0": {
        "post": "What moment made you realise your gf/bf would never be your wife/husband? ",
        "body": "",
        "user": "u/Itsemmaxx",
        "comments": [
            {
                "text": "When we finally got into deep talks about how we viewed our futures and I realized our goals didn’t align.",
                "user": "u/Curious-Air4196"
            },
            {
                "text": "He couldn’t handle any serious conversation. Every time I brought up the future, he’d just joke around or change the subject. It made me realize he wasn’t in it for the long haul.",
                "user": "u/Perfect_ladybabe122"
            },
            {
                "text": "When we were looking for places to rent/buy for a home and she absolutely refused to compromise on where we'd be living. It's a long story, but her reasoning in that moment told me all I really needed to know about where I was placed as importance in her mind",
                "user": "u/Cyanora"
            },
            {
                "text": "When she asked her friend to flirt with me to test me.",
                "user": "u/Nelson4ay59"
            },
            {
                "text": "When I met her dad. \n\nI couldn't stand the man and I knew I couldn't put up with him for the rest of one of our lives. I tried extremely hard to stay with her but anytime we went to a family event or holiday it made me die a little inside. When we talked about our future she always said she wanted to live close to him. The thought of him being a grandfather to any possible kids we would have had sealed the deal and I had to call it off.\n\nEdit: Thanks for all the support and DMs, didn't expect that! For those asking we were together for 3 years, met during first year of college, and I met her dad about 6 months into the relationship for the first time at Christmas.",
                "user": "u/MoldyOldCrow"
            },
            {
                "text": "I don't want to trauma-dump, so I'll leave it at this: pay attention to how they treat you when you are physically unwell and reliant on them.",
                "user": "u/KittyCamino"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "He tried to control everything I did. He told me I couldn't go over to my friends house after school because \"he didn't trust them\", I couldn't babysit anymore because \"I need to be inside my house by 6pm every night\", I couldn't wear pink, red, or purple anymore and I could only wear long pants and turtleneck shirts as \"I need to dress modestly \".\n\nNot only did I NOT obey him, but even he came to my house before school, he told me, in front of my dad, that I had to change my clothes.  I was sent out of the room, and 23 years later, I'm still not sure what my dad said to him, but all his crazy demands stopped and I broke up with him a few weeks later.",
                "user": "u/SassyCatLady442"
            }
        ],
        "processed": true
    },
    "1ew4iag": {
        "post": "For those of you who grinded hard in your twenties, how did it pay off?",
        "body": "",
        "user": "u/FU2LUTHER",
        "comments": [
            {
                "text": "Startup didn’t pan out, never made my millions, now divorced after not putting that energy into my relationship instead. Don’t hate the hustle, but diversify your efforts.",
                "user": "u/veredox"
            },
            {
                "text": "\"When I was young, I was very poor.  Now after a lifetime of hard work and sacrifice, I am no longer young\"",
                "user": "u/Badaxe13"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Got me enough money to afford a down payment on a house just before the boom.",
                "user": "u/Vic_Hedges"
            },
            {
                "text": "[Thunderfury, Blessed Blade of the Windseeker]",
                "user": "u/basedlandchad27"
            },
            {
                "text": "Well now you have a very good income and you are not living at your parents' house.",
                "user": "u/littleangelmoon68"
            },
            {
                "text": "More freedom and financial stability.",
                "user": "u/MysticcWaves"
            },
            {
                "text": "I regret it, from a social angle. I worked full-time, straight from graduating college. No breaks. My friends took time to travel, etc. Now, in our mid-30s, we're now all settled in to careers, with spouses and kids -- but I've missed out on the travel and sowing of wild oats.",
                "user": "u/simongurfinkel"
            },
            {
                "text": "Exhausted.\n\nOne thing people don’t remind you is that people that you love age and get more sick. I was laser focused onto my career that I didn’t notice my family members getting sick until it was too late. \n\nI’m closing into my thirties but I already wish I could have spent more time with my family and not worry about my career so much.",
                "user": "u/Tabacia_bemisia"
            },
            {
                "text": "I worked hard but didn't save well. I am okay in my 40s. Not rich but not poor either. Own a house and got a nice retirement lined up.\n\nI know people in my 40's who earned a lot more then me in their 20's and are now homeless. All comes down to moderation.",
                "user": "u/MyLandIsMyLand89"
            }
        ],
        "processed": true
    },
    "1ewhtcr": {
        "post": "What is illegal but is done so much it feels legal?",
        "body": "",
        "user": "u/SPplayin",
        "comments": [
            {
                "text": "Speeding in vehicles",
                "user": "u/AgitatedPatience5729"
            },
            {
                "text": "Where I live… people running red lights. Blatantly running red lights that have been red for seconds. My son and I were almost t-boned a few weeks ago.",
                "user": "u/PsychFlower28"
            },
            {
                "text": "That stuff my neighbours keep smoking.",
                "user": "u/spacebuggles"
            },
            {
                "text": "downloading pirated movies, games, digital products for free...",
                "user": "u/Slutty_Ladybabe12"
            },
            {
                "text": "I think it is worth mentioning that the most commonly committed crime in the US is wage theft. That means employers stealing from their employees, in various ways, is the most common crime out there.",
                "user": "u/toadjones79"
            },
            {
                "text": "Jaywalking. \n\nIt’s illegal where I live to cross the road if your within 30m of a pedestrian crossing or traffic lights with a pedestrian cycle. \n\nEveryone does it.",
                "user": "u/Christopher135MPS"
            },
            {
                "text": "Android users know the deal—why pay when you can just grab the APK for free?",
                "user": "u/HOttie_babe97"
            },
            {
                "text": "Underaged drinking",
                "user": "u/Sexy_Ass2112"
            },
            {
                "text": "Yielding at a stop sign",
                "user": "u/Big-Carpenter7921"
            },
            {
                "text": "Insider trading.",
                "user": "u/Proddx"
            }
        ],
        "processed": true
    },
    "1ewkqc7": {
        "post": "What is something that you're unwilling to compromise on now that everything is so expensive? ",
        "body": "",
        "user": "u/bavelpazy",
        "comments": [
            {
                "text": "Motorcycle helmet. No point in saving money if you’re dead.",
                "user": "u/IceSweetgum"
            },
            {
                "text": "Running a window ac unit and 3 other fans all day. I don’t have ac and last summer was miserable sitting in a house over 90+ degrees. I will work the extra hours to make up for the comfort of a slightly cooler studio",
                "user": "u/SpicyL3mons"
            },
            {
                "text": "My toiletries and skincare. Finally found what worked for me and im not about to change that 😔",
                "user": "u/diyujian"
            },
            {
                "text": "Heating in the winter. I’m not about to freeze just to save a few bucks.",
                "user": "u/Amazingpusy212"
            },
            {
                "text": "i won’t compromise on quality coffee,, some things are worth the splurge",
                "user": "u/SnowfallNomad64"
            },
            {
                "text": "I refuse to buy margarine instead of butter even though it’s now $6.50/lb here. I may dole out pats of it like it’s congealed gold but you can pry it from my cold, dead hands.",
                "user": "u/CrazyCatLushie"
            },
            {
                "text": "Heating my home in the winter.\n\nI don't care how much it costs, I refuse to be cold in my own house.",
                "user": "u/SuggarLovey"
            },
            {
                "text": "Regular dental cleanings.",
                "user": "u/hongio_peery"
            },
            {
                "text": "A/C.  My house is going to be cold and I'm going to be really comfortable.",
                "user": "u/devilgator23"
            },
            {
                "text": "Shoes. Everything gives me blisters except the one kind I really like and being in pain ruins things for me, so if I want to enjoy anything I've gotta have shoes that work.",
                "user": "u/phoenix-corn"
            }
        ],
        "processed": true
    },
    "1ex3n04": {
        "post": "What's the smoothest pickup line you've been told?",
        "body": "",
        "user": "u/ArtsyAmalie",
        "comments": [
            {
                "text": "I was very intently looking at hot sauces at the grocery store and a guy walked past me, winked and went “you are what you eat”…..caught himself by surprise at how smooth it was, giggled and walked away.",
                "user": "u/viper8757"
            },
            {
                "text": "I was in a crowded karaoke bar with a bunch of coworkers and a dude kept looking at me. He walked over and said, “hey, tell your friend I think she’s cute”. Then he nodded over to my reflection in the mirrored wall. It caught me off guard in the most adorable way. I’m smiling right now thinking about it.",
                "user": "u/Wander_walker"
            },
            {
                "text": "Girl I used to very briefly work with dropped a piece of paper on the ground while I was behind her. I picked it up and said, \"Hey you dropped something\". She turned around and said, \"It's for you\". \n\nIt was her name and number. Kinda silly, but I always thought it was so cool haha.",
                "user": "u/facetown"
            },
            {
                "text": "I used to draw tic tac toe on a napkin and just walk to a chick at a table and slap it down with a pen and my x in the center. I’d put “phone number if win” and I’d get the number like basically every time. I always ruined it later by having a terrible personality and no money",
                "user": "u/not-read-gud"
            },
            {
                "text": "My buddy’s brother saw a cutie sitting with her friends in DQ. As he ordered at the till, he purchased an ice cream cake, had the staff write his number on it in icing, and then deliver it to her. She received it, and saw him as he was leaving. He winked at her as he walked out the door.\n\nIt worked",
                "user": "u/CoffeeGuzlingBastard"
            },
            {
                "text": "A buddy of mine is really good with women. He does this one thing on our uni campus where he'll go up to a random girl.\n\nHim: \"hey I have a question and need a woman's advice\"\n\nHer: \"sure what's up?\"\n\nHim: \"let's say I see a really cute girl, do I go up and talk to her or is that too direct?\"\n\nHer: 99.9999% of them say: \"you should totally go talk to her.\"\n\nHim: he then introduces himself.\n\nThe reason why this works is because you casually said a compliment and gave the girl a smile.\n\nP.S. I forgot to specify, you have to be very handsome...",
                "user": "u/SandPale2532"
            },
            {
                "text": "In college, a friend of mine used to go out with a toothbrush as a prop. When he saw a girl he liked he would put it in his front shirt pocket and approach them.\n\nThey would always say, ‘Why have you got a toothbrush in your pocket?’ , and he would reply, ‘Well I’m not going to use yours in the morning, am I?’\n\nAlways got a laugh. Sometimes got him more.  😂",
                "user": "u/mocoworm"
            }
        ],
        "processed": true
    },
    "1et0njk": {
        "post": "What was something you really got into but now \"it was a phase\"?",
        "body": "",
        "user": "u/Possible-Ad-1352",
        "comments": [
            {
                "text": "In my twenties I really got into sailing. Before that I used sit on the beach and watch the sail boats go by, and think how peaceful, and relaxing it looked. So I signed up at the local college and learned to sail. Did some competitive racing . I dreamed of racing in the Americas Cup, and sailing around the world, and living on a sail boat. I even built a wooden sailboat, and restored a few. After a number of years and getting caught in some bad storms, and getting tired of waiting for the perfect weather, then getting all rigged up just in time for the wind to die. I realized this sport is anything but peaceful and relaxing. Now I sit on the beach and watch the sailboats go by and think.... Poor saps... They could be lying on the beach relaxing . But there out there yanking on ropes and grinding winches.",
                "user": "u/BlackFlagandbones"
            },
            {
                "text": "Brewing Beer. \n\nIt was enjoyable but didn't spark a hobbyist passion. Plus, the beer belly.",
                "user": "u/TheDadThatGrills"
            },
            {
                "text": "I wore a cowboy hat for a year.",
                "user": "u/RKYThrowaway"
            },
            {
                "text": "I was all about knitting. My one and only scarf ended up being a blanket for my cat",
                "user": "u/Admirable_BodYPure"
            },
            {
                "text": "I cringe thinking about this now, but when I was in elementary school, I wanted to be a Mexican so badly (I'm Filipino-American) that I would watch Telemundo without subtitles, read the Spanish Bible at church during mass, & even bought a Mexican flag towel.",
                "user": "u/Upbeat_Tension_8077"
            },
            {
                "text": "My skateboarding phase from 12-14. I wore all the clothes, had the look, and could barely do a kickflip.",
                "user": "u/HockomockRock"
            },
            {
                "text": "Collecting things as a kid. Coins, marbles, rocks, etc",
                "user": "u/Didntlikedefaultname"
            },
            {
                "text": "I went through a phase of learning to juggle. The only thing I can juggle now is my schedule",
                "user": "u/LOvee_FreshBaby"
            },
            {
                "text": "Everything. I have adhd",
                "user": "u/Potential-Narwhal-"
            }
        ],
        "processed": true
    },
    "1ewyhfr": {
        "post": "what makes you not wanna die? ",
        "body": "",
        "user": "u/Impossible_Match6336",
        "comments": [
            {
                "text": "Curious to see what will happen",
                "user": "u/Lonely-Air-8029"
            },
            {
                "text": "Might miss something cool.",
                "user": "u/weird-oh"
            },
            {
                "text": "Transferring the pain to my daughter isn't fair",
                "user": "u/youmovedon"
            },
            {
                "text": "Knowing I’m someone’s favorite person, even if it’s just my cat.",
                "user": "u/Perfect_Loverbabe091"
            },
            {
                "text": "The suicide rates for children of survivors....",
                "user": "u/BuxomGata"
            },
            {
                "text": "Connections with the people around me.",
                "user": "u/Angeloflove71"
            },
            {
                "text": "I haven’t been to enough national parks yet",
                "user": "u/matchawaffles5034"
            },
            {
                "text": "My kids",
                "user": "u/Substantial-Hippo637"
            },
            {
                "text": "Alive I'm a burden to myself.  \nDead I become a burden to others.",
                "user": "u/varthalon"
            }
        ],
        "processed": true
    },
    "1euh8ul": {
        "post": "What’s the most ridiculous thing you believed as a child?",
        "body": "",
        "user": "u/irizih",
        "comments": [
            {
                "text": "As a child, I genuinely believed that if I dug deep enough in the backyard, I could reach the other side of the world. I spent hours with a shovel, convinced I’d end up in another country. Reality hit when I barely got past the dirt.",
                "user": "u/yourdigigirlfriend"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "I grew up very close to the ocean and on nice evenings we would take walks on the beach.\n\nMy mother would tell us that we should listen carefully when the sun was setting over the ocean because it would sizzle. (You know how when you put out a fire with water) \n\nMy sister and I went out of our ways to pretend to hear that.",
                "user": "u/Background-Two-8999"
            },
            {
                "text": "I used to believe that when your luggage went on a conveyor belt at the airport, that your luggage would go all of the way to your destination on that conveyor belt.",
                "user": "u/Apprehensive_Sand343"
            },
            {
                "text": "That waves came from whales slapping their tails on the water way far out in the ocean.",
                "user": "u/SpicySnails"
            },
            {
                "text": "I was convinced that the moon followed our car everywhere because it had a crush on my mom",
                "user": "u/Complex-Pass4023"
            },
            {
                "text": "When I was like 7-8 years old I was convinced I could see a small outline of the statue of liberty from our garden, in reality it was a big networking antenna. We're living in Germany lol",
                "user": "u/BodyPillowCollector"
            },
            {
                "text": "When I was a kid, my mom explained to me that we all had belly buttons because that’s how our moms fed us before we were born. So I thought when you got pregnant, your belly button opened up and you just put whatever you wanted to down there. Like I thought women were just shoving chicken legs in their belly buttons.",
                "user": "u/camila_applepie22"
            },
            {
                "text": "When people died in movies they died in real life. Never understood why an actor would take a part in a movie knowing he would be killed during filming.",
                "user": "u/SeductionWhisper"
            },
            {
                "text": "There was no colour in the world when black and white movies existed.",
                "user": "u/Thanossing"
            }
        ],
        "processed": true
    },
    "1evcpnj": {
        "post": "What’s something you do that really shows your age?",
        "body": "",
        "user": "u/Center_Power_Unit",
        "comments": [
            {
                "text": "Not recognizing most of the guests on late night talk shows or SNL. Maybe have heard the names but no idea what they do.",
                "user": "u/Curious_Kangaroo_845"
            },
            {
                "text": "Grunt any time I go from sitting to standing or standing to sitting.",
                "user": "u/MyPrimaryAcct"
            },
            {
                "text": "I was born in a country that doesn't exist anymore.",
                "user": "u/cutiesposter"
            },
            {
                "text": "Whenever I see a building in my town, I tell people about what used to be on that same site.\n\nExample: “See that grocery store. I remember when it was just a cow pasture.”",
                "user": "u/Juan_Calavera"
            },
            {
                "text": "I discover a great new band I've never heard of but when I google them I learn that they won like 10 Grammys and had a no. 1 album ten years ago.",
                "user": "u/GoKartMarlys"
            },
            {
                "text": "I put periods at the end of text messages.",
                "user": "u/Stipes_Blue_Makeup"
            },
            {
                "text": "You can pry my side-parted hair from my cold dead scalp. ",
                "user": "u/drainbead78"
            },
            {
                "text": "You know the lady who has a rose garden and who gives fresh picked tomatoes to the neighborhood kids? I've become her.",
                "user": "u/doublestitch"
            },
            {
                "text": "I call all video games Nintendo just to get a rise out of the kids",
                "user": "u/1920MCMLibrarian"
            },
            {
                "text": "I still say “tape a show” when I want to DVR something and occasionally refer to “hanging up” when ending a video call.",
                "user": "u/thirdtimesdecharm"
            }
        ],
        "processed": true
    },
    "1eykyn6": {
        "post": "Which show starts as a 10/10, but ends as a 1/10?",
        "body": "",
        "user": "u/BVTQT",
        "comments": [
            {
                "text": "Once upon a time. I LOVED the first two seasons but literally couldn’t watch after that",
                "user": "u/Virtual-Witness9579"
            },
            {
                "text": "I don’t know that it started as a 10/10, but Weeds absolutely collapsed after about the 3rd season and somehow kept going",
                "user": "u/professorfunkenpunk"
            },
            {
                "text": "PRETTY LITTLE LIARS !!! 📢 The way it ended was straight up insulting to everyone who spent years loyally watching that show.",
                "user": "u/WebkinzMurderer69"
            },
            {
                "text": "I absolutely LOVED Blacklist - I could watch James Spader in his element all day - but as the seasons went on I could no longer tolerate the character of Elizabeth Keen and the constant flip flopping of whether Reddington is her father or not. It got so old.",
                "user": "u/mcbeaz"
            },
            {
                "text": "House Of Cards \n\nEdit: The U.S. version.",
                "user": "u/jackiejacker23"
            },
            {
                "text": "I loved the first season of Heroes but it declined drastically to the point I stopped watching pretty abruptly",
                "user": "u/lurkbutdonttouch19"
            },
            {
                "text": "Once Upon a Time. \n\nIt should have stopped after Season 3-4. They starting doing to much and I could barely finish the show. I had to force myself to sit and watch till the end of each episode.\n\nAlso Belle and Rumpelstiltskin’s relationship made me uncomfortable. I didn’t like it at all.\nThey should have stopped after the Peter Pan arc imo",
                "user": "u/J_0_0_N"
            },
            {
                "text": "That 70s show.\n\nOnce Eric left for Africa everything fell apart.\n\nThis show was a staple in my house, we would all watch the new episodes when they came out, which i feel was on Sunday night before school.",
                "user": "u/Necrotitis"
            },
            {
                "text": "American Horror Story, the beginning seasons were so good, but over the last few seasons has fallen drastically.",
                "user": "u/FoxtrotMassie"
            },
            {
                "text": "Heroes. That first season is incredible. By the time the caravan/circus people show up, it's unwatchable.",
                "user": "u/maddieterrier"
            },
            {
                "text": "I think it’s safe to say Riverdale went south after season 1",
                "user": "u/goodbyetogepi"
            }
        ],
        "processed": true
    },
    "1ey1gx3": {
        "post": "What’s the scariest conspiracy theory  you’ve ever heard?",
        "body": "",
        "user": "u/OutlandishnessSea258",
        "comments": [
            {
                "text": "This is a regional one, but the idea that Robert picton (the pig farm serial killer) didn’t act alone. The theory goes that the farm was a common party spot for the Vancouver police department and hells angels, and that was the reason he got away with it for as long as he did. Recently he died in jail and the families of his victims are furious he was not able to testify. There were also a lot of sketchy things to do with evidence. When you start looking it’s pretty convincing.",
                "user": "u/longwinters"
            },
            {
                "text": "That the South Korean prosecution office bullies people into committing suicide. Don’t know if it’s the scariest, but considering the current president openly admitted this - idk.",
                "user": "u/EntertainmentPure955"
            },
            {
                "text": "That there is no such thing as \"food safe plastic.\"",
                "user": "u/tschris"
            },
            {
                "text": "That r/AskReddit is mostly a data scraping tool used by marketing companies to farm data from the masses based on what company x is selling, i.e. Disney wants to know what movie to remake next so let's pay someone to ask about favorite Disney films from their childhood and log the responses. Actually, I just made that up, but I have no doubt it's happening.....\n\nEdit: Yes, I'm aware that the idea of reddit selling data for market research is not exactly novel. The crux of the conspiracy theory is that many questions are not asked by real accounts. Consider a situation where something is trending somewhere else online, then a question is asked by a \"user\" to get a better idea of whether the trend is exploitable in some way or just a flash in the pan.",
                "user": "u/paradigmshift7"
            },
            {
                "text": "Dark Forest Theory: we can't find any evidence of extraterrestrial life because the smart ones are hiding, and the dumb ones have been killed by... something else.",
                "user": "u/aliasalt"
            },
            {
                "text": "Shrimp is bugs",
                "user": "u/attackcow94"
            },
            {
                "text": "Plants cultivate humans for the carbon dioxide",
                "user": "u/__kakashi__hatake___"
            },
            {
                "text": "in the early 1980s, Coca-Cola deliberately removed \"Coke Classic\" (made with cane sugar) from production and introduced \"New Coke\" (a.k.a. \"Coke II\") as a ruse, knowing full well that people would complain that it \"wasn't the same as before,\" so they staged an apology commercial from Coke's CEO saying \"we're sorry; we hear you\" (when has a CEO ever said that??? LOL), and re-introduced \"Coke Classic\" with corn syrup instead of cane sugar, knowing that by the time it was re-released, the market's inventory of the original \"Coke Classic\" had largely been distributed and consumed, so very few people (if any) could actually compare them side-by-side to see if they tasted the same.\n\nBTW, the tariffs on cane sugar were increased ginormously just before they did this, which was a way to encourage domestic corn production.\n\nTL;DR - Coke pulled a switch-a-roo by changing sweeteners and lied saying that it was the exact same as before",
                "user": "u/chocolate_yummy"
            },
            {
                "text": "The current social wars were designed to distract us from the trillions of dollars that went from the middle class to the wealthy. It will continue to happen while people fight over body parts and bedroom activities.  The people almost broke through with Occupy Wall St. but the PTB continue to divide people to make sure it can't happen again.",
                "user": "u/squirrely_danielson"
            }
        ],
        "processed": true
    },
    "1eyasgw": {
        "post": "What minor things are very attractive on men, but they never seem to realise it?",
        "body": "",
        "user": "u/FrighteninglyClassy",
        "comments": [
            {
                "text": "the way they listen intently and remember little details can be surprisingly charming",
                "user": "u/BubblyNovax"
            },
            {
                "text": "That subtle confidence in the way he speaks—never bragging, just comfortable with himself.",
                "user": "u/Character-Office-892"
            },
            {
                "text": "I have written down all the comments and will now become the sexiest man on earth. Thanks, reddit.",
                "user": "u/jeancv8"
            },
            {
                "text": "Genuine smile, good posture, or paying attention to details",
                "user": "u/xEmilySexy"
            },
            {
                "text": "I will study this thread quite closely so I can tempt my wife.",
                "user": "u/BigBoyShaunzee"
            },
            {
                "text": "Talking about something he's passionate about\n\nSimiling/laughing genuinely\n\nHaving a unique/unexpected way of thinking \n\nHands/forearms \n\nSmelling good\n\nBeing considerate with everyone\n\nSinging along to some music he's listening to, even if he doesn't sing well\n\nLeaning on the door frame with his arm above his head (as I write it it sounds dumb but it works on me)\n\nRubbing/patting/scratching his tummy (that's probably just me tho)\n\nPlaying with my hair",
                "user": "u/smooth_brain_0"
            },
            {
                "text": "Seeing a man truly smile. So many men are raised to be tough and never smile for photos. Seeing a man light up because he's happy or excited is amazing!\n\nAnd Blushing! If a man blushes, I'm done for. *swoon*",
                "user": "u/AlfalfaFloozy"
            }
        ],
        "processed": true
    },
    "1eyuvhi": {
        "post": "What’s something money can buy we poor people don’t even know of?",
        "body": "",
        "user": "u/Crocodile_Banger",
        "comments": [
            {
                "text": "In some countries, rich people hire poor people to serve prison sentences for them.",
                "user": "u/Cgk-teacher"
            },
            {
                "text": "There are companies that sell books by the foot. Usually leather bound. It’s for decorating so your in home library is stocked with books. Normally you can pick genres or just let the company fill your shelves, you just give them the length of your shelves and your color scheme and they send you books to fill the shelves in bindings that harmonize with your rooms color pallete.",
                "user": "u/buck746"
            },
            {
                "text": "I do IT for the hilariously rich in LA. My favorite thing you can buy is a $300,000 theater streaming device that allows you to watch just released movies directly into your home theater. It requires a background check and a huge amount of money, but then any movie released in theaters is directly uploaded into your system and then you can watch at home in your own little movie theater.",
                "user": "u/Big-Routine222"
            },
            {
                "text": "Personal concierge services. Pay an annual fee of several thousand dollars, and be able to request help getting.... whatever. Hard-to-get concert tickets, dinner reservations, you name it. \n\nExample: [https://quintessentially.com/](https://quintessentially.com/)",
                "user": "u/halfslices"
            },
            {
                "text": "The biggest thing is time - need to get to London for a meeting? Leave for the airport and your plane/charter waits for you. Need a haircut? A person comes to your house to do it for you. Imagine a lot of the things you go out to do on a daily basis and imagine having people to do all that. Need a new phone? Peter will get you the latest iPhone, programmed l, and working the way yours was before. Drop it in the toilet? He bought 5.",
                "user": "u/Delicious_Oil9902"
            },
            {
                "text": "Pet cloning. Ex boss was getting his dog cloned for $100k",
                "user": "u/CharmingGaze2"
            },
            {
                "text": "Luxury ice cubes.\r  \n\r  \nGläce Luxury Ice Co produces perfectly square ice blocks for “minimum dilution and maximum cooling”.\r  \n\r  \nHand-carved and completely clear, these cubes are sold in bags of 50 and each bag costs $325.",
                "user": "u/Whimsicall-Whisper"
            },
            {
                "text": "1) concierge medicine. You get your own dedicated doctor, perhaps your own whole clinic. You never wait for tests. You never wait for an appointment. Your doctor will make house calls and even diagnose and prescribe over the phone. \n\n2) concierge banking. You don't go to the bank to withdraw cash on the rare times you need cash. You call the bank rep and they will courier the money to you. \n\n4) family offices. The legal and financial equivalent of a private clinic of your own. One or more lawyers, one or more CPAs, both with the usual staff. Want to buy a property? Just call the office and they will handle all the paperwork. Even spin up a numbered Delaware company and sign deeds for you.\n\n5) bespoke cars. At the lower end, this means you sit down with a Rolls Royce rep and going over choices. They will arrange a custom paint colour and guarantee no other car will get that shade. Ditto for upholstery, dash treatment etc. In the middle, the likes of Lamborghini and Koenigsegg have lists of billionaire car collectors. When they come up with a concept, they consult with the members of that list before any metal gets shaped. When they release the latest hyper car and say only 25 will be made, that's because only 25 billionaires said they wanted one. Being able to say you have a 1 of 25 car is valuable over and above the car itself. At the very high end, you can call them and pitch your own concepts and they will build a complete 1 of 1 car for you. The Sultan of Brunei famously had a lot of total one off cars made to his exact specifications from many different manufacturers. The \"Rainbow Sheikh\" Sheikh Hamad bin Hamdan Al Nahyan has also done this numerous times.",
                "user": "u/Barbarian_818"
            },
            {
                "text": "I saw this while installing cabinets in a mansion. Espresso machine in the bathroom.",
                "user": "u/PNW35"
            },
            {
                "text": "Citizenship in other countries. Costs about as much as a house for less desirable countries, and about as much as starting a small business for the nicer ones.",
                "user": "u/CampusTour"
            }
        ],
        "processed": true
    },
    "1exnzel": {
        "post": "What’s a toxic trait you recognize in yourself?",
        "body": "",
        "user": "u/youngGod928",
        "comments": [
            {
                "text": "I don't communicate my needs and then get frustrated when they aren't met.",
                "user": "u/unisetkin"
            },
            {
                "text": "Inflexible. I want to do things my way. Trying to learn to overcome this but old habits die hard",
                "user": "u/workinghardyes"
            },
            {
                "text": "I tend to overthink a lot which sometimes makes me my own worst enemy.",
                "user": "u/mnbvyjdghhs"
            },
            {
                "text": "I'm lazy.... essentially I'm like a cat...",
                "user": "u/Typical_Leg1672"
            },
            {
                "text": "I don’t talk about my feelings at all. It’s hard to know if I’m sad or mad about something.",
                "user": "u/Avocado-Toast-93"
            },
            {
                "text": "I don’t set boundaries with people which leads to me becoming angry with them at a later date because they are taking advantage of my being too nice.",
                "user": "u/rando_mike"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "I judge people too quickly and I'm really petty",
                "user": "u/ULTRAPUNK18"
            }
        ],
        "processed": true
    },
    "1eygx5v": {
        "post": "Which aspect of married life makes you want to stay single?",
        "body": "",
        "user": "u/MorningSavant",
        "comments": [
            {
                "text": "Overall, I love being married. The thing I probably miss the most is when I was single, I cleaned the house and it STAYED clean. Now, it stays clean for about 5 minutes. :-(",
                "user": "u/Vivienne1973"
            },
            {
                "text": "Deal with extended family members that I heavily dislike nor get on with. Worse is to have to help them or get involved their problems.",
                "user": "u/542Archiya124"
            },
            {
                "text": "Not having any totally personal space.\n\n\nI lived alone before I met my husband and I still miss that feeling of closing the front door and knowing I had every room to myself.",
                "user": "u/LordyIHopeThereIsPie"
            },
            {
                "text": "inlaws and their views",
                "user": "u/OasisJunkie"
            },
            {
                "text": "I love my wife. She’s complementary to me in a lot of ways, and was the first person who I met that made me feel like I could be myself.\n\nShe also hogs the covers, leaves lights on, and can’t seem to close any drawers she opens.\n\nETA: spelling",
                "user": "u/JangusCarlson"
            },
            {
                "text": "When my wife sits down in the living room, sees what I’m watching and says “Can’t we watch something we BOTH want to watch?” \n\nThis means she wants me to put on FRIENDS on Netflix for the millionth time so she can ignore it and stare at her phone. She does not like when I point out that she can stare at her phone while I’m watching what I want to watch.",
                "user": "u/-Words-Words-Words-"
            },
            {
                "text": "Having to compromise on the thermostat settings all the time.",
                "user": "u/petalxfantaasy"
            },
            {
                "text": "Having someone talk to you all the time",
                "user": "u/IceSmiley"
            },
            {
                "text": "I'm pretty minimal when it comes to possessions. I don't like to have a lot of *stuff* that I have to organise and keep track of. Being married though (and having kids) means having to live in a house with *so much stuff*. I also think it's a lot easier to manage money by myself, as I can get by on relatively little.",
                "user": "u/AlterEdward"
            },
            {
                "text": "Accountability to someone else but yourself. Obligations.",
                "user": "u/Saxon2060"
            },
            {
                "text": "You have to meet the in-laws and get to know them. Let alone, accept them and them.. You!",
                "user": "u/skumplesn"
            }
        ],
        "processed": false
    },
    "1eytd5a": {
        "post": "What TV show has a 10/10 finale?",
        "body": "",
        "user": "u/Mean_Ad_4762",
        "comments": [
            {
                "text": "Band of Brothers. \nEspecially the voiceover at the Baseball match and the Veteran's interviews at the end always make me absolutely speechless.",
                "user": "u/Ok_Musician_1072"
            },
            {
                "text": "Six Feet Under\n\nIt actually has a 9.9 on IMDB\n\n[https://www.imdb.com/search/title/?count=250&series=tt0248654&sort=user\\_rating,desc](https://www.imdb.com/search/title/?count=250&series=tt0248654&sort=user_rating,desc)",
                "user": "u/blimkat"
            },
            {
                "text": "Justified \"We dug coal together\"",
                "user": "u/debatesmith"
            },
            {
                "text": "Better call Saul\n\n\"My name is McGill. I'm James McGill\"\n\nGoosebumps",
                "user": "u/Total-Prize-9246"
            },
            {
                "text": "MASH",
                "user": "u/swibirun"
            },
            {
                "text": "Schitt’s Creek",
                "user": "u/CandidTrade6528"
            },
            {
                "text": "gravity falls. two seasons. lots of mystery. perfect ending.",
                "user": "u/blondestipated"
            },
            {
                "text": "Bojack Horseman \n\nBojack has this thing that the penultimate episode of each season is the actual finale, and the last episode is a sort of epilogue. So with that said, View from Halfway Down is amazing",
                "user": "u/fixingmewank"
            }
        ],
        "processed": false
    },
    "1exth4u": {
        "post": "How do you get better at flirting?",
        "body": "",
        "user": "u/hovelybeatmalls",
        "comments": [
            {
                "text": "A guy told me that he liked my shoes and asked where I’d gotten them.\n\nWe were in a bowling alley.",
                "user": "u/toto123public"
            },
            {
                "text": "I always just thought of it as a game, but one you’re not really trying to win, it’s just fun to play.\n\nWhen you find an opponent that makes it more fun is when you know you’re doing it right. \n\nIf not, then concede the match, and move on.",
                "user": "u/Plantayne"
            },
            {
                "text": "Good at flirting also means recognizing when the other party isn't receptive.\n\nIf they're answering briskly and killing conversation, cut your losses and move on.",
                "user": "u/Glad_Entrance3802"
            },
            {
                "text": "Listen more than you talk; people love to feel heard.",
                "user": "u/Inside_Literature280"
            },
            {
                "text": "Perhaps forget flirting. Just talk to people and be interested in what they say. Ask real questions. Listen to the answers. Work on improving your feel for the flow of conversation. But the trick is to ACTUALLY be interested in what they are saying 😄",
                "user": "u/sleepybeek"
            },
            {
                "text": "People don’t care that much if you say something embarrassing or weird, so you shouldn’t care either. From what I’ve learned most girls actually like it when you’re just talking about whatever you feel like even if it’s kinda goofy or weird because it brings up genuinely good conversation that isn’t the boring stuff they always talk about with guys trying to flirt with them",
                "user": "u/jello_schnoogle19"
            },
            {
                "text": "Same way your get to Carnegie Hall. \n\n\"Practice, practice, practice.\"",
                "user": "u/daithisfw"
            },
            {
                "text": "GREETINGS FAIR MAIDEN. I APPROACH THEE WITH ROMANTIC INTENT.",
                "user": "u/oohjam"
            },
            {
                "text": "Try to find your personal profile and seek to flirt with the most synchronized profiles.",
                "user": "u/blackycat50"
            }
        ],
        "processed": false
    },
    "1ey4861": {
        "post": "What are some unwritten rules for men?",
        "body": "",
        "user": "u/supernfsj",
        "comments": [
            {
                "text": "You will return the head nod.",
                "user": "u/cutie_laughter05"
            },
            {
                "text": "When you have a set of tongs, clap them at least twice to make sure they are working.",
                "user": "u/YellowStar012"
            },
            {
                "text": "Stand up to shake someone’s hand.",
                "user": "u/Western-Bad-667"
            },
            {
                "text": "When you drop a girl (or later, your kid's friends) off at home you never drive off until they are inside the house.",
                "user": "u/SoMuchSpentBrass"
            },
            {
                "text": "When you finish pumping gas into your car, you have to shake the nozzle to get the last drops out. We all know why.",
                "user": "u/BoredomFestival"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Direct the stream to clean off the gunk in a toilet.",
                "user": "u/pm_me_coffee_pics"
            },
            {
                "text": "Don't throw a friend under the bus to impress someone. Ever.",
                "user": "u/WeakAd9656"
            },
            {
                "text": "Don't take off another man's hat",
                "user": "u/Ye3tm4n"
            }
        ],
        "processed": false
    },
    "1eyceg4": {
        "post": "what's something innocent you're hiding?",
        "body": "",
        "user": "u/hovelybeatmalls",
        "comments": [
            {
                "text": "I have a drawer in my bedroom with almost every card I've ever gotten. When I'm having a bad day I'll take a few out and read them. They're just the generic store ones but there's always a handwritten message and it's a nice reminder that at some point people have loved me.",
                "user": "u/TheCoolerL"
            },
            {
                "text": "Everytime i visit my gf, i hide a little money in her apartment.\nSometimes she calls me and is excited that she found some money at home.\n\nI earn a lot more than she does and she would never accept money, even if she really needs it",
                "user": "u/sexyhairynurse"
            },
            {
                "text": "I have a old co-worker that went on disability years ago and we are friends on social media. A very kind and generous person who got unlucky. Whenever they post about something they are looking for on market place, I send it to them from Amazon. It ain't much but it makes me happy. I hope it makes them happy.",
                "user": "u/laclair1000000"
            },
            {
                "text": "i hide snacks like they’re treasure?? gotta keep my secret stash safe from roommates who snack attack me when i’m not looking",
                "user": "u/violettagaia"
            },
            {
                "text": "When my father passed away, I was tasked with finding all of his business documents on his computer. \n\nHis last ten unsent emails were asking me for advice on leg exercises when he gets out of the hospital bed.",
                "user": "u/Krijali"
            },
            {
                "text": "i secretly have a stash of vintage comic books that i tell no one about",
                "user": "u/SexyxRae"
            },
            {
                "text": "I have a collection of old concert tickets I never show anyone.",
                "user": "u/angel_sparkles"
            },
            {
                "text": "I'm not happy, I'm just friendly",
                "user": "u/ElleSter52"
            },
            {
                "text": "I secretly love 'bad' pop music when I'm alone, it's a guilty pleasure that makes me happy. Anyone else have an embarrassing musical taste?",
                "user": "u/ShiningSassafras"
            },
            {
                "text": "I have to make eye contact with my cats as I close the door to my place when leaving. They are my sons and I: 1. Want to make sure they’re solid before I go. 2. Tell them I love them 3. Take a visual snapshot in my mind that all is well at home so that I can revisit it whenever I need to settle my OCD.",
                "user": "u/newellz"
            }
        ],
        "processed": false
    },
    "1ez1kaa": {
        "post": "Men of reddit, what little things do women do that you really appreciate?",
        "body": "",
        "user": "u/bavelpazy",
        "comments": [
            {
                "text": "Random hugs or physical affection. It's nice to feel wanted.",
                "user": "u/ResearchDisastrous38"
            },
            {
                "text": "My girlfriend told me once, \"I can't solve every problem, but I know I can always be here for you when you need help.\" Really made me feel supported and loved.",
                "user": "u/Big-Routine222"
            },
            {
                "text": "My wife told me I looked good in my shirt today. I've been on the moon all day",
                "user": "u/TheRealOcsiban"
            },
            {
                "text": "I really like how they exist I mean it’s like the bare minimum but it’s pretty nice that they exist",
                "user": "u/itsahex"
            },
            {
                "text": "When your sitting down next to her & she places her head on your shoulder and smiles",
                "user": "u/steezyx94"
            },
            {
                "text": "When they remember small details about my day or surprise me with my favorite snack",
                "user": "u/xPrettyLadyxx"
            },
            {
                "text": "Random act of cuddles like scratching your head while driving",
                "user": "u/Mission-Army2142"
            },
            {
                "text": "You guys are making me feel like I want to be in a relationship again, you are so sweet",
                "user": "u/Just_Chair_2681"
            },
            {
                "text": "There are lots of them, but today my dearly beloved came up behind me as I was sitting at the kitchen table and just kinda bent down and hugged me from behind and just stayed that way for a bit.",
                "user": "u/SnoopsBadunkadunk"
            },
            {
                "text": "Put in so much effort for us even when sometimes we're just not worth it",
                "user": "u/Civil-Contract3908"
            },
            {
                "text": "The look they give you that let's you know, you are their whole world.",
                "user": "u/sjwoodwalker"
            }
        ],
        "processed": false
    },
    "1eyuxw9": {
        "post": "What song seems to always make you cry?",
        "body": "",
        "user": "u/TruthBeWanted",
        "comments": [
            {
                "text": "Lord Huron- the night we met- it’s like being frustrated with falling in love",
                "user": "u/bradharri"
            },
            {
                "text": "The scientist",
                "user": "u/Acciosab"
            },
            {
                "text": "Somewhere Over the Rainbow/What a Wonderful World medley - Israel Kamakawiwoʻole \n\nWind Beneath My Wings - Bette Midler",
                "user": "u/BraveDragonfly1848"
            },
            {
                "text": "I will follow you into the dark \n\nGot me a good man and I sure would follow him into the dark 🥹",
                "user": "u/ArtoftheEarthMG"
            },
            {
                "text": "Adagio For Strings by Samuel Barber.  One of the most beautiful pieces of music I've ever heard.",
                "user": "u/Fessy3"
            },
            {
                "text": "Face Down - Red Jumpsuit Apparatus\n\nPlayed a lot on the radio when I was leaving an abusive relationship, definitely scream cried this song in my car a bunch. Still makes me weepy years and years later.",
                "user": "u/Sensual_Muse"
            },
            {
                "text": "i get hit hard by fast car by tracy chapman like every time?? it’s like a emotional rollercoaster without the seats tho...",
                "user": "u/omixtaliay"
            },
            {
                "text": "Father and Son by Cat Stevens destroys me",
                "user": "u/MirthfulGlow"
            },
            {
                "text": "I first heard the song \"If I Die Young\" by the Band Perry driving home from work a few days after my wife had miscarried. I had to pull over to the side of the interstate, I was crying too hard to see the road.",
                "user": "u/CyclopeanBifocal"
            },
            {
                "text": "Somewhere only we know - keane\n\nThe other woman - lana del rey",
                "user": "u/CharmingGaze2"
            }
        ],
        "processed": false
    }
}