{
    "1et6rgd": {
        "post": "What's something that no matter how it's explained to you, you just can't understand how it works?",
        "body": "",
        "user": "u/n0dust0llens",
        "comments": [
            {
                "text": "Space, it's so big that it is unfathomable and I think it's expanding?! Into what? How did it start? It's all a mindfuck ",
                "user": "u/VVinstonVVolfe"
            },
            {
                "text": "Electricity.",
                "user": "u/pvtguerra"
            },
            {
                "text": "How airplanes can be so big and heavy and fly",
                "user": "u/TangyCornIceCream"
            },
            {
                "text": "How my cat always knows exactly when I’m about to sit down with a snack",
                "user": "u/Gracelovey12"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Magnets. Don't understand how they have that physical force locked up in them. Seems to break the laws of physics or something. I don't trust them",
                "user": "u/minnesota2194"
            },
            {
                "text": "Quantum mechanics. No matter how many times it's explained, the idea that particles can exist in multiple states at once or influence each other instantaneously across vast distances just feels like nature's most elaborate inside joke that I'm not quite in on.",
                "user": "u/jane66x"
            },
            {
                "text": "**The stock market**.\n\nHow can it be possible for the value of an item to change so drastically? I understand supply and demand, but the large flunctuations are amazing.",
                "user": "u/britishmetric144"
            }
        ],
        "processed": true
    },
    "1ew56dj": {
        "post": "What difficult truths, the sooner you accept them, the better your life will be?",
        "body": "",
        "user": "u/Rare_Can_5418",
        "comments": [
            {
                "text": "That some people won't like you. And sometimes for no reason.",
                "user": "u/PurahsHero"
            },
            {
                "text": "There will always be someone better looking, better educated, younger, more experienced, more intelligent or wealthier than you. Do your best, live without regret, have empathy and kindness, give when you can, expecting nothing in return.Focus on your heart value more than what others have.",
                "user": "u/Realistic_River_868"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "You can do your best with someone and still be the villain in their story.",
                "user": "u/gathee"
            },
            {
                "text": "There are many things that are out of your control.",
                "user": "u/ChicodePolonia"
            },
            {
                "text": "This is more of a saying, but I feel it helps shed light on a few things: \"we judge ourselves by our intentions. We judge others by their actions.\"\n\n\nIOW people are going to look at you for what you do and your intentions are mostly irrelevant.",
                "user": "u/Knight_Owls"
            },
            {
                "text": "you can only help people who actually want it. If they’re not ready to change or put in the effort, there’s not much you can do. Realizing this can save you a lot of frustration and help you focus on people who actually appreciate your help",
                "user": "u/GoldenGlimmer2"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Just because you're right, doesn't mean people will agree with you and might work against you either way.\n\nMy wife struggles with this.  She has an idea that works and gets the company more money, but the owner and other workers are against it because they disagree with it.  Even with the evidence that it works better for them financially.  \n\nAll the data in the world won't change the mind of a person who won't listen.",
                "user": "u/outerproduct"
            },
            {
                "text": "Things are just things. They don’t have feelings. They don’t care if you give them away or sell them or throw them out. If a thing is useful, keep it. If not, get rid of it.",
                "user": "u/bowlbettertalk"
            },
            {
                "text": "You can’t change the past, but you can decide what to do next.",
                "user": "u/SexyAngelbabe012"
            }
        ],
        "processed": true
    },
    "1eryhlk": {
        "post": "What’s a social habit everyone seems to accept but you find really annoying?",
        "body": "",
        "user": "u/spacewalkerstarfield",
        "comments": [
            {
                "text": "When people don't understand that listening is the most important part of the conversation.",
                "user": "u/mrp0013"
            },
            {
                "text": "Not everything has to be filmed.",
                "user": "u/CraftyAttitude1321"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "People congregating in doorways, particularly when there is plenty of non-doorway space available",
                "user": "u/Oil8524"
            },
            {
                "text": "people who stop in the middle of a busy walkway to check their phones. it's like they think they've hit pause on the world.",
                "user": "u/NotBeginningAnew"
            },
            {
                "text": "Kids blasting whatever TV show on their iPads in the middle of a restaurant while I’m trying to eat. The kids can watch whatever but somebody teach them to use headphones.",
                "user": "u/SecretProgramor"
            },
            {
                "text": "Filming strangers. It's one thing if you're just taking a holiday snap or something and there's people in the background but actually pointing your camera at strangers without consent solely for the purpose of making videos of them to post online is not cool. I get it's legal to do so in most public places.",
                "user": "u/beesandsids"
            },
            {
                "text": "Being expected to be constantly available via social media chat, text, call at any & all hours. If you try to ‘opt out’ it’s seen as weird or antisocial.",
                "user": "u/p0ndfaerie"
            },
            {
                "text": "Being on your phone while having an in person conversation with someone. Like hello, I’m right here not in your screen!",
                "user": "u/Hot_Potential_5732"
            }
        ],
        "processed": true
    },
    "1euru0m": {
        "post": "What dead celebrity would absolutely hate their current fan base? ",
        "body": "",
        "user": "u/DrunkenSkunkApe",
        "comments": [
            {
                "text": "Confucius. \n\nHe'd walk around all day saying, \"I DIDN'T SAY THAT\"",
                "user": "u/NorwalkAvenger"
            },
            {
                "text": "Alexander Hamilton would be very, very confused.",
                "user": "u/DomingoLee"
            },
            {
                "text": "Sir Arthur Conan Doyle.\n\n“WHAT DO YOU MEAN SHERLOCK HOLMES IS STILL POPULAR!?!”",
                "user": "u/StanDaMan1"
            },
            {
                "text": "Nietzsche. In fact, I would guess a lot of philosophers would feel frustrated with how badly they have been reinterpreted.",
                "user": "u/allmybadthoughts"
            },
            {
                "text": "Probably Frida Kahlo. I don’t think she’d be a huge fan of her likeness on everything from socks to the side of an apartment building I saw the other day.",
                "user": "u/andreaxtina"
            },
            {
                "text": "Nikola Tesla",
                "user": "u/artesre"
            },
            {
                "text": "Bob Marley",
                "user": "u/Adorable-Writing3617"
            },
            {
                "text": "George Carlin. He gets quoted by people who he’d despise.",
                "user": "u/Waste-knot"
            },
            {
                "text": "Marilyn Monroe would despise the Tumblr girls who use that fake quote \"if you can't handle me at my worst\" that she never actually said",
                "user": "u/dauntless91"
            },
            {
                "text": "Hunter Thompson would take a 5 minute glance around and shoot himself again.",
                "user": "u/Aggressive_Day2839"
            },
            {
                "text": "George Carlin would absolutely abhor seeing some of these people quoting him",
                "user": "u/nickl104"
            }
        ],
        "processed": true
    },
    "1eukjes": {
        "post": "Men of reddit, what is a 100% myth about men? ",
        "body": "",
        "user": "u/booksmylove",
        "comments": [
            {
                "text": "Thinking someone is attractive is not the same as wanting to sleep/pursue a relationship with someone.",
                "user": "u/antlerpanda"
            },
            {
                "text": "You can change something about me that I don’t want to. ",
                "user": "u/maddieterrier"
            },
            {
                "text": "We’re all car fanatics. I don’t know a thing about cars",
                "user": "u/pizzagamer35"
            },
            {
                "text": "We're fine..",
                "user": "u/Trick-Possesion684"
            },
            {
                "text": "I'm not \"babysitting\" when I'm with my daughter; I'm being a father.",
                "user": "u/Caradepacman123"
            },
            {
                "text": "That men don't want or need compliments. That men don't cry. That men have to \"man up and deal\" with hard things. That men prefer to pursue over being pursued.\n\nMen crave all the same emotional/mental stimulation that is generally associated with women, society just tells us we shouldn't want or need them.",
                "user": "u/WoWLaw"
            },
            {
                "text": "Erections are not consent.",
                "user": "u/bobbery5"
            }
        ],
        "processed": true
    },
    "1etu6ic": {
        "post": "What's hard about dating you?",
        "body": "",
        "user": "u/Routine-Award-3382",
        "comments": [
            {
                "text": "i'm terrible at opening up and communicating about my needs.",
                "user": "u/Realistic-Cow-3140"
            },
            {
                "text": "I create delusional scenarios in my mind",
                "user": "u/Puzzlehead_k"
            },
            {
                "text": "When I have a bad day I don't want to talk to anyone. I don't want to be helped either. I just want to exist in silence for a while",
                "user": "u/SenhorSus"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Dealing with my low self esteem",
                "user": "u/UselessAndUnlovable"
            },
            {
                "text": "Sometimes I need extended periods alone.",
                "user": "u/Missgrumpy00"
            },
            {
                "text": "I don’t love myself yet.",
                "user": "u/No-Mind5337"
            },
            {
                "text": "I don't talk when I'm angry. I always need some time before I can open up what's my problem.",
                "user": "u/Unlikely-Ad-2855"
            },
            {
                "text": "My anxiety",
                "user": "u/Haunting-Employ3307"
            },
            {
                "text": "I am told I can't accept someone's own different way of love. That I only know and understand one way, and not appreciate or acknowledge other ways",
                "user": "u/cold_conclusion8147"
            },
            {
                "text": "I enjoy my time alone very much.",
                "user": "u/Charlie_NLG"
            }
        ],
        "processed": true
    },
    "1ert1mo": {
        "post": "What’s the worst thing an american president has ever done?",
        "body": "",
        "user": "u/TheAXCLord",
        "comments": [
            {
                "text": "On a personal level?\n\nGrover Cleveland groomed his wife from infancy.  He met her when she was a literal baby, bought her baby gifts through her childhood, and when her father died (she was 11) Cleveland became her formal guardian.\n\nThe girl's mother actually thought that Cleveland was courting her as an eligible widow, but that notion was quickly dissuaded when Cleveland's attentions were almost entirely directed at her daughter.  \n\nThey were married 10 years later, when he was 49 and she was 21.",
                "user": "u/Milocobo"
            },
            {
                "text": "Andrew Johnson’s undermining post-Civil War Reconstruction has caused cumulative and enduring damage to the United States. Measured in terms of the immensity and duration of harm he is the worst not just by miles, but by galaxies.",
                "user": "u/Chispacita"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Probably that native American ethnic cleansing Andrew Jackson did.",
                "user": "u/Sleepy_Senju"
            },
            {
                "text": "Andrew Jackson- Trail of Tears. Case closed.",
                "user": "u/chakrablockerssuck"
            },
            {
                "text": "Using chemicals like Agent Orange in Vietnam was really horrendous",
                "user": "u/Shifisu"
            },
            {
                "text": "IIRC Andrew Jackson killed a lot of Indians. Like, a lot.",
                "user": "u/LeavesOfBrass"
            },
            {
                "text": "Andrew Jackson's trail of tears",
                "user": "u/Bardlie"
            }
        ],
        "processed": false
    },
    "1etfes3": {
        "post": "[Serious] What was said, that forever changed your relationship with someone?",
        "body": "",
        "user": "u/YoungJack23",
        "comments": [
            {
                "text": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies.\n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
                "user": "u/AutoModerator"
            },
            {
                "text": "About a year into our marriage and after I had moved across the world for them and left everything I’d ever known: “the more I get to know you, the less I like you.”\n\nI am ashamed to say it took 3 more years before we were done.\n\nEDIT:\nI did NOT expect this comment to blow up! Was pretty buzzed when I originally posted it, too, so here’s some edits/updates.\n\n- It took 4 more years, not 3.\n\n- He made the decision to call it quits… which makes me feel even more ashamed, in a way. However, after the first days of just complete shock, I felt incredibly free. His decision forced me to give up on the idea that somewhere deep inside of him he still had a resemblance of the man I fell in love with.\n\n- I did of course let him know that his comment really hurt my feelings. He just doubled down on why he felt that way and why he had a right to tell me.\n\n- Only afterwards did I realize the kind of abuse this man put me through. It is almost impossible to recognize it while you’re in the midst of it, especially when it escalates so gradually.\n\n- To everyone replying with your kind comments: thank you so much! It has been just over a year and I am indeed thriving now :) And he definitely is not.\n\n- To everyone who is in a similar situation: it may seem overwhelming and impossible to get out. It may feel like it’ll be the hardest thing you’ll ever do. Just know that it will NEVER be harder than staying.",
                "user": "u/fitnessnfrenchfries"
            },
            {
                "text": "In my late 20s I was thinking about going to college, but I was afraid I was too old. Someone said to me, \"Next year you will be older.\" I applied the next day.",
                "user": "u/Cosimia1964"
            },
            {
                "text": "My mother told me that she believed that I hate her while I was at her house giving her money because she needed help to get through the week. I can still feel the hole that statement left in my heart.",
                "user": "u/P0ncle"
            },
            {
                "text": "My father said \"yes I know and I don't support you.\" (I will never forget those words) when I told him that I filed a police report on the man who molested me as a child. \n\nHe didn't even look like the same man to me the next time I saw him.",
                "user": "u/billymackactually"
            },
            {
                "text": "For 3 years, someone and I worked together side by side and developed a close friendship. One day I got promoted to manager and became his boss. He threw a tantrum and screamed for hours, then refused to talk to me (Now his boss) for three days.\n\nWhen I finally scheduled a one on one meeting, he told me \"My sole job now is to make it clear they made the wrong decision. It's in my best interest to make sure that you fail.\"\n\nI tried for about a month to make it work, but eventually he had to be let go.\n\nThat was the end of that friendship.",
                "user": "u/muscledhunter"
            },
            {
                "text": "My mom was dying. A friend told me \"you have your whole life to freak out about this-- *don't do it in front of her.* \"\n\nIt really helped me to understand that my feelings are not always what's important. It IS possible to delay a freakout, and that skill has served me innumerable times.",
                "user": "u/SweetheartAndSin"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "I was in the car with my dad, I was about 40, and he said “Out of all my children, you are the most intelligent, but also the greatest disappointment “. Just out of the blue, like he was talking about the weather.",
                "user": "u/CartographerKey7322"
            }
        ],
        "processed": false
    },
    "1euo85k": {
        "post": "Brits of Reddit, now that it’s been a few years, has Brexit been a success?  Why or why not? ",
        "body": "",
        "user": "u/accountname789",
        "comments": [
            {
                "text": "Brexit destroyed my online business. I got a lot of orders from Europe. Brexit went through.  Now they have to pay import fees that they never had to pay before and then eventually VAT that they never had to pay before.   \nThey didn't want to pay all of that extra stuff so they stopped ordering. My sales went down, down, down until I had to close my shops.",
                "user": "u/jaime4brienne"
            },
            {
                "text": "Brexit has:\n\n- Increased queues for Brits at airports in Europe as we must now be subject to additional checks and have our passports stamped. It has also limited stays to 90 days in 180. \n\n- Reduced opportunities for people from England, Scotland and Wales to live, work, study and retire freely across our own continent. Northern Irish citizens retain these benefits since they can apply for an Irish Passport. \n\n- Contributed to labour shortages in key industries such as hospitality, farming, health and social care DESPITE record levels of immigration from the rest of world. \n\n- Added administrative bureaucracy for importers and exporters, widening our trade deficit and reducing business investment and foreign direct investment.\n\nFor any Brit who wishes to…\n\nLive in the EU*, \nWork in the EU,\nStudy in the EU,\nTravel for longer than 90 days in the EU,\nExport to the EU,\nImport from the EU \n\nThings are definitely, objectively, worse.\n\n*EU/EEA",
                "user": "u/Known_Cheesecake2036"
            },
            {
                "text": "Brexit was probably the biggest influence on why my business ultimately failed.  \n\nGoods and supplies I needed became incredibly expensive to acquire from the EU. In some cases, my suppliers stopped shipping to the UK altogether.\n\nAnd for me to ship my goods in the other direction into the EU, it became more expensive and complicated to deal with.\n\nI lost a massive chunk of business and all of the convenience of trading in the EU overnight.\n\nSo I'm my eyes,  Brexit is a complete failure",
                "user": "u/darth-small"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "One of the reasons people voted for Brexit was to stop immigration. Last year we had 700k net migration. Doesn't sound like a great success to me.",
                "user": "u/mymokiller"
            },
            {
                "text": "Brexit assisted with the downfall of my business. So if you ask me, no.",
                "user": "u/Viazon"
            },
            {
                "text": "In terms of actual impact on a normal person, all Brexit has done for me is:\n\n- Makes it more expensive or difficult to buy things from Europe. Lots of places now won't even do UK shipping.\n- Makes it more difficult to travel to Europe\n\nIn my jobs\n- In the hospital lab, we had a big old hoo-ha because all our equipment is provided by Roche, which is a swiss company and all the stuff we buy has to move through Europe. \nThere was a brief period where a warehouse moved that caused us to be unable to provide blood tests for anything but the most urgent cases. There was additional faffing about with German companies over import taxes and such that caused us a shortage of other materials. All sorted now, but it was a tense few months. \n\n\n- At the university lab, in addition to above difficulties with suppliers, getting kicked out of the EUs Horizons program lopped a huge amount of funding out from British science. Numbers of EU students have also dropped, so now because of the drop in funding  our financial department is cracking down hard. \nThis leads to ridiculous situations like having to go get 3 alternative quotes for a piece of machinery that is only manufactured by a single company, even when your grant is specifically for that machine.",
                "user": "u/Hayred"
            },
            {
                "text": "Depends\n\nThose who voted brexit to reduce immigration are disappointed that it has only deterred EU migrants who are mostly white and nominally christian and that migration from other places has been unaffected\n\nThose who voted brexit because they believed the side of a bus that said there'd be more money for the NHS are disappointed to see much more money than that spaffed away by Truss and Kwarteng or syphoned off to give to politicians and their cronies\n\nThose who voted brexit because of \"Brussels bureaucrats\" were never able to properly explain what they meant by that anyway. \n\nThen there's those like that fella from Wetherspoons who supported brexit for reasons known only to himself and has seen his business hit by the lack of cheap euro labour. They aren't particularly happy.\n\nBut those who promoted and voted brexit to dodge european measures against tax avoidance or because they saw opportunities to get rich at the expense of the british tax payer, well some of those ones are happy.",
                "user": "u/DripDry_Panda_480"
            },
            {
                "text": "Migration from other places has greatly increased: legal migration has trebled and illegal migration up 10x. Our withdrawal from the Dublin convention has meant that we can no longer return illegal migrants to the last EU country they passed through.",
                "user": "u/azw413"
            },
            {
                "text": "I think it says a lot that Farage, Johnson etc al aren't shouting about how they made it happen any more.",
                "user": "u/watchman28"
            },
            {
                "text": "Speaking as someone from Northern Ireland, Brexit has done two good things for us: The Windsor Framework which keeps us under some of the EU Rules and allows us to trade in both the UK and EU markets which makes us a prime spot for investment and it has also speed up the talk of a United Ireland as well",
                "user": "u/Lie_Diligent"
            }
        ],
        "processed": false
    },
    "1ety0a0": {
        "post": "What worrisome trend in society are you beginning to notice?",
        "body": "",
        "user": "u/[deleted]",
        "comments": [
            {
                "text": "Ads in the comment section",
                "user": "u/PatheticGirl46"
            },
            {
                "text": "Believing all the advice given in tiktoks or instagram videos without doing any research\n\nEdited to add: Reddit, Facebook, podcasts. Literally all social media platforms.",
                "user": "u/Sufficient-Citron936"
            },
            {
                "text": "Total lack of awareness of other people, see it on the roads, in supermarkets etc. People have become zombies, or selfish",
                "user": "u/stever71"
            },
            {
                "text": "Media literacy seems close to nonexistent.",
                "user": "u/Talismato"
            },
            {
                "text": "Lack of critical thinking",
                "user": "u/Shadow948"
            },
            {
                "text": "People believing everything they see on social media.",
                "user": "u/ImaginationMajor5062"
            },
            {
                "text": "everyone is so mean ☹️",
                "user": "u/apresonly"
            },
            {
                "text": "The quality of education going down",
                "user": "u/TeodoroCano"
            }
        ],
        "processed": false
    },
    "1evkcrp": {
        "post": "What is a thing that isnt taken seriously but it actually should?",
        "body": "",
        "user": "u/Ilove_gaming456",
        "comments": [
            {
                "text": "Stress",
                "user": "u/No_Angle875"
            },
            {
                "text": "The current state of education. \n\nI realize that yeah it's a big topic but it feels like it's brushed off so quickly as like \"welp what can you do?\"",
                "user": "u/anonymooseuser6"
            },
            {
                "text": "Dental hygiene",
                "user": "u/Carl-99999"
            },
            {
                "text": "Constant pain in your body. It be taken seriously to avoid more complications in the future. You never there could be an underlying condition with those pains.",
                "user": "u/SweetGirlCutie"
            },
            {
                "text": "Shopping addiction. It sounds crazy until you deal with it.",
                "user": "u/JuggernautScary7026"
            },
            {
                "text": "Collapsing insect populations",
                "user": "u/downvotedbylife"
            },
            {
                "text": "taking breaks seriously can actually boost productivity and well-being",
                "user": "u/SnowGamerJourney70"
            }
        ],
        "processed": false
    },
    "1es5iph": {
        "post": "What are signs that you might not be as attractive as you believe?",
        "body": "",
        "user": "u/Waste_Cup7237",
        "comments": [
            {
                "text": "Target checkout cameras.",
                "user": "u/HiVi48"
            },
            {
                "text": "Without info, people assume you're single.",
                "user": "u/UltimateWaluigi"
            },
            {
                "text": "You have to make a certain face when you look in the mirror.",
                "user": "u/Substantial-Rub1571"
            },
            {
                "text": "ive straight been told by an ex,  \"you aren't hot enough to be this much of an asshole\"    So that I guess.",
                "user": "u/iceplusfire"
            },
            {
                "text": "Nobody looks at you or acknowledges you. If you don’t insert yourself into social situations you aren’t seen unless someone needs something from you.",
                "user": "u/Mr_Mediator"
            },
            {
                "text": "Always being told you look tired",
                "user": "u/passthedrink"
            },
            {
                "text": "Feeling like a ghost.",
                "user": "u/beccacee"
            },
            {
                "text": "You hear, “there’s somebody out there for everyone” a lot",
                "user": "u/Zahfier"
            },
            {
                "text": "people just don't pay as much attention to you",
                "user": "u/cumwithmehunny"
            },
            {
                "text": "automatic doors never open for you.",
                "user": "u/rainbowroobear"
            }
        ],
        "processed": false
    }
}