{
    "1eoumi9": {
        "post": "I manipulated my husband to get what I want. ",
        "body": "I manipulated my husband to get what I want and he doesn't know it\n\nI told my husband I was going to pet sit to make some extra money but that wasn't the entire truth. I've been wanting another dog since our last girl left us and our kids have been begging for another dog but my husband didn't want one for the time being (maybe in 5 years he said) I purposely went for clients with the cutest goodest boys to make my husband think he wants a dog. I played it perfectly and my plan seemed to work because he texted me he wants a dog after I've only been watching this couples dogs for 4 hours. I manipulated him so we could get a dog and I feel guilty but I think some good came of this. We will adopt a dog giving them a good life but at the same time I did play at his heart strings to.get what I want..",
        "user": "u/PrettyInHotsauce",
        "comments": [
            {
                "text": "Well... this is not really manipulation. \n\nManipulation would have been to pretend you want to petsit, but in reality buy the dog, pretend that you are just petsitting it, and them guilt tripping him to adopt him.\n\nWhat you did was barely show him in the right direction. He, by himself, told you he wanted a dog. Clearly he wanted one. You didn't coerced him.",
                "user": "u/IrrelevantManatee"
            },
            {
                "text": "Not the story I expected reading the title lol. Yes, you manipulated him, but it's harmless imo.",
                "user": "u/Queen_of_Meh1987"
            },
            {
                "text": "Humble brag",
                "user": "u/llmcthinky"
            },
            {
                "text": "Okay, the fact you feel bad about this is honestly so sweet. If you feel guilty, just be honest that you feel bad! Never change. You have a great heart!",
                "user": "u/None"
            },
            {
                "text": "A dog has a loving family. Kids have a dog!\n\nEnd justifies the means.",
                "user": "u/Poinsettia917"
            },
            {
                "text": "Meh not really my ex was definitely a manipulative like her mom, like her mom wanted a couch and her dad didn’t and she would “plant the seed to make him think he wanted it”",
                "user": "u/Co_Stang"
            },
            {
                "text": "\"Manipulated\" is a bit of a stretch. It's more like convinced. I think the lying is where you felt bad.. which is good! That means you want to be more honest with your spouse. If you truly feel guilty, maybe come out of him? He'll probably laugh it off, but I dont think you need to beat yourself up for it. Judging by this post, you don't sound like a nonempathetic narcisist to me, so I doubt this was in any way manipulation.",
                "user": "u/virtual_xello497"
            },
            {
                "text": "People manipulate each other all the time, this is a harmless one..giving a home to a cute pooch is very light...",
                "user": "u/EricamacSG1"
            },
            {
                "text": "Yeah it's manipulative BUT there's one aspect here I don't think want to be overlooked: his own grieving process\n\nI think you've helped him with that in a way that wasn't foreseen by anyone. It's one thing knowing to himself, that he'd be okay with another dog but to message you about it? \nIt's taken a lot of trust on his part and I am happy for him on that. \nI've lost pets before, so I well and truly know the feelings that come with it,  how to support family members through their own grieving periods, etc.",
                "user": "u/GlitteryCucumber"
            },
            {
                "text": "This is closer to….Inception",
                "user": "u/AndImenough"
            }
        ],
        "processed": true
    },
    "1eretfi": {
        "post": "Called my wife out on how what she said bothered me, she turned me into the bad guy. ",
        "body": "I told her I’m up and down emotionally at the moment and struggling. \n\nShe then told me I have Asperger’s (I don’t but even if I did, it shouldn’t be thrown around like an insult because it isn’t) because I kept wandering around trying to occupy my mind. \n\nI called her out.\n\nShe apologised for being a bad person with a very sarcastic tone. Now she is avoiding me. ",
        "user": "u/Appropriate-Tea1",
        "comments": [
            {
                "text": "Aspergers isn't even a condition anymore. Hasn't been since 2013.\n\nShe doesn't want to be wrong. If people aren't open to be proven wrong, then they're not worth arguing with. I'd just remain confident in your decision and let her mope.",
                "user": "u/an_actual_pangolin"
            },
            {
                "text": "Has it always been like this or is this new?",
                "user": "u/LaLunaDomina"
            },
            {
                "text": "Always been open, but either been blinded by love all the way along or maybe it’s just gotten worse?",
                "user": "u/Appropriate-Tea1"
            },
            {
                "text": "I’m sorry she is acting this way.\n\nIt may or may not work for you but my wife pulled a similar stunt last fall when I brought up some things I felt were pretty serious and felt unloved and disrespected.  \n\nI wrote it down, went into a lengthy explanation of what she actually said, what my responses were and how each made me feel.  It took me multiple days to write everything, proofread it and rewrite.  She did acknowledge that it was clear she had failed to be supportive and lot more than she realized and the one thing I had mentioned first made her feel attacked as a bad wife.\n\nMy response was that I didn’t feel that she was a bad wife but had recently become extremely focused on only what she wanted and ignored my feelings for months or more.  She has been working on being better but still fails and even when I say something today she gets defensive.\n\nShe has been in therapy for four years, she is better but not there.  As with everything in life, we are all works in progress.  Keep moving forward and keep fighting for your emotional needs.",
                "user": "u/N0b0dy-Imp0rtant"
            },
            {
                "text": "Guys: this is a PERFECT example of why guys should not talk about their emotions with romantic partners.  It will be used as a weapon AGAINST you.",
                "user": "u/FranciscoDAnconia85"
            }
        ],
        "processed": false
    }
}