{
    "1fapvgf": {
        "post": "I just got a crazy job offer!!!!! ",
        "body": "I feel I have to share my excitement so I don’t explode at work and give myself up before I put in my notice.\n\nI’ve been working at a company for about two months now and it has been absolutely dreadful in every single way. I work in retail management and this particular company could not be more awful. Last week I finally decided I was fed up. \n\nAfter a grueling 4 interview process over the last week I was just offered a position at a significantly better company for: \n\nA. $25,000 more per year base salary \nB. 30mins closer to my house \nC. In a much safer area\n\nAfter the most challenging year of my life, I can honestly say this is the win I needed to keep me pushing. I hope everyone has a great weekend, thanks for reading.  ",
        "user": "u/xoangieeeee",
        "comments": [
            {
                "text": "CONGRATS!!!\nThat’s awesome, I’m happy to see others are having luck!\nGo get em!",
                "user": "u/ClearwaterBeeRevival"
            },
            {
                "text": "Well done ☺",
                "user": "u/Whole-Ad7063"
            },
            {
                "text": "Wow! Congrats! Also, the first story on Reddit that I actually believe today. So it’s a win for me too!",
                "user": "u/Minimum-Award4U"
            },
            {
                "text": " Congrats!!!\n\nI'm scheduled for the 4th and final interview on Monday (what is it with these multiple interview processes nowadays?) with a company I really want to work for. Crossing my fingers I don't blow it!",
                "user": "u/Carriebeary8"
            },
            {
                "text": "Sounds like this could be me soon. Here’s to hoping. Congrats!!!",
                "user": "u/mayonnaiseplayer7"
            },
            {
                "text": "Congrats! :)",
                "user": "u/DoingJustOkay"
            },
            {
                "text": "Congrats. Don't let lifestyle creep get you and save for a yatch or pony.",
                "user": "u/CuriousOdity12345"
            },
            {
                "text": "I’m proud of you!!",
                "user": "u/BastilaShan___"
            },
            {
                "text": "Congrats!! I just got notified I’ll have an interview for a job with potentially a 50-60% pay increase. Canf wait to have that same feeling! Lol",
                "user": "u/Scoopity_scoopp"
            },
            {
                "text": "Bless 🙏",
                "user": "u/suprnovastorm"
            },
            {
                "text": "Congratulations, you deserve it! Have a great weekend!",
                "user": "u/samhouston84"
            }
        ],
        "processed": true
    },
    "1f7y5ru": {
        "post": "My entire family forgot my birthday, but I still baked my own",
        "body": "This year, I turned 30. My family has always celebrated birthdays, so I expected at least a text or a call. Instead, I got radio silence. I thought maybe they were planning a surprise, so I didn’t say anything. I even baked my own cake, thinking they'd show up. But now it’s 10 PM, and I’m sitting here, staring at an untouched cake, wondering how I became so invisible to the people I love most.",
        "user": "u/LilyCupTea",
        "comments": [
            {
                "text": "I’m not sure if it would make it better but could it be that your parents, sister and brother Mark didn’t forget (but are assholes nonetheless) and are simply still not speaking to you over the money theft and wedding celebration attendance?\nIn other words, while it definitely sucks it was already a strong possibility they wouldn’t reach out.\n\nHappy birthday anyway!! Enjoy your cake, share it with ie. neighbours or colleagues?! Definitely focus on other people that can give you the kindness you deserve.\n\nEdit: they also didn’t say anything during the family dinner last night? That’s rough…",
                "user": "u/sprxce"
            },
            {
                "text": "You posted 3 weeks ago that you are 27. Which story is made up?",
                "user": "u/NotWeird_Unique"
            },
            {
                "text": "Happy birthday OP!!\n\nSo sorry! \n\nPost a picture with the cake and a caption that says: happy birthday to me! \n\nBirthday hug from a total stranger.",
                "user": "u/RikkeJane"
            },
            {
                "text": "I’m sorry OP. Happy birthday from this internet stranger!!",
                "user": "u/Sewlividyesyarn"
            },
            {
                "text": "Sorry to hear OP, happy birthday from another internet stranger. Go and eat that cake!",
                "user": "u/Imaginary-Mirrorball"
            },
            {
                "text": "Happy birthday 🎂🎉🎊✨ I’m sorry they forgot.",
                "user": "u/wortcrafter"
            },
            {
                "text": "Wait a minute, on your previous post 21 days ago you said you were 27 years old and now all the sudden you're 30? At least make your bait post a bit more convincing next time 😂",
                "user": "u/Sorpez"
            },
            {
                "text": "just 21 days ago u said dat u were 27?\n\nany whos Happy birthday!!",
                "user": "u/CH33KC14PP3R96"
            },
            {
                "text": "Why at 30 years old, would you sit around waiting on anyone to make you special for your own birthday? You don’t have a job and money to take yourself out for your own birthday? This is the craziest thing I’ve ever heard of.",
                "user": "u/Sasha_Stem"
            },
            {
                "text": "Happy birthday darling! I'm so sorry, you enjoy your cake! 🤍🤍",
                "user": "u/AicylaB"
            },
            {
                "text": "happy birthday OP",
                "user": "u/Downtroddengaijin"
            }
        ],
        "processed": true
    },
    "1fbec48": {
        "post": "I love my newborn niece so much that it feels like it hurts",
        "body": "My sister gave birth on Thursday, and I have been crying every time I see her baby or pictures of her baby.\n\nI have never wanted children of my own, but this little human... I cannot express how much I already love her. It feels like it physically hurts, like something is sitting on my chest.\n\nI cannot wait to be part of this little human's life, I am crying tears of super joy! I just had to share my happiness with the world, even if only 3 people sees this.\n\nPS - my sister does not think it's weird I love her child so much already. She is the first grandchild in our family, and my first time becoming an aunt. I am overjoyed, happy, and my heart feels so full of love 🥹",
        "user": "u/jazz_snake_69",
        "comments": [
            {
                "text": "Write down a letter for your niece about how you’re feeling. I bet she would love to read it when she’s older and knows how much you’ve loved her from the beginning.",
                "user": "u/MaddTheSimmer"
            },
            {
                "text": "Congratulations!",
                "user": "u/nanatella22"
            },
            {
                "text": "Congrats! I'm a childfree auntie to a niece of 18 months. It's the best!",
                "user": "u/Grr_in_girl"
            },
            {
                "text": "That's such a sweet post. Congratulations on becoming an aunt :)",
                "user": "u/kosedyret"
            },
            {
                "text": "Congratulations! I have my own child, but felt the same way you do now with my two nieces and nephew. There was just something about my younger sister and brother having their own children that hit me differently. Enjoy all the baby snuggles because they grow up so fast. 🩷",
                "user": "u/Jessie_D_83"
            },
            {
                "text": "Oh man, it's the baby rabies! I am two children and very definitely DONE but I swear I feel my ovaries twitch if I see and/or hold a tiny newborn. Just avoid looking at newborn sized clothes for too long and it will pass.",
                "user": "u/TheLyz"
            },
            {
                "text": "Oh look, your niece will adore you too. My dad has an aunt who passes as her second mother and his own mother was the same for his cousins. Wish you to have a wonderful life with your family.",
                "user": "u/25vega25"
            },
            {
                "text": "I didn't think so many people would actually react! Thank you for every comment, I appreciate you all so much! 💕",
                "user": "u/jazz_snake_69"
            },
            {
                "text": "I’m a child free aunt to a 4 year old nephew and an 18 month old niece. I love them both with all my heart. Being an aunt is the best!!",
                "user": "u/cptmorgue1"
            },
            {
                "text": "I became an aunt almost exactly one year ago and I GET IT!! My sister is also thrilled I’m so obsessed with her. I just returned from living abroad and been spending some weeks with them and it’s amazing seeing her already have soooo much personality, seeing how good of parents my sis and BIL already are… lean into the obsession, these little babies will benefit so much from it !! (And we will too!)",
                "user": "u/NoPrize8864"
            },
            {
                "text": "I was you with my bothers kids. The aunt role is just so cool and fun. Enjoy it!",
                "user": "u/MobilityTweezer"
            }
        ],
        "processed": true
    },
    "1f81a36": {
        "post": "I’m getting married!",
        "body": "I don’t really have a whole lot of people to tell because my family sucks, but IM GETTING MARRIED! I’m so excited, it’s going to be small, no one but us. I feel so at peace",
        "user": "u/Throwaway-marriedg",
        "comments": [
            {
                "text": "Congratulations!!! This is huge and I hope you enjoy married life!! Enjoy the preparations, celebrations and everything else that comes with it!!",
                "user": "u/Double-Explanation35"
            },
            {
                "text": "Edit : we bought everything from dollar tree\n\nWe did the same.\nIt was worth it!\nNo drama but all happiness.\nWe bought a house with all savings",
                "user": "u/Strawberry-Dense"
            },
            {
                "text": "So happy for you 💕💕congratulations!! Throw me your virtual bouquet so I can be next!! Hah",
                "user": "u/justrainalready"
            },
            {
                "text": "Congratulations 🎊",
                "user": "u/alikhaz_is"
            },
            {
                "text": "Congrats!!! How exciting! 🥳🥳🥳",
                "user": "u/CookieLady94"
            },
            {
                "text": "Congratulations 🎉",
                "user": "u/Zestyclose-Royal-922"
            },
            {
                "text": "HAPPY FOR YOU",
                "user": "u/donteverbotherme"
            },
            {
                "text": "Congratulations, OP! I wish you all the best <333",
                "user": "u/skywaIkr"
            },
            {
                "text": "Congratulations!!!",
                "user": "u/Traditional-Tea-6045"
            },
            {
                "text": "Congratulations!!! Peace above all else is everything. Best wishes to you and your as you embark on a new journey together.",
                "user": "u/Feisty-Albatross-287"
            }
        ],
        "processed": true
    },
    "1f7rlhn": {
        "post": "I hate owning a Tesla ",
        "body": "When I bought my car Elon was starting to be weird, but I didn’t think much of it. Turns out he’s just another elitist fascist who doesn’t care about anyone but himself. \n\nI hate getting in my car everyday even though it was the best financial move I could have made when I bought it. If I could change my car without taking a financial hit, I would do it in a heart beat. \n\n",
        "user": "u/StoveTopBurnerAkount",
        "comments": [
            {
                "text": "Do you like the car itself? If so, enjoy it for what it is and don't worry about the owner of the company. I drive a Ford and never give a thought to the fact that Henry Ford was also a fascist.",
                "user": "u/berninbush"
            },
            {
                "text": "What prevents you from buying a used gen 2 Prius.  I bought mine for $7000 with 55,000 miles on it.  Talk about great financial move.",
                "user": "u/Free_Speech_1234"
            },
            {
                "text": "Good luck finding a virtuous billionaire car company owner who you agree with 100%",
                "user": "u/Agreeable_Chance9360"
            },
            {
                "text": "If you trace anything you use in your day-to-day life, it’ll probably end up somewhere you don’t like.",
                "user": "u/pool_party820"
            },
            {
                "text": "Try getting yourself one of those anti-Elon Tesla club stickers",
                "user": "u/SaltyCrabbbs"
            },
            {
                "text": "Surprise all rich are basically facists. If they weren't they would have done something more helpful with their wealth, not just kept making the number bigger.....\n\nYou will save a ton of cash on maintenance and fuel, don't worry about who one of the bosses is cause he has name recognition. \n\nI have two Tesla's and know what youean, but just shrug your shoulders and move on with life. It ain't worth the energy to think about it.",
                "user": "u/ItsGermany"
            },
            {
                "text": "Elon was forever a POS",
                "user": "u/XAEA29"
            },
            {
                "text": "He didn't start being weird in the last decade.  You just didn't notice.",
                "user": "u/Fleiger133"
            }
        ],
        "processed": true
    },
    "1f939gz": {
        "post": "I'm having a pity party ",
        "body": "So I lost 40 pounds in 2.5 months.  By the end of this month, I'm hoping to hit 45.  It's under doctor supervision. I've gone from size 20 jeans to 16. Lost inches everywhere. From a 3xl to an XL. \n\nNo one has noticed except my husband.   And I'm just disappointed. I don't even know why.  I feel better,  that  should be enough.  \n\n\nEdit::: all of you have been so kind to me. Made some really good points and made me feel seen. I feel even more motivated! Thank yall for taking the time out of your day to make me feel better 💓 ",
        "user": "u/breadloaf2425",
        "comments": [
            {
                "text": "As someone in the flip side of this- I had a bunch of people make inappropriate comments to me at work and I lost my weight partially because of cancer. Most people you see daily don’t notice until well over 20 pounds and sometimes it takes longer, but also I gained immense satisfaction from saying stuff like “thanks it’s the cancer” when men I didn’t know complimented me on it. They might just be considerate because people like me have shamed them in the past.\n\nCongratulations on your progress! Keep doing what you’re doing- you’re doing awesome!",
                "user": "u/CrazyInAGoodWay224"
            },
            {
                "text": "I think this is a good thing actually.\n\nIt could be that nobody has noticed but it’s equally as likely that people do notice but people rightfully are keeping their opinion, comments, and observations to themselves.\n\nI am constantly teaching my kids that we don’t comment on anyone’s body. Even if you think it’s positive, you keep it to yourself. If the person wants to discuss their body with you, they can be the first one to bring it up. \n\nIf you want to give people an opportunity to comment / acknowledge, you can being it up in a proper context and say something (in context) like “I’m feeling so much better lately. I’ve been doing a new diet / exercise plan that’s been working really well for me and I can tell my health is improving”",
                "user": "u/Affectionate_Many_73"
            },
            {
                "text": "I have lost almost 60 lbs in 6 months. I didn't tell my husband that I was trying to lose and he didn't notice until I was 30 lbs down. No other friends mentioned anything, even now. If it comes up in conversation, they will say that they had noticed but didn't want to mention anything. \n\nInitially, I was hurt. Then, I thought about it and decided that I'm okay with people not commenting on my weight. They didn't mention it when I slowly gained the weight and they aren't mentioning it when I slowly lose it, either.",
                "user": "u/Parade_your_Crazy"
            },
            {
                "text": "i'm so proud of you!\n\nhave you changed your style or anything? sometimes it can be hard to notice, or some people are nervous about saying something. either way, i'm sorry no one has noticed and congratulated you. you deserve better.",
                "user": "u/Small_Frame1912"
            },
            {
                "text": "I think society is conditioned not to offend anyone, this includes discussing body image. \nThe owner of the company I was with had made a rude comment about “obese people” I voiced my concern as I was in the room (and obese) and his response was “well obviously not you” ohhh right just all the other obese people 🙄 it’s hard to not take things personal.",
                "user": "u/bgj48"
            },
            {
                "text": "Honestly people could be noticing but afraid to say something. I had a girl I work with lose about 80lb and I didn't say anything to her specifically because I didn't want to offend her as if I was monitoring/watching her weight loss progress. I also wasn't sure if she lost it due to medical reasons. So if you're losing a lot of weight in a small amount of time that could be the case.  If she had brought up a diet or eating healthy or exercising then I would've come right in and told her how awesome she looked, but she was super quiet about it so that also made me hesitate.",
                "user": "u/peaches9057"
            },
            {
                "text": "Maybe people are finally getting the message that they shouldn’t comment on anyone’s body, which would be good news. Congratulations on your success and also for surrounding yourself with people with good manners!",
                "user": "u/Kip_Schtum"
            },
            {
                "text": "I never comment on anyone’s weight. I never know what’s going on, maybe they have an eating disorder, or are going through chemo, and I don’t want to put my foot in my mouth by praising them for losing weight.\n\nPlus I had a friend who lost a bunch of weight and everyone told her how great she looked and it made her feel like she must have looked awful before. She unfortunately regained the weight later and those comments made her feel like everyone must secretly be thinking she looks terrible.\n\nAll that to say people may have noticed your weight loss but don’t feel it’s appropriate to comment. And that’s not necessarily a bad thing. I did have a coworker who was losing tons of weight and I didn’t say a word. She then mentioned in casual conversation that her doctor had started her on ozempic and she was so happy to be losing weight. I then felt comfortable congratulating her and talking over different clothing styles that might look great on her new frame. So it’s possible that if you open the conversational door that you are doing this safely and are happy with your progress that people will be more comfortable chatting with you about it.\n\nRegardless, congratulations and be proud of what I’m sure was a lot of hard work. I wish you health and happiness in your own skin!",
                "user": "u/jmoo22"
            },
            {
                "text": "“Hey I’ve noticed you’ve been putting on a bit of weight recently” Doesn’t sound so good does it?\n\nThey would be told it’s none of their business and rightly so.\n\nIf you want compliments stick to family.",
                "user": "u/Ok-Inflation4310"
            },
            {
                "text": "Some people notice they just don’t know what to say. I wouldn’t take offense. Also, people are in their own little worlds these days. Congratulations on your milestone!",
                "user": "u/denmargia"
            }
        ],
        "processed": true
    },
    "1f7fx1q": {
        "post": "Does anyone regret not commiting suicide? Cause I do.",
        "body": "I feel like so many say how they're glad they didn't do it because now their life is so great but I can't relate, I wish 14 year old me did it instead of waiting 😅 with how my life went after its definitely not worth it ! Now im too religious to do anything since i'm scared of hellfire lol. Some will say its a good thing, but I don't think so. (And pls don't recommend therapy, idc and it won't help) \nAlso, a lot their family hold them from doing it, they don't wanna make them feel sad and don't wanna do this to their parents but then to me when I try to give hints to my mom, she roll her eyes. So I dont think it truly really matters if i attempt or not.",
        "user": "u/RoyalRuby_777",
        "comments": [
            {
                "text": "I was in your shoes before, even spent some time in the sick ward. Believe me, you can find your purpose and calling in life. Fight, don't quit. \n\nP.S. I know it sounds mundane, just trying to help",
                "user": "u/Critical-Log8745"
            },
            {
                "text": "All the time. A lot of people say it’s selfish and cowardly. I think it’s more selfish and cowardly to expect someone to stay for your benefit than go for their own.",
                "user": "u/fearwanheda92"
            },
            {
                "text": "Same here! Everyday I feel like tomorrow is gonna be better but it's keeps getting worse and more painful everyday. I feel like I'm only hurting myself more and more by delaying ending my life. Life does not get better. Nothing makes me happy and I'm a coward for still being alive.",
                "user": "u/CheapAssistant4289"
            },
            {
                "text": "The mystery of tomorrow is always worth living to see. Whether it's a new band that comes out and you fall in love with, or you discover a hobby you never knew about with a community of supporters, or simply a new tv series or movie comes out that you adore. \n\nI'm sorry to hear that so far, life has continued to bring you pain, but know that the future holds endless possibilities, many of which you may not even be able to fathom at the moment. \n\nSending you all the love in the world, and I hope you're able to bring yourself to love this little life we have, even if only for selective brief moments at a time. \n\nMuch love homie💙",
                "user": "u/Koala-teas"
            },
            {
                "text": "I tried, but i.m still here and i'm glad cause i bought a New computer and juste finished Alan wake 2, it was awesome. I just try to do something that makes me happy everyday, i'll die one day so it's ok.",
                "user": "u/Graveyardess"
            },
            {
                "text": "Hey, idk what you’re going through but I’m currently struggling with a lot in my life and have suicidal thoughts often. I may not know exactly how you feel but I know how much it sucks to be in that place and not know what to do and feeling so lost and alone. I sincerely hope things get better for you though and feel free to reach out and message me even just to vent",
                "user": "u/Netsrikelyob"
            },
            {
                "text": "ALL THE TIME",
                "user": "u/KNZuckz"
            },
            {
                "text": "Honestly scared of hellfire too but idk what to do anymore",
                "user": "u/flwrqss"
            },
            {
                "text": "I should have done it shortly after the birth of my second child so basically a decade ago. The kids would have forgotten me by now, husband would have moved on and had a worthy wife who isn't an alcoholic anxious mess and who keeps a nice house and who would be great with the kids.",
                "user": "u/amiableshrimp"
            },
            {
                "text": "yes. i promised myself i was gonna do it when i was 13. that never happened and i felt guilt, so i said 15. never happened either. now im doing a bit better, but when i reach a low point, it gets lowwww. and to this day, my biggest regret is not going through with it.",
                "user": "u/lisheavenly"
            }
        ],
        "processed": true
    },
    "1fd4q6b": {
        "post": "My GF chooses to teach on a secluded Indian reservation, and today she won against some disgusting allegations.",
        "body": "This wretch of a woman accused my GF of \"flirting\" with 3rd graders, because she tells them they're smart, loved, and that they \"look nice today\".\n\nThese are kids that live in poverty we can't imagine, and show up with lice and bedbugs daily.\n\nI'm just overwhelmed right now that she stood up to this shrew, and the superintendent and board of directors supported her. She can now excecute her IEPs properly, and the teacher can't block it anymore. ",
        "user": "u/MuricaAndBeer",
        "comments": [
            {
                "text": "Your GF is a hero.",
                "user": "u/mindymadmadmad"
            },
            {
                "text": "Good for her! This is the kind of teacher all children need, and exactly who these underprivileged children deserve",
                "user": "u/Canuckistanian71"
            },
            {
                "text": "She’s amazing. You need to make sure she really knows this. I’ve been in these communities for years and the only thing that’ll help is more people with more of the love she has. Break the cycle",
                "user": "u/wilderCu"
            },
            {
                "text": "My partner grew up on a reservation and went to school there. His stories werent pretty or happy *at all*, not even about school. Your gf is the hero these kids need. One good adult like that sometimes makes all the difference for a child. The living conditions/home life usually arent fun there :/ she gives them something to look forward to and brighten their day at school. Giving children affirmations boosts confidence and that does wonders to help along their education itself.",
                "user": "u/GobboChomps"
            },
            {
                "text": "I'm sensing a huge projection energy from that woman accusing your gf.",
                "user": "u/geoffkreuz"
            },
            {
                "text": "Yay!!! I’m so glad those kids have her",
                "user": "u/Extra-Hand-9705"
            },
            {
                "text": "Your girlfriend is a rock star! She puts her kiddos first and isn't backing down! This is exactly what the kids are in desperate need of! ",
                "user": "u/Craftyandtired70"
            },
            {
                "text": "Yeah there's a lot of this stuff that goes on in the teachers unions, educators are cut throat and they treat their industry like any other bureaucracy or corporate buissness. They just want the next seat up so they can propell their own brand of education, and frankly it's sick.",
                "user": "u/crowsteeth"
            }
        ],
        "processed": true
    },
    "1fd3uds": {
        "post": "Cheated on",
        "body": "4 months ago, my best friend told me he slept with my partner of 8 years, 4 years prior.\n\nShe was my fiancée when he told me, and we were due to get married 3 months after he told me. \nI decided to go through with the marriage, without really having time to properly digest how I felt. \n\nI can't talk to anyone about how I feel. The couple of friends I spoke to about it think I'm fine, and happily married. \n\nI can't talk to anyone about how I feel. I am not fine, I am utterly broken but trying to stay strong in the relationship. \nShe showed me she wanted this, and hates herself for what she did. \n\nI lost my best friend to this news, and \nHave never been the same with my, now wife, since. \n\nI don't know what I want, I have a few days away this week alone, pondering whether I made the right choice and if I still want it. I love her, and we get on great, but it kills me a little everyday.\n\nI feel betrayed, but it was 4 years ago. How was I supposed to react...\n\nDon't expect any replies but thank you for reading.",
        "user": "u/Hefty-Wafer4770",
        "comments": [
            {
                "text": "I’m sorry that happened to you. Trust your gut on what to do, but don’t waste years of your life feeling this way. It’s okay to leave and start over with someone you can trust 100%",
                "user": "u/daylightem"
            },
            {
                "text": "It was 4 years ago for them, but 3 months before your wedding for you.\n\n\nBe kind to yourself, use the time away to think and follow your gut. You definitely deserve better than how they both treated you!\n\n\nBest of luck OP",
                "user": "u/Ash-b13"
            },
            {
                "text": "Can I ask, why you decided to go through with the marriage if you knew beforehand?",
                "user": "u/BlissyB716"
            },
            {
                "text": "No matter what you decide you need help to process this. It doesn’t matter if it was drunken ONS or a fully fledged Affair, the two people who were meant to watch out for your safety and wellbeing didn’t. In fact they by their choices made it worse. \nGet your self some professional help, the trying to stay strong work through it etc will just build up resentment, and eat away at you and bleed into other parts of your life. As you project pain and frustration onto other or situations that don’t deserve it. you could maybe reconcile your relationship with your wife and build a new and fresh marriage. But not till you fix this in you, and find away to come to terms with your feelings. ",
                "user": "u/armoury896"
            },
            {
                "text": "You made to wrong choice but it’s never to late to fix a past mistake.",
                "user": "u/C1sko"
            },
            {
                "text": "I would have not gotten married if I was you but it is too late for that. \n\nHowever, it doesn't matter if it was 4 years ago. This is more than her cheating on you. They both lied to you for 4 years. That is a whole lot of betrayal. \n\nI am not saying you can't move past cheating but you jumped into marriage without addressing the issue. She can say she is sorry but that doesn't make it go away. The two closest people to you cheating. To me there is no greater betrayal.\n\nIf you truly want to make this work, go to couple therapy ASAP.",
                "user": "u/Potential_Ad_1397"
            },
            {
                "text": "Just read my reply, u don't need to answer as you said. Life is meant to be happy and enjoy ourselves, we have so much time to live and it's limited, there's no starting over. If it kills you so much, then brother... just let her go. Find someone who you truly love, it's one thing to get along and it's another to love each other. What your wife did was an act of disrespect towards you. If you think this will affect you going on as you said, that you think about it each day then leave her and move on, take your time to reflect and when the time is right you might find someone else. If you want to stay with your wife, then speak with her and ask her to apologize If she hasn't already.",
                "user": "u/ChillGuy15423"
            },
            {
                "text": "Its over mate. Its one thing that she went and did it, but it's another that she never told you and you had to find out from someone else. You'll never trust her again, save yourself while you can. She's not the same woman you fell in love with.",
                "user": "u/Stray-7"
            }
        ],
        "processed": true
    },
    "1fc9lby": {
        "post": "I'm on vacation. ",
        "body": "I proposed to my fiance two weeks ago after getting a ring custom made despite my hardware store salary. My 32nd birthday was last week and now I'm in my home town that I miss VERY MUCH on a genuine vacation. Hit my cousins wedding on my favorite beach and now I'm lounging for the first time at a spa near Napa before my first legit massage! \n\nI look back at the last ten years of my life and they were ROUGH. Many construction jobs, homelessness, debts, depression, drug abuse...and here I am...alive, engaged, employeed and making moves that I only wished I could. \n\nJust wanted to share some positivity. :) Thanks for reading. ",
        "user": "u/BreathOfFreshWater",
        "comments": [
            {
                "text": "Thats pretty amazing , i hope your entire life is filled with moments like this",
                "user": "u/BidGroundbreaking483"
            },
            {
                "text": "Congratulations 🎈🎉",
                "user": "u/Sea_Anything8077"
            },
            {
                "text": "Positivity Wins Out!  Congratulations on your choices today!  ❤️",
                "user": "u/Glittering-Strike-44"
            },
            {
                "text": "That's awesome!! Makes me feel a bit better this isn't the end and things will get better. So happy for you!!",
                "user": "u/murphycs87"
            },
            {
                "text": "Congratulations on asking her, though you didn't say the response. \n\nHave fun and enjoy your time on vacation.",
                "user": "u/thequestison"
            },
            {
                "text": "How nice to hear that positivity!!!!!  \n☀️☀️\nHave a wonderful time on your vacation!!!!",
                "user": "u/Reasonable_Star_959"
            }
        ],
        "processed": true
    },
    "1fdjrx9": {
        "post": "Just paid off all my dept ",
        "body": "So to start I am only 21 years old. When I was 17 my dad cheated on my mom and got a kid with another woman. That hit me so hard because I had the feeling I just lost my dad because he only cared for her and not for me and my sister. So to overcome the feeling I started to buy stuff to take my mind of the situation. So because of that I would spend my whole salary on items I don’t neet. Because I was spending all my money and was a student I was in like 10k of debt. Today i paid everything off and I am going to stop spending to much money. I made a budget of all my expenses and from there I will look what I can spent te extra money on. Just wanted to tell someone this because i feel good for the first time ever",
        "user": "u/Unusual-Truck-1229",
        "comments": [
            {
                "text": "Congrats! That‘s a huge achievement!",
                "user": "u/Fluid_Diamond_3938"
            },
            {
                "text": "Proud of u man",
                "user": "u/Camm_north"
            },
            {
                "text": "Congratulations!! Being responsible with money is a GREAT lesson to learn early and will help you for the rest of your life. I'm proud of you! Remember, \"stuff\" isn't love. Find free ways to give yourself the love and care you definitely deserve.",
                "user": "u/yeah_so_"
            },
            {
                "text": "Congrats! \nFind other healthy ways to deal with your emotions so next time you go through something you don’t resort back to seeking happy chemicals from shopping (or eating)",
                "user": "u/ameenaacid"
            },
            {
                "text": "It feels like the sun is brighter, the air is crisper, the clouds are under your feet. What an accomplishment. This mom is so proud of you!",
                "user": "u/mmom4428"
            },
            {
                "text": "That’s amazing! You did that! Congratulations 🥳",
                "user": "u/otonyeCann"
            },
            {
                "text": "2k left for me! Congrats brother",
                "user": "u/Every_Ad4447"
            },
            {
                "text": "Good for you! Put that cash away for a rainy day!",
                "user": "u/4legsandatail"
            },
            {
                "text": "nicee",
                "user": "u/Hot-Site-1572"
            },
            {
                "text": "Congrats! Having a budget is such an important thing, and I'm glad you've taken the time to do that at such a young age. You'll be pretty well set if you stick to it. Way to go!",
                "user": "u/Gumby_Grown-Up"
            },
            {
                "text": "Congrats!! Now move that debt payment into savings!!",
                "user": "u/Ok_Recover_5226"
            }
        ],
        "processed": true
    },
    "1fammuy": {
        "post": "Being pretty is too much work.",
        "body": "I have to buy a bunch of skincare products, get regular haircuts, shave/wax my entire body and face, get manicures, get pedicures, wear makeup, style my hair, buy nice shoes and clothes… its exhausting. But if i don’t do all of that then i’m not considered pretty. ",
        "user": "u/em837",
        "comments": [
            {
                "text": "If those things make you feel beautiful, then more power to you. But if you are doing them for others, it may not matter as much as you think. Truly genuine people likely do not even notice half of what you do. I stopped wearing makeup, and it has been one of the best decisions I made. I became more approachable and feel even sexier in my natural face. I believe self-esteem and confidence are two very different things. It sounds like you may be struggling with self-esteem, and feeling pretty gives you confidence. Maybe finding other ways to feel confident could be a good first step. Good luck, and you are beautiful, I mean it.",
                "user": "u/Greylady9231031"
            },
            {
                "text": "Then don’t do it. Problem solved.",
                "user": "u/EddyCI8"
            },
            {
                "text": "Consider yourself pretty regardless of people’s opinion and you won’t have to worry about this",
                "user": "u/travelerlifts07"
            },
            {
                "text": "I don't do anything I don't wanna. I feel pretty for me, not society.",
                "user": "u/namnamnammm"
            },
            {
                "text": "I turned 40 and stopped caring about others. I do what I want. I maintain my own health which includes good skin/body/hair care. I do it all for me. My skin has never looked better and my hair may be greying, but it's so healthy.",
                "user": "u/red_sekhmet"
            },
            {
                "text": "you should remember that you really dont need all these things to be pretty. If it is too much work for you, stop doing it and please look after yourself and give yourself a break. Your self respect is much more important than other peoples opinions about you",
                "user": "u/crusty-potat"
            },
            {
                "text": "There is nothing as beautiful as natural beauty.",
                "user": "u/orindragonfly"
            },
            {
                "text": "It's frustrating to feel the pressure to maintain such an extensive beauty routine just to be considered attractive. Unfortunately, society often places a heavy emphasis on appearance, even subconsciously. The way someone looks can influence how they’re perceived by others. For instance, if you see someone with yellow teeth, unkempt eyebrows, or a poorly maintained beard, you might unconsciously assume they don’t care about their hygiene. Similarly, the way people dress can shape others’ assumptions about who they are. In many ways, appearance does play a significant role in how we’re judged and treated, even if it’s exhausting to keep up with.",
                "user": "u/AlternativeTree3283"
            }
        ],
        "processed": true
    },
    "1fagcze": {
        "post": "I saw an instagram reel with a kid, and the comments made me sick to the stomach.",
        "body": "It showed a girl who was literally around 5 years old eating pizza and there were so many comments sexualizing her. Some of the comments were disguised as memes and jokes, but there were a few that were actually explicit. What blows my mind is that many of them were from people with regular profiles with profile pics and stuff, and they were not afraid of outing themselves as pedos? And Instagram did not bother to take down the comments either? There were literally 100s of comments on it, and it scares me that those are people with regular lives outside the internet.",
        "user": "u/Nyx1010",
        "comments": [
            {
                "text": "It's gross and it's common. Keep calling it out for what it is. People get away with stuff when no one says anything.",
                "user": "u/Mexicanperplexican"
            },
            {
                "text": "Were they all men?",
                "user": "u/Campfire77"
            }
        ],
        "processed": true
    },
    "1fbj5gt": {
        "post": "Do you ever wish you didn't have to wake up?",
        "body": "Not die. Just. Sleep for days on end and hope you wake up feeling like a person again. ",
        "user": "u/Abducted_by_neon",
        "comments": [
            {
                "text": "Being able to hibernate through the winter to avoid the seasonal depression/anxiety would be nice lol",
                "user": "u/Badmouths"
            },
            {
                "text": "Everyday. My dream set up is an MRI pod. I wish you could just sleep in there and turn yourself off.",
                "user": "u/demilovato97742"
            },
            {
                "text": "I would love to just sleep at least 4 hours straight through",
                "user": "u/wtfameye"
            },
            {
                "text": "Only a few times a month...",
                "user": "u/croatoan88"
            },
            {
                "text": "All the time. Sometimes I wish I could sleep without aging for 100 years and wake up with everything and everyone gone, but I know I’d regret it, and regret missing their life stories unfold.",
                "user": "u/hedgehoghodgepodge"
            },
            {
                "text": "everyday",
                "user": "u/SavingsWin8169"
            },
            {
                "text": "Only every time I wake up. And all the rest of the hours of the day.",
                "user": "u/effingusername123"
            },
            {
                "text": "Every single day",
                "user": "u/spritz_bubbles"
            },
            {
                "text": "Weekly..",
                "user": "u/Marriednotdeadd"
            }
        ],
        "processed": true
    },
    "1fadlni": {
        "post": "I wish I could be a teenage girl forever",
        "body": "I know it sounds so silly, but I'm in my last year of high school and I am realizing a lot of things. I've started thinking of all the people I'll never see after this year ends, of the fact I will never be a teenager again and the fact that I'll need be act grown and responsible. I hate the thought of my worries going to taxes and bills; I wish I could worry about outfits, relationships, drama, and all the other superficial things. \n\nI don't wanna grow up and be an adult. Adult life seems so depressing and serious, I just wanna have fun and think about the stupidest thing. I wanna go to school only to sleep in the lessons and listen to gossip, I don't wanna get up early and work in a society that doesn't even care about me. It's just so fun to not have to worry about everything yet: no jobs, no taxes, no stress. I just wanna live and be silly forever. \n\nI wanna be pampered by mom and pretend like every minor event is the end of the world. \n\nI wanna talk about relationships and gossip with my friends.\n\nI wanna go to parties and make bad decisions.\n\nI wish I didn't have to grow up.",
        "user": "u/Unstable_Weeb01",
        "comments": [
            {
                "text": "I’ve noticed this happening with teens today and it’s so sad. When I was 16 all I ever did was dream of being in my 20s, out on my own, calling the shots and living my life. Now I hear more and more kids talking about how they want to stay teenagers forever, it’s wild.",
                "user": "u/MysteriousPineapple9"
            },
            {
                "text": "> I wanna go to parties and make bad decisions.\n\ngood news, this doesnt stop unless you make it!",
                "user": "u/No_Share6895"
            },
            {
                "text": "You still have so much time to do everything you want to do. The fun in life doesn't have to end just because you've reached \"adulthood.\" To many people, you are still a child, so let yourself be one! The hard parts of adulthood will eventually grow to be normal for you, but I understand that it's scary now. I know it seems like it's the end of world but it's not. In fact, there's so much out there for you to still experience! There have so many people I've met and absolutely amazing opportunities/experiences I've had as a young adult that I'm grateful for. All of them are things I only got to experience because I'm an adult, because I grew up a bit. I just wanted to tell you that the things that scare you about starting adulthood won't scare you as much once you've actually lived through it a bit. Life can be very, very hard, yes, but I hope you have friends and family that can help you along the way too when you're struggling, when the fear of the future becomes too much. Have hope for yourself. If things aren't how you expected them to be, the good thing about growing up is that you have more power to change things, to make your life how you see fit. But you only have that power if you let yourself embrace that change. \n\nThere's still so much more to life than all your fears for the future. Let yourself explore, make mistakes, party, and do all the things you want to do. That's what this period of your life is for. \n\nSorry for the long reply but this is something I was actually thinking about recently, as I wrote a \"letter to my past self\" a couple weeks ago.",
                "user": "u/tiredddd1"
            },
            {
                "text": "i'm only 22 and have been an Adult adult since the year i was turning 20 so i'm not really that old either but my two (or... five >\\_>) cents are.. \n\n* everything you do as a teen is more or less something you can, and i'd argue most young adults DO do as adults, and sometimes even are expected to do while you're still getting the hang of things, lol. caring about drama and outfits and relationships isn't going to be drained from you the second you get hired to put food in bags, or what-have-you. \n* you are not going to only worry about taxes and bills, sure they'll be scary the first however-many times you do them, but then you get them done, you pay the bill, and you go right back to talking to your friends, or going out to eat, or watching your fave tv show. there are workaholics but imo i don't think most people are Working To Work and that's all their life is, they're working FOR their hobbies/other aspects of life; to go back home to their kids they love, to save up for that cool new bike, to keep playing world of warcraft every night they get home from work lol, etc \n* these things (jobs, taxes, bills, etc) *do not* take up your life and soul and personality and everything unless you WANT them to, it might feel like they will because it's new and it's a pretty big thing to learn and can be finicky, and it could take up all your focus/worries when you do them the first time, but once you've done them enough, it's just another part of life like school or deadlines or chores might be for you now. it's hard to explain, but i find the older you get, the like.. boundaries of your life get bigger? things that were unimaginable before are standard now, and new, even bigger things become something you have to learn, and the best part is you're (mentally??) big enough now that they aren't this giant horrific wall of \"how do i even begin\". \"it doesn't get better, *you* get better\" but in this case it's about just growing up and not necessarily personal improvement lol\n* also i'm pretty sure the \"all adults do is taxes\" etc is a joke in some capacity, and one that's harder to understand when you haven't been in those shoes for years and can laugh it off because Obviously we do other stuff, but it's annoying when we *do* have to do these!\n* basically, adulthood isn't that bad. and arguably i'd say it's easier because you have your own money to spend on the stuff you like, can make your own schedule ('oh i like working morning shifts cause i can spend the rest of the day doing ....', etc) instead of being bound to the same school as everyone else. there will still be You on the other side of adulthood, your personality and hobbies won't poof up in smoke the second you get there. and everything scary Now won't be half as scary the third, fifth, tenth time you do it. pretty much; it's still you, it's fine, AND you can spend 20 bucks at a fancy ice cream place now!",
                "user": "u/leoparduslatrans"
            }
        ],
        "processed": true
    },
    "1f9mnwx": {
        "post": "I Found Out He Cheated... But Now I’m the One Keeping a Secret",
        "body": "So, I just found out my boyfriend of 3 years has been cheating on me for the last few months. I was heartbroken, angry, all of it. I was ready to confront him, end things, and move on.\n\nBut here’s the twist: a few days after I found out, I realized I’m pregnant. Now I’m stuck between wanting to walk away and knowing that this changes everything. I don’t even know how to feel anymore.\n\nDo I tell him? Should I walk away and keep it to myself? Has anyone else been in this situation? I feel like I’m drowning in secrets and emotions",
        "user": "u/Amazing-Advice3925",
        "comments": [
            {
                "text": "When I'm overwhelmed, which I can only assume you are.\nI break it down into simpler chunks.\nAll we know from your current boyfriend is that he has cheated, broken trust and clearly has unresolved issues.\n\nSo here it is.\n\n1. Pregnancy;\nYou need to make a decision as a single entity.\nSo questions to consider;\nCan you keep this child?\nHow are your finances? Can you support it? How about emotionally? How big is your village? Will you receive help from friends and family? What are your life goals? Will this baby move you towards or away or neither?\n\nAfter you know where you stand and what you want. Then you can consider having a discussion with your boyfriend. But know always where you stand before an argument/negotiation/decision in your life.\n\nPregnancy always always changes the life of the mother more than the father. Do not underestimate it. \n\n2. Cheating:\nWhere do you stand in cheating? What is the context behind it ?\nSome individuals are black and white and don't tolerate any cheating. Others aren't, and sometimes, albeit rarely it can lead to couples therapy and overall relationship improvement.\n\nWhat do you want? That is the most important thing \nIt is your body and your relationship.\n\nHowever, realistically, it is highly unlikely that your boyfriend will step up for a child when he can't step up for a relationship.\n\nGood luck,",
                "user": "u/Main_Ad9550"
            },
            {
                "text": "Do you want someone's kid that does not give a s×it about you??",
                "user": "u/Parakiet20"
            },
            {
                "text": "Take STI first, then see if you want to keep the baby. If you do, tell him and dump him, if you don't, get rid of it then either tell him or dump him, or just dump him",
                "user": "u/throwaway_RA_777888"
            },
            {
                "text": "Do you want to have this pregnancy and can you afford it? You’ll be tied to your ex forever while he can pop in and out of the child’s life forever.  Once you tell him he will use it to control you and have people side with him.  People won’t care about you as a person but the ideology of a family for the kid.",
                "user": "u/Mountain_Monitor_262"
            },
            {
                "text": "Well, yes. Some person out there.\n\nIn the movies for sure.",
                "user": "u/observekink"
            },
            {
                "text": "I had my son. I left without a word moved across the country and let him know thru a court order. 13 years later and that kid is my everything.",
                "user": "u/MissHazelXo"
            },
            {
                "text": "Is this the 49 year old who is now 52?? Yeah leave! That gross and I’m 52",
                "user": "u/Sea_Anything8077"
            },
            {
                "text": "A very hard position to be in. You have multiple secrets: he doesn't know you know he cheated, he doesn't know you're pregnant, and obviously doesn't know what you are going to do about the whole situation because you don't know yet yourself.\n\nSo ask yourself: Can you see raising your child with him if you stay together?\n\nCan you see yourself raising your child as co-parents if you are apart?\n\nCan you send yourself raising your child without him involved?\n\nEventually, you will need to tell him you know he cheated, and either break up with him, or stay together if you both want that. Or you could just break up and not tell him you know, I guess.\n\nIf you keep the baby, you will have to tell him eventually, at some point he will figure it out unless you move away immediately.\n\nIt comes down to \"Do you leave him?\" If you do, tell him why. I would take the time to listen to his excuses, but only to gauge his ability to be responsible for his actions - if you co-parent, you will be depending on him a lot.\n\nAnd\n\n\"Do I have the baby?\" And that's a question only you can answer. If you want to be a mother, the answer is yes. If you don't,  abortion (if legal) or adoption are the alternatives.\n\n\nI hope that's helpful, I tend to ramble sometimes.",
                "user": "u/big_bob_c"
            }
        ],
        "processed": false
    }
}