{
    "1b9o6zf": {
        "post": "What is the safest answer when your girlfriend asks if her friend is hot??",
        "user": "u/PetiteAsianStarJoy",
        "comments": [
            {
                "text": "\"ive never looked at her like that before\"",
                "user": "u/JasmiineJewel"
            },
            {
                "text": "I literally start singing, \"I only have eyes for you.\"\n\nI'm a terrible singer.\n\nAfter two versus, the conversation is over, and she has left the room.",
                "user": "u/flossdaily"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Say....\"No....but she's an awesome kisser!\"",
                "user": "u/BruteForceOpinion"
            },
            {
                "text": "\"Yes, I would love you if you were a worm.\"",
                "user": "u/Kemintiri"
            },
            {
                "text": "“Yea. Why? You interested in her?”",
                "user": "u/panachi19"
            },
            {
                "text": "No hablo inglés.",
                "user": "u/BenjiGValue"
            },
            {
                "text": "In an overly enthusiastic tone, \"Why, did she ask about me?\" Can't lose.",
                "user": "u/demanbmore"
            },
            {
                "text": "An ex pulled this on me regarding her best friend. My response, “She’s alright, but her best friend is damn sexy.”",
                "user": "u/I_like_dwagons"
            },
            {
                "text": "not as hot as your mom.",
                "user": "u/rainbowroobear"
            },
            {
                "text": "Never thought about it, but did you know the Roman Empire roadways is the reason railway tracks are the size they are today?",
                "user": "u/Middle_Manager_Karen"
            }
        ],
        "processed": true
    },
    "1banzs6": {
        "post": "What do men think women like but they really don’t?",
        "user": "u/Man-Spider1",
        "comments": [
            {
                "text": "Driving stupidly with me in the car to try and show off. It’s an absolute no from me.",
                "user": "u/What___Do"
            },
            {
                "text": "When they play the clit like a banjo.",
                "user": "u/Cawaica"
            },
            {
                "text": "My ex seemed to think I was interested in hearing about the sex he had with women before me. No thanks, dude.",
                "user": "u/milkawhat"
            },
            {
                "text": "Showing off/flexing/comparing yourself to others in order to brag. Some guys think it makes them look cool, but it just makes them look insecure. ",
                "user": "u/Future-Technician937"
            },
            {
                "text": "Jack hammer fingering. Wtf are you doing?",
                "user": "u/Flibity_flobity"
            },
            {
                "text": "Being a “tough guy”…. Eg starting fights in public over shit that’s not worth a fight. You don’t look big and bad, just embarrassing",
                "user": "u/None"
            },
            {
                "text": "Fingering by literally ramming your fingers in and out of our pussy. Just no, please no. Unless you’re extremely wet, it’s going to hurt. The “luring move” on the other hand has a power over me that’s unmatched…\n\nLuring move explained: You put your two fingers inside and curl them upwards. You keep your hand steady (so no in and out movement) and then you apply pressure to the inside of the vagina by making a lurking move. It’s basically moving your two fingers towards you against the upper wall of the vagina repeatedly. For me personally, the faster the better. It hits the inner g spot and completely paralyzes my with pleasure. Many women swear by it. Thank me later ;)",
                "user": "u/AmelieMay00"
            },
            {
                "text": "Not taking no for an answer. Instead thinking they just need to try more until the answer changes.",
                "user": "u/vermillion55"
            },
            {
                "text": "Some guys seem to think I'll only respect them if they're the authority on *everything*, including my own hobbies and my very technical job. I know sometimes they're just being assholes, but sometimes it really does feel like they're conditioned to think they *have* to position themselves above me on every last little thing or I'll be put off. They get twitchy if they can't just totally circumscribe my experience and knowledge and intellect with their own.\n\nI somewhat sympathize, social conditioning is a hell of a drug, but goddamn. I don't want you to reassure my poor lady brain that I can turn to you for literally anything, I want you to stop \"correcting\" me about things I know more than you about.",
                "user": "u/nukeditagain"
            },
            {
                "text": "Unsolicited dick pics",
                "user": "u/Indigo-Waterfall"
            },
            {
                "text": "Alpha asshole personalities, like if they specifically say “I’m an alpha” and act like dicks. it’s the dumbest shit I’ve ever heard. Genuine, gentle, sweetheart guys are 100000 times more attractive than “I’m an alpha” douche bags.",
                "user": "u/Z_Bunny__"
            }
        ],
        "processed": true
    },
    "1bhrs61": {
        "post": "What’s a civilization ending scenario that most people aren’t aware of?",
        "user": "u/AlgorithmOmega",
        "comments": [
            {
                "text": "A slow-burn collapse is much more likely than a single major event to cause something major.",
                "user": "u/FatRascal_"
            },
            {
                "text": "As a kid I learned that if a gamma ray burst is coming right at us we really can’t do anything about it, we’d just get fried. Kept me up for a few nights.",
                "user": "u/JackC1126"
            },
            {
                "text": "Corn virus.\n\n20% of Human Civilization's calories, right there.",
                "user": "u/VoraciousTrees"
            },
            {
                "text": "Peak phosphorus: https://en.m.wikipedia.org/wiki/Peak_phosphorus\n\nIt’s an important resource for production of fertilizer and dwindling supplies could have a significant impact on global food security. Maybe an exaggeration to say that it would end civilization but it could be a contributing factor to a cascade of problems that have a devastating impact on modern civilization.",
                "user": "u/ThatPancreatitisGuy"
            },
            {
                "text": "A Gamma Ray Burst could fry our planet at any moment with 0 warning. Which means you should not waste time worrying about it because no one can do anything about it.",
                "user": "u/hielispace"
            },
            {
                "text": "The Big Rip is one of the most interesting possible ways for the universe to die because it happens on scales a human could meaningfully experience. You'd go from a perfectly functional solar system (in an endless void) to the End of All Matter in the span of a couple of months.\n\nFirst the planets drift away from the star, but you could survive if you have a way of producing heat.\n\nThen the planets and the sun explode as gravity can no longer hold them together.\n\nIf you're in a spaceship, you can survive for a few more minutes before your atoms are ripped apart by space itself.",
                "user": "u/IndigoFenix"
            },
            {
                "text": "I rarely see the media being concerned about water.",
                "user": "u/TalkingToTalk"
            },
            {
                "text": "I'm an archaeologist. Civilization isn't really used in the field anymore, but that's a different topic.\n\nMost cultures/societies don't really have a traumatic end date. They mostly just change or have new things that alter their cultural constructs or socio-political constructs. New ideas, inventions, innovations, attitudes, languages, external stuff going on, internal stuff going on, religious beliefs, etc. These can alter a culture pretty quickly without it being traumatic or even noteworthy.\n\nBut for something  huge that most people aren't aware of?\n\nAgricultural destruction of arable land. Often from irrigation in the past, but often it's just the soil \"wearing out\" (so to speak).\n\n[https://www.sciencedirect.com/science/article/abs/pii/S0013935120315966#:\\~:text=Arable%20land%20is%20facing%20the,characteristics%20and%20reshape%20microbial%20communities](https://www.sciencedirect.com/science/article/abs/pii/S0013935120315966#:~:text=Arable%20land%20is%20facing%20the,characteristics%20and%20reshape%20microbial%20communities).\n\nIt's something that happened a number of times in newly formed agricultural lands.",
                "user": "u/Vio_"
            },
            {
                "text": "Solar flare knocking out electric grids. Not only restarting them from a  black start is highly complicated, if the transformers are fried, there aren't enough replacements, and to manufacture more we need, you guessed it, electricity.\n\nThe estimations are that a solar flare on the level of  Carrington event, which happened not two centuries ago, would cause trillions in damages and set back civilization for decades.",
                "user": "u/Clear-Gas"
            },
            {
                "text": "The aliens finally coming back to harvest their livestock of humans.  \n\n\nEdit: My first comment to get over 1K, thanks all.",
                "user": "u/Majestic-Reception-2"
            },
            {
                "text": "There’s a fear that the trend of human body temp decreasing over time will expose us to more rates of fatal fungal infections. Most people are now less than 98.6 degrees F",
                "user": "u/adawnfire"
            }
        ],
        "processed": true
    }
}