{
    "1b9o6zf": {
        "post": "What is the safest answer when your girlfriend asks if her friend is hot??",
        "user": "u/PetiteAsianStarJoy",
        "comments": [
            {
                "text": "\"ive never looked at her like that before\"",
                "user": "u/JasmiineJewel"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Say....\"No....but she's an awesome kisser!\"",
                "user": "u/BruteForceOpinion"
            },
            {
                "text": "I literally start singing, \"I only have eyes for you.\"\n\nI'm a terrible singer.\n\nAfter two versus, the conversation is over, and she has left the room.",
                "user": "u/flossdaily"
            },
            {
                "text": "\"Yes, I would love you if you were a worm.\"",
                "user": "u/Kemintiri"
            },
            {
                "text": "“Yea. Why? You interested in her?”",
                "user": "u/panachi19"
            },
            {
                "text": "No hablo inglés.",
                "user": "u/BenjiGValue"
            },
            {
                "text": "In an overly enthusiastic tone, \"Why, did she ask about me?\" Can't lose.",
                "user": "u/demanbmore"
            },
            {
                "text": "An ex pulled this on me regarding her best friend. My response, “She’s alright, but her best friend is damn sexy.”",
                "user": "u/I_like_dwagons"
            },
            {
                "text": "not as hot as your mom.",
                "user": "u/rainbowroobear"
            },
            {
                "text": "Never thought about it, but did you know the Roman Empire roadways is the reason railway tracks are the size they are today?",
                "user": "u/Middle_Manager_Karen"
            },
            {
                "text": "\"Not my most challenging wank\"",
                "user": "u/Mr_Harsh_Acid"
            },
            {
                "text": "\"you have friends???\"",
                "user": "u/Hutchensin"
            },
            {
                "text": "i said \"I know where you’re going with this, and I absolutely refuse to have a threesome with your friend. I love you too much.\" how did i do ?",
                "user": "u/PetiteAsianStarJoy"
            },
            {
                "text": "You squeal like a little girl and shout \"Uuughhhh girls!?!\" And then shudder.",
                "user": "u/CabinetIcy892"
            }
        ],
        "processed": true
    },
    "1bfblld": {
        "post": "What's a dirty little secret that you know only because you work in the industry?",
        "user": "u/Eastern-Violinist-46",
        "comments": [
            {
                "text": "I worked at Alta sciences for a while. A preclinical testing facility. They tested the safe dosages of meds before human trials on rats, mice, dogs etc. \n\nThey like to say they do the best for the animals as the necessary evil sorta situation but the place is fucking abysmal. Painting over mold and literal shit, mold in ceilings, never fixing any machines and just expecting people to make it work, hiding bad procedures from visitors, not firing people who straight up kick the animals because they are leads. Taking away perks because higher ups made stupid decisions and we payed for it. \n\nIACUC, FDA, USDA also are basically useless as well since we got enough heads up to scramble a spit shine on the place. The stuff I reported only one change happened and that was cleaning the chemical barrel room. Also trying to report these things is a pain in the ass on top of it. \n\nAny actual \"fixes\" are the most half assed fixes made by someone who is not qualified in the slightest so it's just gonna break again. \n\nThere are people who genuinely want to do good by the animals and help push research to help people but corporate greed combined with burnout makes for a bad time. Also the pay sucks.",
                "user": "u/YesHomoBro2"
            },
            {
                "text": "I own a sign shop, and I can tell you with 100% certainly that almost all businesses fail within the first year. If you think you are going to open a restaurant or a boutique, you are about to lose a bunch of money. Also, no matter what business you want to start, go talk to your local sign guy and ask how many businesses have been in that location and failed.  Trust me, we know which locations are cursed.",
                "user": "u/windcalmer"
            },
            {
                "text": "The grad students teaching your classes sometimes have more direct power over your grade than your professor. Please be nice to us. Not even to get a good grade, just please be nice to us because we’re stressed and tired ",
                "user": "u/snartling"
            },
            {
                "text": "Enterprise Rent-A-Car buys their cars straight from the manufacturers at a price lower than dealerships get. After they rent them for a year, they sell them to the public at a price higher than they originally paid.",
                "user": "u/w0rx4me"
            },
            {
                "text": "There isn't a \"larger than normal call volume.\" We just don't have enough staff. \nAlso, your call is not important to us. We actually want you to go away.",
                "user": "u/ratdarkness"
            },
            {
                "text": "Work in large scale construction. Large developers effectively borrow on the credit of all of the smaller players who are their subcontractors. You have billion dollar companies asking smaller companies to pay for them with a promise to pay later. The larger the developer, the slower the process is to get paid. If a project goes bust, it's these small guys that get hit because all of the developers have LLC's that are project specific. No assets to speak of.",
                "user": "u/rotyag"
            },
            {
                "text": "I used to work in radio and we totally didn’t take caller 10. We maybe counted 1-6 and then sorted through the callers until we found an excited sounding voice that fit the target demographic.",
                "user": "u/theinternetisnice"
            },
            {
                "text": "I work in the medical field. This isn't really about my field exactly but an adjacent field: health insurance. There is a guy reviewing our notes looking for reasons to deny a claim. The guy reviewing generally has no clinical knowledge whatsoever, but they are looking for certain key works so they can stamp the \"denial\" on the claim. For this reason, I will omit certain things on the clinical notes if it isn't directly applicable to what I am treating because I know from experience that they will use that word as in indication that the proposed treatment is \"inappropriate\" and therefore denied.",
                "user": "u/StrebLab"
            },
            {
                "text": "As a cybersecurity consultant I can tell you many, many companies I have worked with are a “when” they are hacked, not a “if” they are hacked.\n\nSome orgs have people in charge of cybersecurity that barely know how basic protocols and technologies work.",
                "user": "u/BlackHoleRed"
            },
            {
                "text": "There are TONS of buildings out there that don't meet code.  Even new construction.  Inspectors either don't care, don't know the code or don't even bother to inspect in the first place.\n\nOn the plus side, building code is extremely over-conservative, so if you get \"close\" it's probably safe.  Maybe.  Most of the time.  Except when it's not.  And then everyone gets sued.",
                "user": "u/bailout911"
            },
            {
                "text": "Car part manufacturers know that aftermarket sellers (local repair shops but also DIY places like Autozone) don't have the testing capabilities like OEM manufacturers, so will sometimes ship them questionable and/or outright defective parts.",
                "user": "u/ammon-jerro"
            },
            {
                "text": "When journalists want to get back at people they quote them exactly instead of cleaning up their grammar.",
                "user": "u/wheeler1432"
            },
            {
                "text": "I’m in insurance\n\nIf you call to request an estimate for a claim, they will count it as a 0 dollar claim on your file when they deem the damage not enough to repair. That means when another company pulls your information it will not only impact your future rates, but might make you ineligible for future policies\n\nDon’t ever call insurance for an estimate first, get a third party inspector to tell you whether you should file with insurance.",
                "user": "u/Appathesamurai"
            },
            {
                "text": "This one is fairly well known, but I'm just confirming its truth as some one that used to work in a factory.\n\nThe brand you buy doesn't always matter. Sometimes it's all the same stuff that comes out of the same vats, but just labelled differently and sold at different price ranges.",
                "user": "u/Twat_Womble"
            },
            {
                "text": "I am working at a sports club with way over 2000 members and I can tell you, you might sign some paper about data security and how we handle data, but believe me, your data will go places you dont want it to go.",
                "user": "u/LaughGreen7890"
            }
        ]
    },
    "1bozkxb": {
        "post": "What habits of girls did you only find out about when you got a girlfriend/wife?",
        "user": "u/PerceptionMain7258",
        "comments": [
            {
                "text": "Anything that comes in a mini size is called cute.\n \nMini bullet = cute\n\nMini Machete = cute\n\nDoesn’t matter what it is as long as it’s mini.",
                "user": "u/Thementalistt"
            },
            {
                "text": "Women have a million black hair ties and also none.",
                "user": "u/HoboBaggins008"
            },
            {
                "text": "My wife pulls on the toilet paper like she's trying to start a lawn mower.",
                "user": "u/deadbass72"
            },
            {
                "text": "Similar to cats, they naturally gravitate to the warmest parts of the house.  It might be the cozy chair, a heated blanket, or the section of the bed that I was just laying in.  I'm honestly not sure if she loves me or just my excess heat (and I'm honestly OK either way)",
                "user": "u/catherintheWry"
            },
            {
                "text": "How much work going to bed is, and how sometimes staying up later to avoid it is a reasonable alternative.",
                "user": "u/Shabang"
            },
            {
                "text": "She talks to herself when she blow dries her hair. Every time, and only then. Due to the noise of the dryer, I can't understand what she's saying, but she really goes on. Once she stops drying, she stops talking. Happens every day.",
                "user": "u/wyzapped"
            },
            {
                "text": "Just a cute little show I noticed after we were married. My wife holds her breath when she applies mascara",
                "user": "u/buckwheats"
            },
            {
                "text": "How many hair ties are in each room of your house...",
                "user": "u/Graciebxrry"
            },
            {
                "text": "The \"everything\" shower",
                "user": "u/DavesGroovyWaves"
            },
            {
                "text": "They don't have pockets, I mean they do, but they can only hold 2 quarters, max.",
                "user": "u/notwhoyouthinkmaybe"
            },
            {
                "text": "Common areas which can be seen by guests: SPOTLESS\n\nTheir personal space that closes that cannot be seen by guests:  FUCKING DISASTER",
                "user": "u/bigkutta"
            },
            {
                "text": "When you first start dating a woman and you are living in separate spaces: Taking off her bra means sexy time.\n\nWhen you live with said woman: she just never wears a bra at home.",
                "user": "u/Usual_Ad_730"
            },
            {
                "text": "Make up, as a little bloke never really saw my Mum putting it on, she’d be up and ready to go to work before I got up. Sure I’d see her do touch ups etc.\n\nFirst SO I lived with, watching her put it on fascinated me. When she went full in for an event though I lost track of time!",
                "user": "u/Chewiesbro"
            },
            {
                "text": "Blankets. Blankets. and MOAR BLANKETS.",
                "user": "u/wetshowerrug"
            },
            {
                "text": "First time I moved in with a partner I certainly wasn't ready for the transformation my bathroom counter was about to go through.",
                "user": "u/borb86"
            }
        ]
    },
    "1b7jbvg": {
        "post": "What membership is 100% worth every penny you pay for it?",
        "user": "u/CamHalf",
        "comments": [
            {
                "text": "I’m a scuba diver. For $75/year I get extra insurance in case I have an accident while diving. They pay for medical evacuation, they have a dive doctor speak to the ER doctor if they don’t know how to treat me, and they help coordinate getting me into a decompression chamber if I need it. My health insurance won’t cover any of that.\n\nPlus I can call them anytime with medical scuba questions.",
                "user": "u/sweetawakening"
            },
            {
                "text": "I live on an island in Alaska with limited healthcare. An emergency flight to a more capable hospital will cost $50000. For $100 a year I save $49900 if I ever need their services. That $100 covers everyone living under my roof. There is no limit on the number of flights. And seniors pay $75. Of course, the flight isn't a guarantee. Bad weather or the donated jet needing repairs can, and does, prevent you from being flown out.",
                "user": "u/Ksan_of_Tongass"
            },
            {
                "text": "The Great Courses. It’s now under the umbrella of Wondrium (and they have a bunch of other stuff, but I look for the GC stuff) They have hundreds of courses. Each one has roughly 26-40 lectures. They’re the best professors in the world - the ones that students report as their favorite teachers. \n\nMy boyfriend and I always have four on Thursdays: a science, an art, a philosophy (or wild card) and a history. We’ve done classes like: botany, the analects of Confucius, The Medici’s, the physics of time, early humans and the history of food. \n\nI’ve got a good deal with them at $10/month all I can stream. Great for lifelong learners.",
                "user": "u/Shaydie"
            },
            {
                "text": "When my ex and I had first moved to New York we bought family memberships to the MET and the Natural History museum during the first week. Seriously, the best decision ever. They have ALL kinds of year-round events and things to do that you can bring family and friends.   \n\n\nThe MET has a members only rooftop bar and mezzanine, members only music events like we watched the philharmonic play Vivaldi's \"Four Seasons\" in the Temple of Dendur.  Members only gallery viewings, curator talks, talks by archaeologists and various things you could volunteer for. It was like having an \"In\" into the city.  \n\n\nThe Natural History museum had a monthly \"Jazz under the stars\" night with free food, drinks and music under the planetarium. I met Bill Nye and Neil Degrasse Tyson (when he was working there) and a bunch of other minor celebrities.   \n\n\nThese are not expensive memberships either.",
                "user": "u/joeldg"
            },
            {
                "text": "About 10 years ago, I was member of the nudist resort that was near me. For giggles, I brought in my college ID. About 160 a year for 24 hour access to the resort and grounds. \n\nFor me it was my country club. Pool, big hot tub, gym, sauna. By my math at the time, all I had to do was visit 5 times a year to pay for it. I was there 2 to 5 times a week. Since it was a very rural area and not much to do, going there saved me money as anything decently worth doing was an hour or more away.\n\nAlso since it was a nudist resort, most of the people that annoyed me were not apt to bother me. Perfect privacy to detach from the world.",
                "user": "u/Pyreknight"
            },
            {
                "text": "As a parent, the local children's/science museums. Got more than my money's worth on bad weather days",
                "user": "u/iambatmanjoe"
            },
            {
                "text": "I can't say for sure if it's \"worth every penny\", but there have definitely been occasional times my car broke down on the road that I was glad I'm a AAA member! \n\nOn a side note, back in the day, AAA TripTiks were the \"Google Map\" if you wanted to take a road trip. You could go in, tell the AAA person the trip you were planning to take, and they'd put together a personalized flippable roadmap for you including highlighting expected construction and tolls, etc.  Nowadays of course Google Maps and such does all that in real time on your phone so the TripTik is obsolete, but it was still pretty neat how they assembled them!",
                "user": "u/bodyknock"
            },
            {
                "text": "The US National Park Senior Pass.\n\nThe BEST bargain in the nation.",
                "user": "u/BrunoGerace"
            },
            {
                "text": "this made me remember MoviePass and now im sad",
                "user": "u/slothman137"
            },
            {
                "text": "Costco Executive. If you shop strategically and often enough, you gain back all the membership money through direct cash rewards, not to mention the amount of money you saved by buying everything you needed at a cheaper per-unit cost.",
                "user": "u/prettyfly4sciguy"
            },
            {
                "text": "YMCA - I pay $70 a month for a family of four and it includes use of the pool, gym, and sauna and up to four hours of childcare a day. I go nearly everyday and have lost 60 pounds over the last six months. It’s also my only childcare as a stay at home mom so it keeps me sane.",
                "user": "u/neopolitandynomite"
            },
            {
                "text": "Public library",
                "user": "u/ergonaut"
            },
            {
                "text": "I have a subscription for air filters for the home (FilterEasy).  It's one of those things you always forget to replace, then when you see them at the store, you forget what size you need.  With the subscription, the correct ones come in the mail, every 3 months, like clockwork.  \n\n*Edited to include the company I use for this service.",
                "user": "u/The_Kentwood_Farms"
            },
            {
                "text": "A gym membership you actually use",
                "user": "u/Makeitmelt"
            }
        ]
    },
    "1boamlz": {
        "post": "What is a dead giveaway that someone grew up in an abusive household?",
        "user": "u/_BARONVOND3LTA",
        "comments": [
            {
                "text": "As a result of my childhood … I over explain everything. I assume I won’t be believed.",
                "user": "u/uselesslydevoted"
            },
            {
                "text": "Hyper aware of their surroundings and able to adapt and/or problem solve with lighting speed in abnormal chaos, but normal day inconveniences can be a breaking point.",
                "user": "u/shane-mad"
            },
            {
                "text": "Therapist checking in here. A more subtle one is that they are hyper aware of their surroundings and people’s emotions. \nAs that was a tool of safety that tends to not be able to be shut off as they become an adult.\n\nEdit: yes this can also be true for people that were in an abusive relationship.",
                "user": "u/xchngboredom4argumnt"
            },
            {
                "text": "Apologize for everything that isn’t your fault.\n\nTake blame for events around you that don’t involve you.\n\nDo everything you can to minimize emotional outbursts of others.\n\nIt’s not great.",
                "user": "u/horriblechoiceinname"
            },
            {
                "text": "Me and a roommate were having a disagreement in the kitchen, and I absent-mindedly reached into a cabinet above for a plate to make a sandwhich.  The roommate flinched as I reached up.\n\nSo that.",
                "user": "u/InchZer0"
            },
            {
                "text": "They tend to be very independent and have backup plans for their backup plans. It comes from a living environment that was unstable where they were often left to rely upon themselves to get by.\n\nAnd others have pointed out, this \"independence\" can also manifest as a desire to be in control... because you do not want to be subject to the ambiguity and unreliability of others.",
                "user": "u/tahlyn"
            },
            {
                "text": "Being good at manipulating people and situations without realizing it. You learn to read someone's emotions well and how to spin a situation to keep yourself safe",
                "user": "u/Objective-Safety3601"
            },
            {
                "text": "This is based on my own personal experience mostly but:\n\n-Easily scared / startled \n\n-Hiding food / over eating\n\n-Going completely silent when someone yells at you or scolds you \n\n-Excessive apologizing for every little thing that goes wrong\n\n-Being pretty independent and not asking for help because you don’t want to “bother” anyone\n\n-Seeking constant assurance or validation \n\n-Either being incredibly affectionate or not affectionate at ALL.",
                "user": "u/notreallykatie"
            },
            {
                "text": "They freeze when people start yelling.  Weirded out by a family being nice to one another.  Upset when you see a happy family dinner in shows or movies.\n\n&#x200B;\n\nEdit : Thanks for the PM.  Yes I was giving personal experiences.  Yes I'm fine but I still have those above",
                "user": "u/Educational-Drink430"
            },
            {
                "text": "They don’t ask for help with anything. Ever.",
                "user": "u/KirbyStyle"
            },
            {
                "text": "easily startled, terrified of making their SO upset, refusing to speak to one or both parents, overthinking about small mistakes",
                "user": "u/aesthetic_kiara"
            },
            {
                "text": "They are really good at finding out what people in authority WANTS to hear and some are really good at manipulation as a result.\n\nNot due to evil means, neccesarily, but to survive and get by.",
                "user": "u/Adler4290"
            },
            {
                "text": "I'm close to crying right now. Finding myself in too many of those comments.",
                "user": "u/b00g13"
            },
            {
                "text": "Can't relax, what if something needs to be done?!",
                "user": "u/Poopikaki"
            },
            {
                "text": "* Continually apologizing for stuff that isn't their fault\n\n* Remains completely calm in the face of very angry, even violent people\n\n* Extremely self-reliant; never asks for help with anything\n\n* \"People pleasing\"; doing things for others, not saying \"no\"; may be a social chameleon who changes who they are or what parts of themselves they present depending on the crowd they're with\n\n* Emotional dysregulation; \"loses their shit\" over minor stuff; paradoxically can remain calm in a major, life-threatening crisis",
                "user": "u/dod2190"
            }
        ]
    },
    "1bg7hud": {
        "post": "What would instantly destroy your life just by doing it once?",
        "user": "u/ApexOverlordIsDrunk",
        "comments": [
            {
                "text": "As an “older” guy in the trades, fuck around with safety. I’ve seen enough people fuck their livelihood up by taking a stupid unnecessary chance. It’s always a shame when you hear of a young trades person die because you know they probably don’t know better or didn’t work with people who were teaching them how to do it safely.  Number one rule is come home at the end of each day!",
                "user": "u/Marginallyaccepted"
            },
            {
                "text": "Foraging and picking mushrooms you cannot identify.",
                "user": "u/boetelezi"
            },
            {
                "text": "Reconnecting with people who were bad influences on you. You'd be surprised how quick one can return to their old ways.",
                "user": "u/Leckloast"
            },
            {
                "text": "Pet the bison. Jump in the hot spring. Climb the rail. Hike into the desert when everyone and their mother told you not to. National parks are a gauntlet of Darwinian temptation.",
                "user": "u/Upvotespoodles"
            },
            {
                "text": "Negligent homicide. I’m sure self defense killings are not as difficult to handle as it is justified (not saying everyone would be fine), but negligent homicide is another level. You drive drunk, text while driving, or not pay attention and smack into a pedestrian, you’re going to live in a nightmare.",
                "user": "u/KingJohn_513"
            },
            {
                "text": "I have a huge fear of accidentally hitting someone with my car at night.",
                "user": "u/rach0509"
            },
            {
                "text": "Jumping into an unknown body of water head first. Seen it happen where some idiot jumps in head first and paralyzes himself. Sad, but it happens in less than 5 seconds.",
                "user": "u/HagsSecret"
            },
            {
                "text": "Probably committing a felony. Because getting a job would be hard, renting would be hard… so I am going to avoid committing a felony",
                "user": "u/ilike7hournaps"
            },
            {
                "text": "Unprotected sex in some cases",
                "user": "u/JerseyMBA"
            },
            {
                "text": "Any sort of criminal charge because I would lose my nursing license.",
                "user": "u/considermebranded"
            },
            {
                "text": "Meth, crack, heroin, and fentanyl all have pretty good track records of destroying lives.",
                "user": "u/mkwas343"
            },
            {
                "text": "Road rage. Guy I went to middle school with jumped out of his car and beat a guy he was road raging with so badly that he was partially paralyzed by the end of it. \n\nGuy was 19 and got a 45 year prison sentence. Completely fucked his whole life up and will only have a few years in the outside, and that's if he's lucky and lives that long.",
                "user": "u/dropofred"
            },
            {
                "text": "Never seen a happy crackhead , and I hear it only takes once",
                "user": "u/Rorylizbath"
            },
            {
                "text": "Losing your temper, you can be the nicest calmest person your entire life but everyone will always remember that one time you got angry.",
                "user": "u/InfinityWriter"
            },
            {
                "text": "Suicide attempt- I survived a jump and broke my legs, feet and spine. It was an awful situation to be in but it happened and here I am",
                "user": "u/Zestyclose-Storm-489"
            }
        ]
    },
    "1bfsleg": {
        "post": "What is common thing while having sex which is not portrayed in porn? ",
        "user": "u/beyondfrust",
        "comments": [
            {
                "text": "Somebody asking \"Are you ok\" when something hurts or cramps",
                "user": "u/Mysterea_Wisterea"
            },
            {
                "text": "Communication. They just magically know what to do and are comfortable enough in any position... which isn't how real sex works.",
                "user": "u/taka_282"
            },
            {
                "text": "Sweat. Sometimes it gets really sweaty.",
                "user": "u/Wonderful_Whereas402"
            },
            {
                "text": "Having to stop and pull you both away from the edge of the bed/couch/whatever.",
                "user": "u/sleepwalkfromsherdog"
            },
            {
                "text": "Laughter",
                "user": "u/SendMeAttention"
            },
            {
                "text": "Having to go pee real quick before you get started",
                "user": "u/jadeforfun"
            },
            {
                "text": "The sound of when two sweaty bodies suction together, with the arm pit fart sound when it occurs. Also don't forget the 'pffffapppp' when you break suction between each other!",
                "user": "u/bdsmgapedaptap"
            },
            {
                "text": "elbow pressing her hair against the bed accidentally",
                "user": "u/warants322"
            },
            {
                "text": "The cramp in my hamstring!",
                "user": "u/BalanceEarly"
            },
            {
                "text": "Cleaning up the mess afterwards.",
                "user": "u/PM_ME_UR_ORGASM_PICS"
            },
            {
                "text": "Getting thirsty during oral sex, and having to stop to get a drink.",
                "user": "u/Ok-Permission-3145"
            },
            {
                "text": "That one lazy position you both like, and default to, every time.\n\nShe gets off and wants to stop for a bit, but you both end up falling asleep.\n\nDitto on the leg cramps. \n\nLeaning on her hair. \n\nThe blowjob that takes entirely too long (despite fantastic skill and effort) and neither of you have the courage to admit it's pointless and stop.\n\nGoing down on her and it's the same as the former.\n\nThe laughter and smiles",
                "user": "u/Morgwar77"
            },
            {
                "text": "Affection",
                "user": "u/ZanyChonk"
            },
            {
                "text": "The oopses, ouches, accidental hair pulls, and spontaneous craps when changing positions.\n\nEdit: cramps, but I am going to leave it because that happens too 😂",
                "user": "u/The_Help"
            },
            {
                "text": "Going for too long, being sweaty and exhausted, and having to tap out with no climax. No, that's not a flex, that's antidepressants.",
                "user": "u/Calimar777"
            }
        ]
    },
    "1bl4t0w": {
        "post": "What screams “I have depression”? ",
        "user": "u/il_balilla",
        "comments": [
            {
                "text": "Sleeping to avoid living. Even if you’re not necessarily tired.",
                "user": "u/yourstrulyval23"
            },
            {
                "text": "completely tired all the time, even when you don’t do anything",
                "user": "u/Comfortable_Size_658"
            },
            {
                "text": "Constantly in a world in your head. I struggle with living like this. My mind and body are normally never in the same place.",
                "user": "u/SuperCyberWitchcraft"
            },
            {
                "text": "Intense irritation at small things.",
                "user": "u/Sauce_senior"
            },
            {
                "text": "Feeling like it’s a chore to do things that you used to love doing.",
                "user": "u/Accomplished_Item710"
            },
            {
                "text": "Snoozing for an eternity because you know what awaits you when you get up and face the day.",
                "user": "u/ErBoProxy"
            },
            {
                "text": "I was driving, as I frequently do for work, and realized I didn't have Spotify or the radio on. I am a music nut. I had been driving that way for hours. Thought back and had multiple days like that.\n\n&#x200B;\n\nJust wasn't interested in it. That was weirdly a big wake up call for me.\n\n&#x200B;\n\n**EDIT:** This blew up way more than I thought it would, so I thought I would clarify since this is getting a lot of exposure.\n\n&#x200B;\n\nNot listening to music is in NO way a sure-fire diagnosis for depression. Even in my most mentally-healthy phases, there is definitely times when I drive/cook/hang out in silence at times. That's normal.\n\n&#x200B;\n\nWhat isn't normal is that I've been listening to music since I was really young, and really got into it when I was like 9-10. Music is probably my main hobby. In a job where I'm on the road for anywhere from 30 mins to 6 hours a day, I listen to music all the time when I'm not on the phone for work.\n\n&#x200B;\n\nOne day, I had been driving for several hours, and just felt... numb. I had a realization that no music was playing- this got me thinking about how long this had been going on, and I realized I had been driving like this for a few weeks now. I also love to cook and listen to music- I'll sing along, make up lyrics, sing to my son, and generally have fun. I had stopped doing this as well. I was already growing concerned about depression, so I discussed this with my psychologist/therapist and PCP. They both agreed, after several discussions, that I am clinically depressed and that not having interest in things you once loved is definitely a sign of depression. So it was one of the first real \"wake-up\" calls for me.",
                "user": "u/HonestFalcon4444"
            },
            {
                "text": "Just kinda waiting for the day to end each day",
                "user": "u/4applepies1sweetea"
            },
            {
                "text": "Depression doesn’t scream, it would require too much energy.",
                "user": "u/DorkusMalorkus89"
            },
            {
                "text": "losing interest in literally everything and opting to just sleep instead.\n\nat one point i couldnt even bring myself to watch tv or netflix etc., i just did not care. same with being on my phone. then i lost interest in being awake and so sleep, beautiful beautiful sleep, became the answer.\n\nso i would say... that. lol",
                "user": "u/lizzard_lady8530"
            },
            {
                "text": "Gradually pulling away from everything. You hangout with friends less frequently. You start doing the bare minimum at work. Eventually you just stop caring all together and all you want to do is be alone.",
                "user": "u/DiamondCupcake"
            },
            {
                "text": "* Wanting to sleep, but not really.\n* Wanting to comfort eat, but not really.\n* Not wanting to be on your own, but not wanting to be with people either.\n* Wanting to go out, but wanting to stay home. \n* Wanting to have a bath, but not once you're in it.\n\nAll of the above in reverse and x10",
                "user": "u/Thorlene"
            },
            {
                "text": "The nest. The depression nest.",
                "user": "u/Professional_Rain587"
            },
            {
                "text": "Waiting for each day to end, but not really having a reason why, because you're not waiting for any specific event.",
                "user": "u/harmyb"
            },
            {
                "text": "Change of behaviour day to day. Someday, the person will be joyful, motivated and look energetic while the day after, it will be grumpy, demotivated and tired. Constant change of mood is a big sign of depression and will have an impact on all others aspect in its life.",
                "user": "u/Faelysis"
            }
        ]
    },
    "1bl1zbs": {
        "post": "To those who have accidentally killed someone, what went wrong?",
        "user": "u/D1ll3ng3r",
        "comments": [
            {
                "text": "My dad is a garbage truck driver in a major city. A few years ago, there was a dead and crushed homeless man found at the dump. \n\nThey went through the camera footage and the tickets for the trucks coming and going and narrowed it down to my dad's truck who dumped the man. The guy was sleeping in a dumpster. \n\nFor those of you that don't know, there's a packer blade in the back of those trucks to squish the garbage to make more room. \n\nHe didn't stand a chance.",
                "user": "u/jess_thenyctophiliac"
            },
            {
                "text": "No, but I thought I did for almost 2 years.\n\nVery close friend of mine, the kind of guy that always seemed to be happy and everybody just loved him. \n\nWas hanging out at his place (we were 16 back then) and for whatever reason I don‘t remember, I showed him how to tie the hangman’s knot.\n\n3 days later he was dead. His mom called, claiming he hung himself and it was all my fault. Fucked me up badly. My friend was dead, I never saw anything coming and apparently it was even my fault…\n\nAlmost 2 years later we found out by coincidence, that he killed himself with exhaust fumes in his mom‘s car. \n\nI‘ll never know, why he did it (which still haunts me sometimes) or why his mom blamed me with wrong accusations (never could be angry about that though, given how painful that must have been for her) or how she knew about that stupid knot…",
                "user": "u/pAnd0rA_SBG"
            },
            {
                "text": "I asked my college roommate to drive my car since I was tired. Not sure what happened as I was asleep but he ended up hitting an oncoming vehicle head on at around 60-70mph. I was the only survivor. His parents were extremely helpful in forcing me to accept that it wasn't my fault. But my heart breaks regularly for his lost potential. He was an incredible guy and would have done great things, I'm sure of it.",
                "user": "u/CarolFukinBaskin"
            },
            {
                "text": "For everyone answering, just know you did the best you could in these situations\n\neven if there was nothing you could do, that was your best and that's enough",
                "user": "u/NiteKore080"
            },
            {
                "text": "this never happened to me personally, but my dad drove for Toronto’s subways and streetcars for 30 years. the amount of suicides he’s seen is astonishing. just last month a mother and her newborn jumped. both passed away. my dad has always had therapy once a week my entire life, i understand why.",
                "user": "u/douchebagalicious"
            },
            {
                "text": "Rock climbing in Nevada.  I was securing the line, paused to sneeze.  My friend prematurely switched lines without me giving him the thumbs up.  He fell over 100 feet.  I haven't climbed since.  I was 18.  I'm 51 now.",
                "user": "u/-Economist-"
            },
            {
                "text": "It turned out a new co-worker lived in the same apartment complex as me across town; she had just moved to the area a few weeks back. We actually ended up going to Harry Potter and the Deathly Hallows pt 1 midnight screening together, she was a really passionate fan of Potter. It was great.\n\nHer car was in the shop suddenly one day, so I told her at work about a shortcut she could take home on her bike. She went that way, and was killed by a drunk driver crossing that other road. She was 26; guy was going 75 in a 35 zone trying to show off his souped-up sports car.\n\nSorry for the shortcut, Angie.",
                "user": "u/scalebirds"
            },
            {
                "text": "A crazy wasted guy broke into my house several years ago. He had a knife and was threatening me. My young son and I were the only ones home. I heard noise in my house and grabbed a baseball bat I keep under my bed and went to investigate thinking it was probably nothing. The guy came at me yelling incoherently and almost as a reflex I cracked on top his head with the bat. I think my adrenaline must have put more into the strike than I thought I was doing and the guy dropped immediately. I called 911 and police arrived quickly but he was already gone. Crushed skull. I still have nightmares fairly often but can't picture how else it would have ended without me and possibly my son being attacked. Survival instincts are strong",
                "user": "u/BrStEd"
            },
            {
                "text": "I didn’t accidentally kill them but I was riding home with a friend of mine on our bikes down the turnpike when a senior citizen who didn’t check their blind spot changed lanes and sent my friend into and over the guard rail into a tree. Severing his spine on impact, paralyzing him from the shoulders down. Ribs puncturing his lungs as well. I just had to sit there and listen to him gasp and struggle to take his last few breathes on our linked intercom head sets.",
                "user": "u/pizzagangster1"
            },
            {
                "text": "This happened to my uncle back in the 1970s: He was coming home from work one night in a snowstorm, and turned onto his road.  His house was on the other side of a hill. He climbed the hill, and as he started descending the other side, he heard kids screaming and yelling. Brakes were useless. He ran over a 10-yo-kid who was sledding down the hill in the middle of the road and killed him. It was his next-door-neighbor. There was no charge against him, nobody sued him, because it was clear that it was a freak accident. Even the kid's parents told him it was not his fault. However, my uncle, 53 years old, a WWII USMC combat veteran  of the Pacific war, previously strong-willed, clear headed, and not a drinker, drank himself to death in less than a year. Tragic all the way around.",
                "user": "u/1KinderWorld"
            },
            {
                "text": "I was driving to play a coed soccer game at night, first snowfall of the year. Didn't even make it off my own street before suddenly seeing something under my headlights. Didn't have time to stop before hitting him. I don't know why he was lying on the road, but I do wish I had noticed him sooner so that I could have asked.",
                "user": "u/None"
            },
            {
                "text": "This was a hockey accident when I was 19. I’m 36 now. I shot a low slap shot and there was a net battle and my friend on the other team got shoved, fell over and the puck hit him in his temple and shattered much of the structure. He died later because of the bone fragments in his brain. I stopped playing for a long time after that. Now I play men’s league and wear his number.\n\nEdit: didn’t expect to receive tons of comments and DMs. They’re a lot to reply to, and really heavy to remember. Emotions came up that I haven’t felt in almost 20 years. I’m really thankful for the outreach. I ask that we show this kind of love to people in person!",
                "user": "u/Airbee"
            },
            {
                "text": "I had a good friend die at my house years back. \n\nHe had taken subutex or suboxone unbeknownst to me, I was tired and needed to go to bed. He wanted me to hang out so I smoked some cigarettes with him and we drove to the quick stop for a beer. Hung out a little longer and he looked like he was trashed so I put him in his sleeping girlfriends (my roommate) bed and put on season 3 of house md and said goodnight. \n\nHe ended up overdosing and died in his sleep. Sent a good number of the friend group down dark paths after that myself included. It’s getting better for me now at least and several others are sober finally. \n\n\nAlways felt like he was wanting to hang out longer so I could keep him alive.",
                "user": "u/BaunerMcPounder"
            },
            {
                "text": "Happened to a friend. They were a group of adventure influencers who do a lot of stuff like cliff jumping and cave diving and filming themselves. All strong athletes and very fit. \n\nThey were trying to get some kind of a waterfall jump. One of them either slipped or misjudged the undertow of a cliff dive area, a VERY BIG no no. She went in and didn’t come back, getting sucked under the water and down to a larger pool. \n\nHer boyfriend freaked out and jumped in after her, trying to save her. He also didn’t come up. Another friend also dived in, and also didn’t make it. \n\nThe couple who went down eventually had their bodies recovered miles down the river. All three died.",
                "user": "u/GeneralZaroff1"
            }
        ]
    },
    "1b7pfa2": {
        "post": "How are you feeling about the inevitable Trump v Biden rematch?",
        "user": "u/krebstar10000",
        "comments": [
            {
                "text": "Exasperated with our polarized political system that feels like a chess game that no one is winning",
                "user": "u/Candid_Wallflower"
            },
            {
                "text": "Tired of “living through historic times”",
                "user": "u/devpuppy"
            },
            {
                "text": "Not feelin good my guy.",
                "user": "u/briowatercooler"
            },
            {
                "text": "I’m tired boss.",
                "user": "u/DIKS_OUT_4_HARAMBE"
            },
            {
                "text": "There's been no break since 2015. I need a political vacay.",
                "user": "u/runnersoncorners"
            },
            {
                "text": "I have never wanted a sequel less than this.",
                "user": "u/Clovis_Winslow"
            },
            {
                "text": "Annoyed. As someone recently said for my Gen X generation... in the 90s the presidents were our parents age.\n\nAnd ever since then the presidents are *still* our parents age.\n\nThe boomer generation really needs to give up the reign they hold so tightly.\n\nEdit: yes Biden is from the Silent Generation, but that's not the point. The point is the parents of Gen X have held power for over 30 years. Time for a serious change. We need term limits and age limits and the young to vote!",
                "user": "u/sorengray"
            },
            {
                "text": "I’m feeling like it’s way past time to put an age cap for all government offices. I’m Gen-X and I think 70+ year olds are way too old and out of touch to be in politics.",
                "user": "u/BadLuckCharm1966"
            },
            {
                "text": "I'd be more interested if they boxed in zero gravity.",
                "user": "u/OtherOlive797"
            },
            {
                "text": "Weary",
                "user": "u/noahsmybro"
            },
            {
                "text": "I certainly think it’s interesting that both have a solid chance of dying in office. Not even of an assassination or anything like that but just because they’re old. Trump doesn’t seem to take very good care of himself and they’re both at the age where even minor issues can escalate rapidly.",
                "user": "u/Astrium6"
            },
            {
                "text": "Fucking embarrassed.",
                "user": "u/TrippyVegetables"
            },
            {
                "text": "George Washington was right, political parties and the two party system will be the death of us.",
                "user": "u/visible-somewhere7"
            },
            {
                "text": "Can we get someone under 50 in the office maybe?\n\nI think it’s time for a change. I don’t need any revolutionary ideas. \n\nBut for god sake how are these the best 2 people we have to offer.",
                "user": "u/WrestlingDerek"
            },
            {
                "text": "Fuck I'm tired and I live in Australia",
                "user": "u/AccordingNumber2052"
            }
        ]
    },
    "1brme0b": {
        "post": "What’s something that just makes you go “who the fuck figured this out”?",
        "user": "u/jayytrip",
        "comments": [
            {
                "text": "Protamine sulfate is a drug used to reverse the effects of anticoagulants that are sometimes used during surgery. It was originally derived from salmon sperm. I know I could research the history, but it’s more fun to imagine a team of doctors like, “Well, we tried everything else. Someone jerk off that fish and see if that does the trick.”",
                "user": "u/LookWhatDannyMade"
            },
            {
                "text": "I saw a video of the process of making silk, and it's completely insane to me that humans somehow came up with a long list of really obscure steps to make fabric",
                "user": "u/BallisticThundr"
            },
            {
                "text": "Coffee. Someone thought: this berry tastes horrible. Maybe if I pull the seed out, set it on fire for a little bit, then grind it up and run hot water through it, I can drink it.",
                "user": "u/jpow33"
            },
            {
                "text": "I know the answer, but Cataloguing mushrooms. \"This one killed fred, this one makes you see god for three days, and this one tastes kinda like chicken\"  \n\n\nThe answer was a LOT of people.",
                "user": "u/Worried_Place_917"
            },
            {
                "text": "Record players. Turning microsqiggles on vinyl into perfect reproductions of people's voices and instruments? Like wtf is that witchcraft.",
                "user": "u/Gigged"
            },
            {
                "text": "Anything to do with astronomy. Mass of planets, distances of stars, locations of black holes. A lot of impressive brain power and technology went into all of this I'm sure.",
                "user": "u/D-Rez"
            },
            {
                "text": "MRIs. As a med student i was (briefly) taught how these things work, and oh. my. god. how the hell did anyone think about this.",
                "user": "u/xVolt_"
            },
            {
                "text": "Computing in general. Like the idea of converting physical stimuli into code is mind blowing to me. Like actually building a machine that is able to interpret impulses, motion, light, etc. and turn it into a language that can interpret and execute tasks is really quite amazing",
                "user": "u/BrimfulOfLa-A"
            },
            {
                "text": "How wireless works, and radios work.  I have a solid understanding of wireless, security, networking, and everything that goes with it as an IT person for the last 25 years.  The fact that my computer, or cell phone can talk without any wires attached is magic.  I’ve read about it, tried to understand, but how did someone figure this out??",
                "user": "u/hooch21"
            },
            {
                "text": "How the mechanichs under the needle on a sewing machine works to juggle the thread. That thing is just genius.\n\nThe guy who figured out how to use addition in binary to let digital computers do subtraction.",
                "user": "u/The_Pastmaster"
            },
            {
                "text": "Boiling horses = glue\n\n“Everything at home okay Ralph?”",
                "user": "u/trailhopperbc"
            },
            {
                "text": "Cameras. How is it possible that some device is able to somehow capture the exact image it is pointed at with one click",
                "user": "u/Upstairs-Cow2948"
            },
            {
                "text": "Contact lenses. It seems space age to me that there are these tiny flexible lenses I attach directly to my eyeballs every day to correct my vision. How the hell? Yes I know I can Google it.",
                "user": "u/AggravatingCupcake0"
            },
            {
                "text": "Which plants and animals were edible, especially ones that are very poisonous if you aren't careful. For example, how many tries did it take to figure out that ripe ackee fruit pods are safe to eat, but that the seeds and skin are always poisonous, as are unripe ackee fruit pods? How many tries did it take to figure out how to safely eat pufferfish?",
                "user": "u/Short-Condition-8878"
            },
            {
                "text": "Horse piss works as birth control.",
                "user": "u/hacksawjim89"
            }
        ]
    },
    "1bpucjj": {
        "post": "What is NOT a dealbreaker BUT would be greatly disappointing to find out about your partner?",
        "user": "u/SkyeSerenade",
        "comments": [
            {
                "text": "They can only sleep on the same side of the bed as I do and want me to switch sides.",
                "user": "u/mooandcookies"
            },
            {
                "text": "My boyfriend and I have been together 11 years. I’ve had the same favorite TV show since before I met him, and he hates it. Obviously not a dealbreaker but it’s pretty disappointing! 😂",
                "user": "u/4thdrinkinstinctxx"
            },
            {
                "text": "When there's things they used to do with an ex but aren't interested in anymore. For example, I had an ex whose ex used to force them to do couples costumes at Halloween etc. I had never had a serious bf before, and desperately wanted to do a couples costume with him but he was OVER IT at that point and didn't want to :(",
                "user": "u/ChippyTheGreatest"
            },
            {
                "text": "Doesn't put bowls upside down in the dishwasher",
                "user": "u/Emotional_Molasses58"
            },
            {
                "text": "They go to Target and throw doormats on the floor to look at them and then just walk away and leave them on the floor.",
                "user": "u/RilohKeen"
            },
            {
                "text": "Putting unwanted items back in the wrong place at the supermarket.\n\n>!Becomes a dealbreaker when they leave refrigerated or frozen items outside of a fridge/freezer.!<",
                "user": "u/ReliefZealousideal84"
            },
            {
                "text": "My dad hates movies with subtitles. My mom is a foreign film buff. She has been trying to change him for DECADES. And while he'll sit through (and sometimes even enjoy) them on occasion, he'll still groan any time she suggests a movie with subtitles.\n\nThe ultimate disappointing non-dealbreaker.\n\n**EDIT:** Ok, I'm just going to add this here before anyone else asks if my dad can read. He's an oncologist. He's not dumb. He can keep up with the subtitles and the subject matter. He just does so much reading for work (he goes through medical journals like crazy) he wants to relax with something silly and mindless, that requires zero effort on his part. He feels the same way about tearjerkers (another of my mom's favorites) where people die slowly from some awful disease. He gets enough of that shit at work. But he'll occasionally sit through them for my mom. We watched the old Julia Roberts film, Dying Young, a few weeks ago (where she nurses/falls in love with a young guy dying of cancer) and for half the film he was just looking at my mom with an expression that clearly read \"why the fuck would you do this to me?\"",
                "user": "u/_hootyowlscissors"
            },
            {
                "text": "when you watching a tv series together and he or she watches an episode without you. thats a betrayal.",
                "user": "u/CaptCojones"
            },
            {
                "text": "In college, watched the movie Donnie Darko for the first time and when it ended, I had so many questions and was analyzing the meaning behind it. Tried to talk to my then boyfriend and he seemed disinterested. Finally, after a half hour, he says \"can you please stop talking about it? It's just a movie. You are just supposed to enjoy it, not analyze it.\" \n\nNot a dealbreaker, but a huge disappointment.",
                "user": "u/littleirishpixie"
            },
            {
                "text": "When you plan to watch your favourite movie together at the theatres but they already seen it with friends.",
                "user": "u/Moon_Jewel90"
            },
            {
                "text": "If they are a sock-shoe-sock-shoe person and not a sock-sock-shoe-shoe person.",
                "user": "u/Ace-Ventura1934"
            },
            {
                "text": "I think a lot of people started writing in deal breakers instead of disappointments.",
                "user": "u/WarAndFynn"
            },
            {
                "text": "If they stop the microwave prematurely, but don't clear the display.",
                "user": "u/dancingpianofairy"
            },
            {
                "text": "If they don’t love music. (This is my life. My husband doesn’t care for music. I LOVE music. But thankfully he doesn’t care if I play it all the time. He just tunes it out) \n\nThe ironic thing is my husband has a beautiful singing voice, and a very strange ability to pick up sequences of notes he hears in ANYTHING and link it to a piece of classical music he’s heard once or twice as a very small kid. He can recall song lyrics perfectly and replicate the tunes and shit perfectly after hearing a song once or twice. And Im pretty sure he has perfect pitch, but he doesn’t care enough to test it. All things utterly WASTED on him. I can barely carry a tune in a bucket and I adore music. I’ve played multiple instruments and can read music and have been in multiple choirs, and making music is insanely difficult for me. It just isn’t fair 🤣🤣",
                "user": "u/disgruntledhoneybee"
            },
            {
                "text": "Sleep apnea (I know, it’s not anyone’s fault, let’s get it sorted so we can both sleep though)",
                "user": "u/Appleinacoconut"
            }
        ]
    },
    "1brn5zf": {
        "post": "What would  be your reaction if Donald Trump dies tonight?",
        "user": "u/kRe4ture",
        "comments": [
            {
                "text": "Well, my reaction would be that you should have a *very* strong alibi for tonight, just in case.",
                "user": "u/allegate"
            },
            {
                "text": "\"holy shit, what did/u/kRe4ture know that the rest of us didn't?!\"",
                "user": "u/pnut-buttr"
            },
            {
                "text": "\"Aw, shit... I can smell the conspiracy engines firing up now!\"",
                "user": "u/Only_Explanation7181"
            },
            {
                "text": "Wouldn't it be really weird if he actually drops dead tonight",
                "user": "u/Glum_Possibility5204"
            },
            {
                "text": "\"You should never say bad things about the dead, only good. Joan Crawford is dead… good!\" - Bette Davis",
                "user": "u/rambleriver"
            },
            {
                "text": "There's absolutely no way the conspiracy crowd would see it as just a normal thing that happens to old people. I'd be pretty worried tbh.",
                "user": "u/AnAdorableDogbaby"
            },
            {
                "text": "Thanks Obama!",
                "user": "u/AdBroad8817"
            },
            {
                "text": "I think it was Mark Twain that said while he'd never wish death on anyone, he's not been too upset at reading their obituary",
                "user": "u/llcucf80"
            },
            {
                "text": "Tonight - this weekend?  Well, it will all depend on if he returns in 3 days.",
                "user": "u/SensitivePineapple83"
            },
            {
                "text": "Look, I was out till 3 AM “all claws no laws” after a metal show last night. I’m bruised and hungover, and all I want to do is eat my weight in eggs Benedict. \n\nBut if I gotta go party with my people, I gotta go party with my people.",
                "user": "u/teebalicious"
            },
            {
                "text": "So anyway, I went outside and decided to do some yard work because it’s a beautiful spring day. Mid 40’s, sunny. A perfect day to spend outside and enjoy this beautiful day we get to enjoy. \n\nAnd even knowing all of that it still wouldn’t be the number one best thing to happen. And also probably laugh at his cult followers making weird AI images of him as an angel looking like Rambo and who replaces God in heaven since he fired him.\n\nIt will be a strange time, for sure.",
                "user": "u/marzipan_dumpling"
            },
            {
                "text": "Remember when he had Covid and we all had a sense of hope for a week or two",
                "user": "u/anonyquestions1"
            },
            {
                "text": "Remember when Obama announced that Bin Laden was killed at like 1 AM and people went to party in the streets? Yeah, that.",
                "user": "u/Beaverbrown55"
            },
            {
                "text": "Definitely relief followed by dread knowing that his rabid supporters might do something incredibly stupid.",
                "user": "u/Jimmae9"
            },
            {
                "text": "Assuming it happens overnight and I learn about it in the morning, patiently wait for my favorite fro-yo place to open, then go eat a sundae the size of my head.",
                "user": "u/TheTerribleTimmyCat"
            }
        ]
    },
    "1b8mbya": {
        "post": "In English, we use the phrase “righty tighty, lefty loosey” as a helpful reminder. What other languages have comparable common sayings?",
        "user": "u/R1PElv1s",
        "comments": [
            {
                "text": "Worked with a guy who spent 5 minutes trying to screw a stud into a part. When told it was a left hand thread... He changed hands and continued to screw it clockwise.\n\nHis name was Nail, because his parents couldn't spell Niall.\n\nHe also didn't know where he lived \"because his wife drove him everywhere\"\n\nI wish I was making this up.",
                "user": "u/BiggestNizzy"
            },
            {
                "text": "Rechts dreht die Uhr, so gehts zua\n\nAustrian saying for \"the clock turns right, thats how it gets tight\"",
                "user": "u/canyoutriforce"
            },
            {
                "text": "To remember the Alps we use the sentence „Ma con gran pena le reca giù“ in Italian, meaning „he carries them down with great suffering“.\n\nMarittime, Cozie, Graie, Pennine, Lepontine, Retiche, Carniche, Giulie.",
                "user": "u/JoeFalchetto"
            },
            {
                "text": "Clockwise, lockwise",
                "user": "u/nsa_k"
            },
            {
                "text": "In Swedish we have a phrase to remember the countries in Middle America from top to bottom:\n\nSwe: \"Gustav ber Elsa, hon nickar, kostar pengar\".\n\nEng: \"Gustav asks Elsa, she nods, (it) costs money\".\n\nCountries: Guatemala, Belize, El Salvador, Honduras, Nicaragua, Costa Rica, Panama",
                "user": "u/Merazim"
            },
            {
                "text": "\"solang das Deutsche Reich besteht, wird die schraube rechtsrum festgedreht\" \n\n\"as long as the German Reich exists, a screw is turned right to br tight.\"\n\nHistorically complicated, I know",
                "user": "u/Thrashgor"
            },
            {
                "text": "In irish you'd say \"Is minic an béal a bhriseann an srón\"\n\nbasically a phrase to remind someone to keep quiet. In translation \"It's often your mouth that breaks your nose\".",
                "user": "u/wolfeerine"
            },
            {
                "text": "In my country, everybody knows of Roy G Biv, who represents how colours appear in the spectrum",
                "user": "u/BatteryAcidCoffeeAU"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "In Spain we say \"la derecha aprieta, la izquierda libera\" (right oppresses (tightens), left frees)",
                "user": "u/Juanbledore"
            },
            {
                "text": "In French, we say \"A droite. Non ton autre droite putain !\"",
                "user": "u/ClumsyForLife"
            },
            {
                "text": "Gobba a levante luna calante, gobba a ponente luna crescente\n\nIt roughly means 'hump east, decrescent moon, hump west, crescent moon'\n\nIt's used to determine on a whim if the moon is crescent or not based on the placement of the full part (but you need to know where the east/west are)",
                "user": "u/FriedPandaGnam"
            },
            {
                "text": "Chinese has a ton of four-syllable expressions called Chengyu 成语that are used all the time.\n\nProbably the most common one I've heard translated to English is 好久不见--literally \"long time no see.\"\n\nMy favorite is 管中窥豹 which means \"bamboo center peek leopard\" or \"peeking at a leopard through a bamboo tube\" \n\nWhich means you're not seeing something in full context.\n\nThe closest English expression I know is \"can't see the forest through the trees\".",
                "user": "u/PsychonautAlpha"
            },
            {
                "text": "Swedish and use the english righty tight, kids picked it up as well. Unsure if via interwebs or me. Dont know of any swedish equivalent.",
                "user": "u/J-IP"
            },
            {
                "text": "For the order of guitar strings: Een Aap Die Geen Bananen Eet.\n\nA monkey that doesn't eet bananas",
                "user": "u/Tijdspaarder"
            }
        ]
    },
    "1bhk4f3": {
        "post": "What is actually healthy but people think is not?",
        "user": "u/Soren-J",
        "comments": [
            {
                "text": "Frozen fruits and vegetables. The modern flash-freeze technique preserves almost all of the nutrients and they are always picked when they are in season, so they are as nutritious as their fresh in-season counterparts, and more nutritious if it is not the season.",
                "user": "u/Apprehensive-Tip4987"
            },
            {
                "text": "Sport during pregnancy. Actually a lot of things are healthy during pregnancy theres just too much misinformation. If your doctor explicitly says no sport then yes. Do that. But if doctor says ok then go ahead",
                "user": "u/Sure-Morning-6904"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Doing literally nothing to decompress. Sometimes one just needs to breathe and look out a window.",
                "user": "u/Merrill1v"
            },
            {
                "text": "Crying.",
                "user": "u/Sudden-Let8709"
            },
            {
                "text": "Spending time alone.",
                "user": "u/wineblues2"
            },
            {
                "text": "Eating fats like avocados is actually healthy, despite what some think.",
                "user": "u/InflammatorySoapsuds"
            },
            {
                "text": "taking a break",
                "user": "u/shuuchyu"
            },
            {
                "text": "I'm looking for the answer \"Pizza\" .... Can anyone please tell me it's healthy?\n\n\nEdit: so many people making their own pizzas and they all sound amazingly healthy! Thanks for the suggestions....you're all an inspiration",
                "user": "u/robgod50"
            },
            {
                "text": "Silence. We've gotten so used to noise pollution, real silence has become anxiety inducing. Silence improves sleep, helps your brain process what you're learning, reduces stress, lowers blood pressure, the list goes on.",
                "user": "u/thatnameistakenalso"
            },
            {
                "text": "Admitting when you don't know something. Its okay to not have the answer. Too many people would rather bullshit an answer, than accept what they don't know.",
                "user": "u/HumpsyDumpsy"
            },
            {
                "text": "Shocked that no one has said potatoes. They're one of the healthiest foods we know of - packed full of nutrients and vitamins, and carbohydrates. They're nearly enough to live off of entirely on their own. \n\nIt's the oil we cook them in that's the unhealthy part ",
                "user": "u/pusheenforchange"
            },
            {
                "text": "Boredom",
                "user": "u/HaggisAreReal"
            },
            {
                "text": "Admitting when you're wrong.",
                "user": "u/jk013x"
            },
            {
                "text": "Taking care of your mental health is not a weakness, it is a strength to recognize your problems and learn to overcome them.",
                "user": "u/OliviaMandell"
            }
        ]
    },
    "1blsjzk": {
        "post": "What addiction is the hardest to quit?",
        "user": "u/_broWTF",
        "comments": [
            {
                "text": "as a former active H addict i will say i would not wish withdrawals on anyone. they are truly  hellacious. i feel blessed to have gotten out of all that before fentanyl took over, i would be dead now probably",
                "user": "u/breeeepce"
            },
            {
                "text": "Quitting smoking was probably the hardest thing I ever did in my life. And I tried many times before I finally succeeded but I haven’t had a cigarette in 25 years now and I smoked for 25 years.",
                "user": "u/nivek48"
            },
            {
                "text": "Heroin worst shit everwas addicted to it for 7 years heavy, you need it to wake up, eat, piss, shit, sleep, you have to have it to do anything, and getting off is like nothing you can even imagine or compare it to, it literally made me suicidal coming off it, really, like I would have blown my brains out if there was a gun in my reach, I had to get on the methadone program and you gotta take that every single day, sucks. But I'm off dope and off the methadone, clean 6 months and will never in my life touch that shit ever in my life again, it's pure devil's blood. ",
                "user": "u/PhotographNational82"
            },
            {
                "text": "Cocaine was hard. \n\nBooze was harder.\n\nCancer sticks were the hardest. Took me 2 solid years of trying to quit. I’d go 2-3 days then have a whole pack. I finally waited until I got the flu really bad and haven’t smoked on cigarette in 2256 days! \n\nAccording to my app that’s 31578 cigarettes not smoked and over $200,00 not spent. The last pack I purchased was over $17.50 here in California.",
                "user": "u/thunderlips187"
            },
            {
                "text": "Long term benzodiazepines. Maybe deep alcohol use as well. Anything GABA related is hell, benzos if you want to quit often taken months maybe even a year just to get off slowly and then you're not guaranteed to feel normal/good for an extended period of time after that.\n\n\nIt's hell on earth and even heroin addicts will often say they'd rather kick heroin many times over than go through that.",
                "user": "u/muscletrain"
            },
            {
                "text": "I was a heavy smoker for 15 years. Quit cold turkey. Never was addicted to porn. I kicked a cocaine habit. \n\nBeing a high functioning alcoholic is probably something I'll never be able to beat. Trying to quit drinking hurts me physically and mentally so badly, and it doesn't really affect my life right now, so I justify not putting myself through it. I know I am shortening my life by not quitting, but I still just can't do it.",
                "user": "u/Appropriate_Swan_233"
            },
            {
                "text": "Ive heard a Harvard psychiatrist who specializes in addictions say the addiction that's hardest to treat is the one where the patient says that it makes them feel like a normal person. Like it makes them feel like everyone else. Because that's a really hard thing to give up, feeling normal.\n\nDidn't think this would blow up like this, check out Dr K on YouTube and Twitch. u/KAtusm didn't know you were so active on Reddit my bad sir I would have tagged you right away! r/healthygamerGG",
                "user": "u/Mechanists"
            },
            {
                "text": "Food addiction. Because you literally cannot quit, you just have to find a way to moderate your use without ever being able to.",
                "user": "u/BittenElspeth"
            },
            {
                "text": "eating disorders. you can't not eat. people don't have compassion for people who suffer from them either.",
                "user": "u/ShouldBeASavage"
            },
            {
                "text": "Nicotine for me, very hard to quit",
                "user": "u/StarCode5000"
            },
            {
                "text": "Alcohol. Withdrawals don’t just feel bad, it can kill you. So much worse than what we think until we’ve seen it.",
                "user": "u/DangerousMusic14"
            },
            {
                "text": "My meth addiction has proven to be quite stubborn...been sober for a month now...again",
                "user": "u/Lonely-Permit-8202"
            },
            {
                "text": "The hardest addiction to shake is the one that you don't really want to.\n\nUnless you're 100% committed to giving it up it's gonna be hell, no matter what it is.",
                "user": "u/KingGuy420"
            },
            {
                "text": "Food, you have to do it so cant stop.",
                "user": "u/2inchlee"
            },
            {
                "text": "Sugar addiction is surprisingly tough to quit. Its prevalence in various foods makes avoidance challenging, and its impact on the brain's reward system can create a cycle of cravings and dependency similar to more recognized substances, making it a subtle yet significant struggle to overcome.",
                "user": "u/Ok_Recipe_5484"
            }
        ]
    },
    "1b6p5kg": {
        "post": "What’s gotten so expensive that you no longer purchase it? ",
        "user": "u/schaudhery",
        "comments": [
            {
                "text": "Food from food trucks.\n\nI'm not spending $15 for a grilled cheese that I have to wait in the rain for.",
                "user": "u/just_hating"
            },
            {
                "text": "McDonald’s. Wtf happened to the dollar menu?! There ain’t nothing on there that costs a dollar.",
                "user": "u/Bruhhhhhhhhhhhhh"
            },
            {
                "text": "Mobile apps.  \nI’m absolutely infuriatingly tired of subscription services.   \nThe worst is that they let you download the app so they can claim it as a download, only to get stonewalled by a subscription page.  \nLet’s go back to a one time fee please.",
                "user": "u/SmallRocks"
            },
            {
                "text": "At this rate, shelter and food.",
                "user": "u/spjhon"
            },
            {
                "text": "Subway. Even the 6 inch subs are over $7 before chips and soda.",
                "user": "u/ManicPixieDreamPearl"
            },
            {
                "text": "I never buy chips unless they’re some kind of BOGO.",
                "user": "u/SensualEnema"
            },
            {
                "text": "It’s pretty damn expensive just to exist right now.",
                "user": "u/tokinreefer"
            },
            {
                "text": "McDonalds.  Not that I can't afford it, but I am not paying the current prices for cheap, processed food for on the go.  They are trying to be fancier, they should accept who they are and stick to be being cheap and convenient, it has always worked for them.",
                "user": "u/TrixieLurker"
            },
            {
                "text": "Frozen Pizzas are reaching the point of being more expensive than real pizza.",
                "user": "u/SmileAndWalkAway"
            },
            {
                "text": "Concert tickets.",
                "user": "u/Arthur_Boo_Radley"
            },
            {
                "text": "Greeting cards. $7? No way.\n\nEdit: almost 10k likes on this? Damn. Also. I get it. Go to dollar tree. I need a few hundred more people to suggest this please 😆😆",
                "user": "u/Amazing-Gazelle3685"
            },
            {
                "text": "I don't visit nail salons at all anymore ",
                "user": "u/mondaysareturds"
            },
            {
                "text": "I don’t know why I opened this thread expecting anything other than an anxiety attack.",
                "user": "u/Brooke_Whitis"
            },
            {
                "text": "I quit years ago but I saw cigarettes for 13 a pack and holy shit I can't imagine that still. When I quit it was like 4 or 5 dollars",
                "user": "u/JohnGotFit"
            },
            {
                "text": "I just paid $22 per ticket (Australian) for my daughter and I to watch Dune pt 2. Two drinks and a popcorn I think was around $25, so we're looking around $70 for two of us to watch one movie.\n\nI may not be at the point of never going to the theatre again, but it'll be the rare occurance.",
                "user": "u/shontsu"
            }
        ]
    },
    "1bo4a6o": {
        "post": "Tradesman, have women ever offered sex on the job and why did you accept/decline? ",
        "user": "u/RegisterAfraid",
        "comments": [
            {
                "text": "Not my story, but a buddy of mine who was a self-employed welder. He would do calls mostly to ranches, barns, and other rural and livestock type usually repairing gates, corrals, and equipment.\n\nAnyhow, he showed up one day at a stable for 4H kids and was gonna fix some fencing for the paddock. The lady who ran the stables mentioned her husband was out of town picking up a horse they bought.\n\nLong story short, she invited him inside to cool off. This is 102 degree Texas weather so anyone would naturally take the offer. She gave him a tall glass of tea, water, and some fruit to cool off while she went to change. \n\nWithin a couple minutes she came down the stairs in just panties and asked if he wanted to take a nice cool shower. He told me it was REALLY hard to say no, but he declined only because he had been cheated on before and never wanted another man to feel that pain.\n\nEdit: Since a couple people asked:\n\n4H is a program across the U.S. that helps kids and teenagers with development skills in science, agriculture, community outreach, and various other programs. In this case the 4H club was agriculture. So they learn how to ride horses, care for them, feed them, brush them etc.",
                "user": "u/BeyondXpression"
            },
            {
                "text": "I’m a general contractor and had a government contract to rehab and take care of construction stuff in low income apartments. I replaced a GC who was fired because his men kept on having “relations” with the residents in exchange for stuff. So I made a rule where my guys had to be in pairs whenever they entered an apartment.\n\nOn the first day 2 of my guys went into this lady’s apartment to replace the front door because her old one was kicked in. She met them naked and offered to take them both on if they can also get her a new fridge.",
                "user": "u/ZestyGolf7654"
            },
            {
                "text": "Had a roommate do renovation work on the side. Ended up doing a kitchen remodel for a single nurse. As he tells it, they talked and joked around a lot while he was working then one afternoon she commented on his tool belt and asked if he’d ever considered showing up only wearing the tool belt. He ended up staying there for 3 consecutive days pounding his hammer. They are happily married now with 4 kids.",
                "user": "u/DingbatDarrel"
            },
            {
                "text": "Not by themselves. I once had a bloke I did some work for offer me \"a go on his wife\" as payment.\n\nThat's a no from me pal, my invoice'll be in the post.",
                "user": "u/Grim_Farts_Barnsley"
            },
            {
                "text": "I delivered pizzas during covid. I got an order from a familiar address, so I took it, and the woman answered the door topless. She paid for the food, and then invited me in and had sex with me on the couch. It was my wife. She ordered the food so I would deliver it and come have sex with her while I was working. I also got to have leftover pizza when I came home from work. Good day.",
                "user": "u/BrilliantWeight"
            },
            {
                "text": "I had an exteriors remodeling business. Met up for initial consult with a woman I had mutual friends with. As I was getting ready to leave she said “fuck me if I’m wrong, but you can get to my project next week, right?” I chuckled and said “unfortunately not” and told her I was booked out a few months. She said “guess you’re coming in for a little bit now then.” How could I turn that down?",
                "user": "u/Imawildedible"
            },
            {
                "text": "Slightly different take. Worked as a restaurant server. Ridiculous the number of offers of sex you get. I’m not runway model looking. \n\nAlcohol 1000% loosens people’s inhibitions and desire for casual sex.",
                "user": "u/HybridTheory23"
            },
            {
                "text": "Only heard of it happening once. Worker was single and in really good shape. And the woman at the house was married with younger kids. Not sure how it happened but he fell in love with her and ruined her marriage. He went crazy chasing her and she went back to her husband. Word on the street is that her husband ending up leaving her a year later and got to keep the kids and she ended up paying child support and alimony to him after cheating. \n\nIt was lose-lose all around. \n\nOh and the business the husband and wife were running together went under and their handful of employees consequently lost their jobs too.",
                "user": "u/SpecialistWay3804"
            },
            {
                "text": "A friends mom called me once to do maintenance on her late husbands Harley Davidson.   \nI realised it wasnt the Harley that needed a service, when she opened the door nearly naked.   \nI turned around and muttered something about cming back later, which I never did",
                "user": "u/nohajnuts"
            },
            {
                "text": "At 18 I took a swimming pool cleaning job under the impression I was going to be seduced by sex starved stay at home wives...\n\nMy fantasies never came true. \n\nIn fact, the entire month I worked that job I never once saw a homeowner as we always went through their fence.",
                "user": "u/reconfit"
            },
            {
                "text": "When I was a teenager, I was canvassing for a double glazing company. A woman opened the door in her dressing gown and kept making jokes about how she wasn't dressed. She asked if I wanted to wait inside while she changed. Confused, I declined and said I could come back later. She then said that it was really hot outside and told me that if I came in, she'd make me some fresh lemonade. I told her that I didn't want to inconvenience her and had work to do. She told me I could come back later if I got bored. When I met my colleagues at the end of the afternoon and told them the story, they explained what was actually going on.",
                "user": "u/Fortheloveoflife"
            },
            {
                "text": "no, but after the big freeze in Texas I did fix this old woman's broken pipes. she hadn't bathed in weeks. it was heartbreaking honestly. \n\nanyways once I turned the shower on she started crying and kissing me on the cheek and insisting I stay for dinner and that I was a real hero. i had to decline because there were other pipes in the apartment complex to be fixed that night.\n\nedit: now that I think about it, that was the best job I've been on. my coworkers had families to go home to but nobody cared. we were all motivated to get the water back on for this whole complex. late nights and heavy emotions.",
                "user": "u/algernoncatwallader"
            },
            {
                "text": "HVAC tech here, mostly residential. I’ve def seen my fair share of voyeur housewives who will leave doors open when they’re changing. Only time I was ever propositioned was after I had done a repair. She was prob mid 50s but smoking hot. I wanted to since I had not gotten any in a while but I knew it could go south too easily. Hard decision but the smartest.",
                "user": "u/Specialist_Salt_7916"
            },
            {
                "text": "Taught martial arts and a students mom wanted to talk about private lessons for her and her son. So I was like ok but then she was like oh but can we meet at a Barnes and nobles because I will be to busy to talk at the school. So I said fine.\nI got to Barnes and noble and the mom was by herself and we start talking and she says what do I think about older woman and I said they are older. She asked if I wanted to go to her house which I declined. \nShe called the school I work for saying I asked her on a date and I was making sexual advances.\nThankfully I had the texts saved where she asked me to meet her.",
                "user": "u/Genghishahn44"
            },
            {
                "text": "I worked at papa John’s in high school as a delivery driver. One of my deliveries was to a house where a bunch of middle aged women were having a ladies night. They flirted for a few minutes and made some pretty obvious jokes (is pizza the only thing you deliver? Etc.) Before I left, the hostess asked me to swing back by when I got off. Almost 20 years later and I’m still kicking myself for not going back.",
                "user": "u/Mammoth-Instruction5"
            }
        ]
    },
    "1bbtu3l": {
        "post": "What is your deepest darkest secret?",
        "user": "u/RedditMyDiary",
        "comments": [
            {
                "text": "If you ever need help, then please know that there are many qualified people who would like to help you. \n\n* https://findahelpline.com/i/iasp (Global)\n* http://www.befrienders.org (Global)\n* https://988lifeline.org/chat (United States)\n* https://www.samaritans.org/how-we-can-help/contact-samaritan (United Kingdom)\n* https://www.lifeline.org.au/Get-Help (Australia) \n\nThere are crisis services worldwide that are trained to provide support. They are designed to give temporary relief from feelings that are overwhelming you and can help you get through a tough hour/night/week. Chat services, as well as phone numbers, are available on these sites.\n\nJust as you would see a doctor when you are sick, you deserve to take care of your mental health.",
                "user": "u/AskRedditModerators"
            },
            {
                "text": "My grandfather stole a red pepper shaker from an Italian restaurant many years ago. The year after he passed, we went to the same restaurant. In honor of him, I stole a parmesan shaker for a matching pair. R.I.P. Grandpa.",
                "user": "u/AlternianGamer99"
            },
            {
                "text": "I once ate a party platter of delicious tropical fruit during a tour in Honduras and blamed it on monkeys",
                "user": "u/Rumpleshite"
            },
            {
                "text": "I couldn't pick up the pieces after my divorce.  Would go weeks without showering or brushing my teeth.  I found my \"baby blanket\" from my youth in a trunk and wrapped it around myself that night.  Best sleep I had had in years.  I keep it in my bed since then.  I am a 42 year old man.",
                "user": "u/jrwhill"
            },
            {
                "text": "I farted so bad and smelly once they had to evacuate my Spanish class to search for a gas leak.",
                "user": "u/DaiperDaddy"
            },
            {
                "text": "When I was maybe 7ish I went to the grocery store with my mother.\n\nWhen she was checking out I went to turn the gumball machine to see if anyone left quarters in there and didn't spin it all the way.  Well one of them was broken and I spun the sucker until my pockets were full of gumballs.\n\nWhen we got in the car my mother asked what was in my pockets.   And I told her \"nothing\".  She still knows nothing to this day. \n\nShe did however say \"if one of those machines was broken and you just kept turning them, that's stealing.\"\n\nI sure fooled her!",
                "user": "u/firefistus"
            },
            {
                "text": "My dad had a pot pipe made of wood in the garage. I use to smoke out of it all the time because he didn't realize I knew it was there. Anyway, I didn't have a lighter one day and I used a blow torch in the garage to smoke out of it. completely destroyed the pipe. about 15 years later, my dad tells me about how he lost this pipe he made in his shop class in the 70s. Ooops",
                "user": "u/None"
            },
            {
                "text": "My fiancé and partner of almost 8 years broke up with me a few months ago. I’ve realized I was so emotionally dependent on him that I don’t know how to exist as my own person. I have suicidal thoughts sometimes from the stress/pain of not being able to be with him. No one really gets it. I genuinely think I will never love anyone as much as I love him, and I’m scared I’ll end up alone for the rest of my life.\n\nEDIT: Wow, thanks to everyone for leaving such sweet and inspiring comments. I am in an intensive therapy program right now, and have told others (including professionals) about the concerning thoughts and am being helped with those. It really does make a difference knowing that so many others have been through the same thing and have made it out ok on the other side - and for some of you, even better on the other side ❤️",
                "user": "u/yoshi7975"
            },
            {
                "text": "I’ve lived a boring non secretive life, but my great Grandfather once told me a story of when he killed a man with a baseball bat for trying to rob the bar that he owned, and the regulars of the bar stashed the body somewhere and nobody ever talked about it again. He then put his finger to his mouth and said “shh, don’t tell anyone”. So there ya go. Sorry Gramps.\n\nEdit: This happened in Brazil back in the 60’s. Gramps is long gone. Did it really happen? I have no idea, but it was Brazil … something similar to that probably happened during the time it took me to type this edit out. Brazil do be like that.",
                "user": "u/BrazillianNuts09"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "I stole my brother’s Ghostbusters T-shirt and made an email account from the “Shirtnapper” to ransom it back to him as a mystery for him to solve. Unfortunately, he died a few weeks later before never noticing the emails.",
                "user": "u/tessmarye1"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "I want my dad to die. \n\nMy dad is a piece of shit. He has tortured my mom and myself since childhood. He has had condrosarcoma( bone cancer) for 4 years now. I have no remorse for him suffering from this. I'm rather angry that my family has to suffer because of it. I just hope it all comes to an end very soon so that I can live a peaceful life. It's so emotionally exhausting!",
                "user": "u/dankyPranky007"
            },
            {
                "text": "In 1996, I was 6 years old and a friend told me that computer mouse balls were worth as much as gold. Stupidly and with no plan, I stole one from the classroom computer. Our teacher got extremely angry and I got really, really scared I’d get caught. He had us all leave the room and go in one by one so that whoever stole it could anonymously put it back. I was too scared that somebody might see so I didn’t put it back. He exploded on us. The next day, I was going to try to secretly return it, but a kid randomly emptily confessed that HE was the one who stole it and his mom went to the store to buy a new one. He stood in front of the class with a written apology and everything. I should have taken a stand and said “No, Kyle! You didn’t steal it, I did!” Shameful. Anyway, 28 years later, Kyle is a stripper at a gay nightclub.",
                "user": "u/Flashy_Contract_969"
            }
        ]
    },
    "1bof9sy": {
        "post": "What did your friend/random person do that accidentally turned you on?",
        "user": "u/kaushman2",
        "comments": [
            {
                "text": "Once at the cinema with a group of friends I got a coughing fit. One of the guys, who was sitting next to me took my hand and just went gently up and down with his fingers on the inside of my wrist. The coughing stopped but I couldn’t concentrate on the movie anymore.",
                "user": "u/rmnc-5"
            },
            {
                "text": "I was staying at my sisters for the summer and she would order a lot of Amazon packages. Usually the same delivery guy would drop them off, and he was very attractive. I would just see him from the window (I’m super shy) but one day I got the courage and went out to grab the package from him and told him you’re very pretty. He stopped and looked shocked, he said “pretty?” I said yes pretty. He smiled so big and genuinely, he looked so happy like it was the first time anyone had told him something like that. And I melted. He looked even more gorgeous smiling like that. He said “oh wow thank you” and then giddily walked off.",
                "user": "u/Flat-Syllabub-9271"
            },
            {
                "text": "I had a girlfriend in college that Pavloved the ***hell*** out of me. She wore a specific perfume when she came over for \"us\" time vs when we were with a group. I had no idea that smell meant sex to me.\n\nThen, six months after we broke up, working a shift in Target, some random person had that perfume on. Ho. Ly. Shit. I was instantly back in fucking middle school trying to hide my ill timed boner from the world.",
                "user": "u/KhaosElement"
            },
            {
                "text": "Went to ozzfest with my buddy and his very attractive sister and she didn't want get separated from us so she kept her finger in my belt loop or held my hand the whole day, her brother was annoyed because he was trying to lose her all day\n\nUpdate: Didn't know when I got home from work so many people where gonna reply lol. I'm friends with her on the Facebook we are both married and have kids now 🤣. Thanks for the support though guys and girls",
                "user": "u/Jomsviking1776"
            },
            {
                "text": "A lot of these “random” occurrences are just people not realizing they’re being flirted with 😂",
                "user": "u/jeanluuc"
            },
            {
                "text": "Stood extra close to me while looking at a map.\n\nThe context was, he was telling me about an obscure country he was due to go visit a year later, so I asked where it was on the map he had on his wall. He wasn’t sure either, so we both stood up to take a look (he’s taller than me).\n\nKnew it was somewhere in the Eastern Bloc, but the writing on the map was small and we couldn’t see shit. So we both just stood there squinting at this map with our bodies and heads quite close together (closer than they should have been for friends, anyway).\nEventually, we moved so close together that my hip bumped against his thigh. I apologised and started to move away but stumbled ever so slightly - and before I could regain balance, his hand shot out and held my waist.\n\nNo idea if he genuinely thought I was about to fall over, or if he was just using it as an excuse to touch me - but honest to god, my heart was beating nineteen to the dozen. His hand must have only been there for about 5 seconds, but my palms went sweaty, throat went dry…. you name it. Obscure country found, we turned to look at each other and were so close, we were practically stood in each other’s arms. \n\nEnded up breaking eye contact, clearing my throat and moving away, but damn if I don’t get wet every time I think about that moment, even now!",
                "user": "u/bouncing_off_clouds"
            },
            {
                "text": "We were all having our drinks and all, a group of like 7 or 8. There was this girl, friend of my friend and we've just met and were having a good conversation. We were kinda hammered. She was rolling her own tobacco cigs and she kinda sucked lol. She and I were the only ones in the group who were smoking. Then I told her that she was kinda sloppy rolling and I'd do it myself. Rolled one, and when it was time to lick it to seal it, I just held it and she licked it. Without taking her eyes off of mine... damn it shook me to my soul",
                "user": "u/don_pelicano"
            },
            {
                "text": "Rehearsing a show together. I was standing in front of him and asked if my position was ok for his next move. He put his hands on my hips and moved me a step upstage.\nDiscovered I really like that!",
                "user": "u/MrsDink"
            },
            {
                "text": "I was at a bar when a friend of mine came up and introduced the girl he was with. She was visibly drunk and out of nowhere slapped me in the face, slammed me against the wall and started choking me.. but not like super forcefully. A split second later another friend of mine who can be best described as an Amazon women threw her off and pushed me behind her and started screaming in the women’s face while protecting me. I am a large hairy man but in that instant I felt both small and confusedly turned on by both women. Still think about that moment a lot lol",
                "user": "u/whatingobsname"
            },
            {
                "text": "my best friend/roommate and i used to have this bit last year where we would race back to our dorm and see who could unlock the door first. one night i beat her to the door, but she spun me around, pinned me to the door for just long enough to make me wonder what the hell was happening, then threw me out of the way and unlocked the door. \n\nanyway we’ve been dating for ten months now",
                "user": "u/airr-conditioning"
            },
            {
                "text": "\r  \nThis one girl started tickling me. When I started tickling her back, she started to moan and said she was sensitive there.\r  \n\r  \nAwkward walked home.",
                "user": "u/18wentt"
            },
            {
                "text": "I went to a dance party thing with a platonic female friend of mine, who is a bit buttoned up, and she started letting go and dancing like an absolute dork, not giving a shit what anyone else thought of her and it made me instantly attracted to her",
                "user": "u/Apprehensive-Law-923"
            },
            {
                "text": "Really cute girl I had a crush on sat in my lap on the school bus headed home because \"there weren't enough seats.",
                "user": "u/MikeTheHydra"
            },
            {
                "text": "Back on my campus, it’s courtesy to fold someone’s clothes if their clothes were still in the dryer and you needed to use it. Of course, with college boys as they are, it was normal to leave your basket in front of the dryer and whoever needed to use it next can just toss it all in and slide it to the side. Well, one time I had came back from class and went straight to go get my laundry. I opened the door to the laundry room and immediately made eye contact with this shaved cut, buff, ROTC looking guy as he finish folding the last of my clothes in front of me into my basket. It was just the two of us in the room and I swear I was lost in those eyes until he asked, “are these yours?” and I shyly replied, “Yes. Thanks for folding them.” I swiftly grabbed my clothes and walked out so fast.\n\nIt was a small but very kind-hearted gesture. Looking back, I shoulda offered to fold his clothes and befriended him but all my introverted ass could think of at that time was I needed to get out of there quickly. After that, I never saw the guy again. So if this sounds like you, please DM me and let me fold your clothes for you. Patrick Hall was the dorm’s name",
                "user": "u/Gokou01"
            },
            {
                "text": "I went to university with a guy, that was a bit of a gray man. He wasn't introverted as such just had a bit very focused outlook, which could be off putting. \n\nHe contacted me out of the blue a while back, he had completed a project that was without going into details pretty impressive. He invited to me to visit so he could show it off. I thought it was going to be some sort of industry style PR reveal. Instead it was just a 1 on 1 tour.\n\nHe was rightfully extremely proud, and when I realised he wanted to show off to me. It did turn me on massively.",
                "user": "u/Lucy_HR_Prob"
            }
        ]
    },
    "1b6aorq": {
        "post": "What is the most obvious sign a couple won't last long?",
        "user": "u/chiphotog",
        "comments": [
            {
                "text": "\"Having a kid will bring us closer together and things will get better\"",
                "user": "u/ConversationLeast902"
            },
            {
                "text": "I always find couples who post about how much they love eachother on social media break up pretty quick. I'm not talking about like one post but the excessive ones. Recent example being a girl I know who posted probably every other day about how this guy is her world, she'd be lost without him, she misses him when he's not there etc. they were together about 3 months total. I just find it so obvious.",
                "user": "u/JPK12794"
            },
            {
                "text": "Their communication just doesn’t improve over time. Being in my first real healthy relationship I’ve realized that both people need to be committed to their individual and collective growth to create a fulfilling, healthy relationship. If one or both people aren’t trying and make a habit of withholding their true thoughts and make no effort to make the small changes to eventually meet the other half way, it’s inevitable.",
                "user": "u/GodsBleedToo"
            },
            {
                "text": "After I was married about 3 years a coworker that had been married for a few moths asked how long we lasted before we ran out of stuff to talk about. \n\nI figured that was bad sign.",
                "user": "u/donttakerhisthewrong"
            },
            {
                "text": "Different argument styles. Shows contempt for spouse. Talks shit about each other to friends.",
                "user": "u/bkandwh"
            },
            {
                "text": "They casually show signs that they don't respect each other: it can be a lot of eye rolling, mocking, condescending laugh, casually saying \"you're so stupid\", embarrassing in front of friends...",
                "user": "u/smolbibeans"
            },
            {
                "text": "When they act as though they don’t like or respect you. And when you point that out they say you’re being too sensitive.",
                "user": "u/Barrack64"
            },
            {
                "text": "When 1 person really wants a threesome and the other person really doesn't want a threesome.",
                "user": "u/AloofusDoofus"
            },
            {
                "text": "See their conflict resolution process.",
                "user": "u/542Archiya124"
            },
            {
                "text": "One does not listen when one talks",
                "user": "u/New-Bonus5383"
            },
            {
                "text": "Look at their face when they get a phone call from the other person. Tells you all you need to know.",
                "user": "u/No-Conclusion8653"
            },
            {
                "text": "When they fight with each other in a passive aggressive way in front of friends. Went to this dinner once where the guy was showing off his new plasma TV, and it ended up with the girl throwing one of his awards into the TV to smash it. Really uncomfortable to be a guest there.",
                "user": "u/FUThead2016"
            },
            {
                "text": "attempting to transform the other person in its entirety. Never succeeds",
                "user": "u/NoUnderstanding5215"
            },
            {
                "text": "Criticism, contempt, defensiveness, stonewalling: [the four horsemen](https://www.gottman.com/blog/the-four-horsemen-recognizing-criticism-contempt-defensiveness-and-stonewalling)",
                "user": "u/MeanOldGranny"
            },
            {
                "text": "Read an article somewhere where responses to bids for attention are a huge indicator.",
                "user": "u/Aggravating_Horse321"
            }
        ]
    },
    "1bgy0wh": {
        "post": "What is Slowly Killing People Without Their Knowledge?",
        "user": "u/LeosBigBook",
        "comments": [
            {
                "text": "lack of sleep; poor diet, lack of exercise",
                "user": "u/bottomfeeder52"
            },
            {
                "text": "Stress",
                "user": "u/DayDreamerAllDay1"
            },
            {
                "text": "lack of exercise/ sedentary lifestyle",
                "user": "u/Holly__Willy"
            },
            {
                "text": "Bad sleep hygiene. So overlooked as a danger and as a matter of fact even glorified because you are apparently cool that you sleep deprivate.\n\nHere is the bad news: There is no body adaptation to this and the nature hasnt figured out to adapt because we are the only species dumb enough to do this.",
                "user": "u/_HoundOfJustice"
            },
            {
                "text": "Loneliness. \n\nSeriously, people, we evolved as a eusocial species. We don’t just do better when we cooperate in groups, we need extensive contact with a small group of other people to stay healthy. \n\nHow many of us are starved for touch? For hugs and cuddling? For the sound of the voices of our loved ones? Loneliness kills just as sure as heart disease does.",
                "user": "u/Calamity-Gin"
            },
            {
                "text": "Colon cancer.\n\nIt's on pace to be the number one killer in young folk. Early symptoms can be easy to ignore or pass off.  You should always see a doctor if you have any of the symptoms. It's easy to treat if found early but most people don't see the doctor until symptoms have progressed.\n\nI know the American healthcare system sucks. But I got a Colonoscopy (that I had to pay out of pocket since I had no family history and was under the recommended age.) I had 8 polyps, 6 were precancerous. I was 37.\n\nEat your fiber, folks! It's insanely easy to add into your diet and is extremely beneficial to your health. \n\nAnd exercise! You don't have to do anything crazy just get up and intentionally move!\n\nETA: I didn't provide symptoms so people could Google and do their own search (but people are left replies with the symptoms!) My symptoms were literally blood when I wiped that would get better and worse. I also ended up with a fissure (worse than a colonoscopy). I wrote it off as hemorrhoids before finally bringing it up with a Doctor. I did have hemorrhoids and I did have an anal fissure which I don't think were related to the polyps. \n\nETA2: if you have any of the symptoms and your doctor is like \"you're probably fine\" ask for a referral (if you need one) to a GI doctor.  \n\nAlso I am happy to answer any questions. Poop talk is pretty stigmatized and I think there's a lot of embarrassment around it. I also don't want anyone to panic but knowledge is power.",
                "user": "u/myjobistablesok"
            },
            {
                "text": "Birthday cake. I know someone who had some every year, and eventually it killed him.",
                "user": "u/SaulgoodeXL"
            },
            {
                "text": "Alcohol",
                "user": "u/fairygodmother11"
            },
            {
                "text": "Shortening telomeres.",
                "user": "u/JunkRigger"
            },
            {
                "text": "Time",
                "user": "u/FalstaffsMind"
            },
            {
                "text": "Inactivity. If you work an office job that’s extremely stressful and then all you want to do on weekends is veg that’s understandable but at some point you need to get moving. Moving can look like anything though! It doesn’t have to be an intense workout. \n\nGo for a walk \n\nClean your house/apartment etc\n\nDo some light stretches \n\nPLAY! So many people don’t realize how important play is for the body. I get out with my kids and it didn’t occur to me initially how much play movement I didn’t do anymore until I started running around, jumping over puddles and the like with them. So many things we took for granted as kids gets harder as you become an adult. Plus, play is good for our brain and giving us endorphins. GO OUTSIDE AND PLAY! Get a jump rope, get some chalk and make yourself a hop scotch board, jump over the lines and cracks in a sidewalk or parking lot. Move in silly ways and fun ways just move!",
                "user": "u/justhewayouare"
            },
            {
                "text": "Micro plastic",
                "user": "u/seanwhyatt1980"
            },
            {
                "text": "Sugar",
                "user": "u/freedom_the_fox"
            },
            {
                "text": "Sleep apnea. If you have a partner that you sleep with, chances are they are aware, and may or may not have mentioned it. Single people who sleep alone though can realistically go years and years with moderate to severe sleep apnea and be completely unaware. Honestly, it’s up there with smoking and high blood pressure in terms of the damage that it does to your body over an extended period of time.",
                "user": "u/RASGAS23"
            },
            {
                "text": "His song. Softly.",
                "user": "u/ManTania"
            }
        ]
    },
    "1bqxp5a": {
        "post": "What fucked you up for the rest of your life?",
        "user": "u/Cucumber_Block",
        "comments": [
            {
                "text": "When I was nine a saw a classmate of mine get hit and killed by a car. First day of my fifth grade year. Her dad was dropping her off. He saw it happen to. There’s never a day that goes by that I don’t think about it. It’s been 44 years now since it happened.",
                "user": "u/BugImmediate7835"
            },
            {
                "text": "Burning alive in a house fire. The burn ward was the worst part. Half my body is skin grafts",
                "user": "u/RATRICKPATRICK2021"
            },
            {
                "text": "My brother and sister in law’s death. My wife and I were babysitting their 4 month old twins and we get a call that there had been a terrible accident. Go to the hospital and my brother was dead at the scene and my SIL was hanging on by a thread. She passed about 10 minutes after I got to the hospital . Killed by a drunk driver running a stop light. \n\nLuckily we were able to adopt the twins and they’re turning 5 in two weeks. I’m still broken up about my siblings though and I don’t think it’ll ever get better.",
                "user": "u/willi3blaz3"
            },
            {
                "text": "I was on my way to work when I saw a motorcycle accident. It was right before dawn and you couldn’t see very clear, you only had headlights of cars passing by. I knelt next to a guy on his back and could smell blood. I looked down to see his right leg detached from his body from the middle of the shin down. It looked like a chicken leg that was snapped in half. I wrapped my belt above his knee and tried to keep him conscious until EMS arrived. When the sun started coming up, that’s when I noticed his calf muscle inches away from my knee and the amount of blood on my clothes. \n\nI decided to ride with EMS to the hospital a city over. I left my car, keys, cigarettes, and phone on the side of the road. A cop moved my vehicle to the shoulder. It took me almost a year to finally eat chicken again. I’ll never forget when he looked at me and asked if he was going to die. I told him \"fuck no I won’t let you.\" I’ll never forget the sound his foot made when it fell off the gurney onto the metal ambulance floor. \n\nThe guy has made a full recovery. I visited him everyday in the hospital after the accident. He had 6 blood transfusions and two surgeries. He lost his leg from the knee down but now has a prosthetic leg. He’s home with his two kids and fiancé. We talk regularly even now.\n\n\nEDIT TO ADD:\nThis was last year in June. I am a US Army Military Police Veteran. It was thanks to my training while in the military I was able to keep a cool head and do what I did. The police investigation found that he was hit at 90mph. The driver didn’t stop but a bystander got his license plate and he was brought to justice.",
                "user": "u/Comfort_in_darkness"
            },
            {
                "text": "We found my mom :( in the tub cus she overdosed overnight and I tried to get in and get her out but couldn’t. I was almost 12.",
                "user": "u/Tiny-Donut2772"
            },
            {
                "text": "Friend came over to hang out. We got bored and decided to go to his place because he just got the new Xbox 360 for Christmas. His father must of not heard us come in, because 5 minutes later there was a very large bang from his parents room.\n\nSo I got to see what a head looks like after a 12 gauge goes off at point blank. Pretty rough for a 12 year old. My poor friend had to stop going to school because of it.",
                "user": "u/SmellyBenelli69"
            },
            {
                "text": "My Dad having a psychotic episode when I was 19. He was a wonderful father and a very low-key guy. For a month or two beforehand, he had been uncharacteristically animated and had shouted at my mother. I can't recall but I believe by that point he had already been diagnosed with bipolar disorder but wasn't taking his medication. Around midnight, he rolled in one night as I was just starting to fall asleep. I heard him shouting at my mother downstairs and I made my way to my bedroom door. Then I heard my mother scream and I bolted down the stairs. He had her pinned against the back door. He was definitely drunk which was extremely unusual for him.\n\nI threw him off my mother shouted at him to get back upstairs and he started saying a bunch of shitty stuff to me. My mom called his psychiatrist who told her to call the police and ambulance. Before they arrived, my dad came back downstairs and sprinted at my mother again trying to attack her. I threw him to the floor and wrestled him. Eventually the cops got there at which point he had gone back upstairs. When they walked in his bedroom door he was catatonic.\n\nThey took him to the ambulance and rode with him to the hospital. The on call doctor put him on an involuntary hold because he indicated that he would be a danger to himself or others. He ended up spending a month in a psychiatric facility and they got him on the proper medication. He came home and apologized to me and told me that he didn't remember much about what happened other than that he remembered me beating him up and not knowing why. He told me he loved me and thanked me for protecting my mother. He never had another psychotic episode after that but he was never the same again. His health over the past 20 years has deteriorated steadily. He now has type 2 diabetes, heart disease, Parkinson's, and dementia. He can't speak in full sentences anymore or really respond at all. He's also completely immobile at this point. I don't remember the last time he was really the father that I grew up with.",
                "user": "u/hoyahoyahoya"
            },
            {
                "text": "Several things, the one I’ll share is my Uncle’s suicide. He was like a second father to me, unmarried and no kids of his own, my Godfather. Me and my Dad found him in his house. We had to break in the back door after he’d been missing for days. The neighbours told us he called to them to say he was going away “on a course” and he never left the house again. My Dad wouldn’t let me go upstairs when we broke in so I had to just stand in the kitchen and listen to his reaction of finding his brother (my uncle) hanging from the attic. \n\nIt was 2016, I was 30. My dad may as well have died that day too, he’s a completely different man. I sometimes still hear my dad’s screams when I try to sleep. \n\nI now regret typing this because it’s brought it back a bit, but I’m posting anyway cause now it’s written. Oof.",
                "user": "u/Tonyh8su"
            },
            {
                "text": "My Mother. She was a crack addict for majority of my childhood, I used to cry for her to get help because I loved her and she would always tell me i was her best friend. She sold my virginity for crack, I was 11.",
                "user": "u/Consistent_Toe_3306"
            },
            {
                "text": "Watching my mother lose her battle to cancer over a span of 4 years. Then being in the room when she took her final breath. I will never be the same.",
                "user": "u/Pigpentheclown"
            },
            {
                "text": "When I was a kid I had to do some research on my dad's computer. When I got to Google I typed in \"D\" and it displayed the search history and it was \"Divorce neither parent wants kid\".\nYou'd think that would be the hardest part, but in actuality the hardest part was pretending like everything was ok when I ***knew*** I wasn't wanted. I must have been 11, maybe 12?",
                "user": "u/MRECKS_92"
            },
            {
                "text": "My 'dad' dropping me off at the side of the road when I was 15. He was 'nice' enough to help me carry all of my belongings over the RR Tracks and hide them in the cornfield, before hopping in his van and driving off though.\n\n45 years later I am finally starting to be able to trust other people.",
                "user": "u/Royal_Sheepherder69"
            },
            {
                "text": "Coming home one day to find that my wife hanged herself..",
                "user": "u/ButterflyCompetitive"
            },
            {
                "text": "Having to resuscitate my own 4 week old baby",
                "user": "u/I-Really-Hate-Fish"
            },
            {
                "text": "My daughter’s death. I’ll never be the same. I want my bubble back.",
                "user": "u/lcpc_mdqd"
            }
        ]
    },
    "1bmm1dc": {
        "post": "What was the biggest surprise about the other gender that you never knew about?",
        "user": "u/ExtraVex",
        "comments": [
            {
                "text": "That your periods can last for multiple weeks of you are coming off birth control… like wtf, my girlfriend here is bleeding for 2 weeks now and doctors are just shrugging like yeah it’s a typical side effect… crazy…",
                "user": "u/GeneralKosmosa"
            },
            {
                "text": "Men's ball sack change depending on the temperature",
                "user": "u/boredperson1998"
            },
            {
                "text": "When I was a kid, diaper commercials all showed a hand pouring blue liquid into the diaper. Later, I saw a pad commercial that did the same thing. So for years, I thought women lost their bladder control once a month and had to wear mini-diapers. And also, women and babies pee blue.",
                "user": "u/captainmagictrousers"
            },
            {
                "text": "Let's just say things were a bit lower than expected when I first got with a girl lol",
                "user": "u/Glowingtomato"
            },
            {
                "text": "That a guy can accidentally sit on his balls. I assumed they retracted.\n\nETA: I saw it happen only once. Dude fell down hard after.",
                "user": "u/Upvotespoodles"
            },
            {
                "text": "That men don't actually shit for an hour it's their \"get away peace & quiet\" time.\nI was thinking every man had IBS.",
                "user": "u/MojoDuff27"
            },
            {
                "text": "When my wife said \"sometimes women don't want our problems fixed, we just want to vent about them.\" I think my brain broke in that moment",
                "user": "u/DeanOMiite"
            },
            {
                "text": "I didn’t know that peeing for men is so complicated. Apparently it can shoot in different directions and split streams? Why haven’t there been more effective toilet/urinal models?",
                "user": "u/Old-House9005"
            },
            {
                "text": "The woman’s clitoris gets an erection. The tip hardens, the hood retracts, the vagina dilates, and the secretions flow. Neat.",
                "user": "u/nizzhof1"
            },
            {
                "text": "Their peepees float.",
                "user": "u/Next-Firefighter4667"
            },
            {
                "text": "That the penis could possibly get stuck on the zipper. \n\nI'm so sorry fellas!",
                "user": "u/WhileExtension6777"
            },
            {
                "text": "When men are peeing and they see poop stains on the toilet they try to use the force of their pee to clean off the poop stains.\n\nMy husbands biggest shock was he was using the womens restroom and asked through the stall what the little metal boxes by the toilet paper was for",
                "user": "u/Beneficial_Size6913"
            },
            {
                "text": "I grew up in a time where \"women enjoy sex\" was still a relatively-new concept in popular culture.  \n\nOne day when I was in high school, my gf and I ran up to our bedroom to start doing our (relatively new) thing.  I was sitting on my bed and she was kneeling on the floor, both of us completely naked.  She was going down on me, and after a couple of minutes I leaned down and put my hand between her legs.\n\nShe was soaking wet, and I was shocked.\n\nI said \"Hey...you're wet.\"\n\nShe said \"I know.\"\n\nI said \"But...I haven't done anything to you yet.  I haven't touched you at all.\"\n\nShe said \"Yeah, but I've been going down on you.\"\n\nI said \"...And you *enjoy* that??\"\n\nShe said \"Mmmmmm hmm.\"\n\nThat was an educational day.",
                "user": "u/analogkid01"
            },
            {
                "text": "How intense periods can be. It can literally change a person for a couple days, every month. It can also feel like someones stabbing your uterus... every month.\nThats a week out of your life every month battling with mood swings, abdominal cramps and constant bleeding/ mess for up to a week or more.\n\nUtmost respect for women",
                "user": "u/DarkDepths"
            },
            {
                "text": "Ladies can flex their lady parts, making it tighter or looser.",
                "user": "u/ViolinistEast8682"
            }
        ]
    },
    "1bbfm85": {
        "post": "Who are the “evil” people that won in history?",
        "user": "u/jerkularcirc",
        "comments": [
            {
                "text": "Josef Mengele. The Nazi ‘Doctor of Death’ who escaped Germany to South America, started a family and despite being hunted by the US, German and Israeli governments for decades, didn’t even hide his identity by the end of his life. He drowned after having a stroke in 1979.",
                "user": "u/BarryCheckTheFuseBox"
            },
            {
                "text": "Pol Pot got to die in his sleep in 1998. He deserved far worse.",
                "user": "u/bguzewicz"
            },
            {
                "text": "Jimmy Saville.\n\n\nOne of his victims once escaped him, ran into the lobby and shouted that Saville was attempting to assault her. The people there simply laughed and mocked her.",
                "user": "u/Fiddlesticklin"
            },
            {
                "text": "Shirō Ishii  \n\nThe commander of Unit 731 and other facilities that performed medical experiments on human beings during WW2 in Japan\n\nSurgeons would cut open someone without anesthesia, ripping off limbs, or tearing out body parts. They’d sometimes tie a person to a pole outside in the freezing winter and then pour cold water on them to speed up the process of freezing their limbs. Once completely frozen they’d then smash the limbs off with a metal rod. \n\nSome of the most sickest, heinous shit imaginable. The part that angers me the most is that he, along with several others were granted immunity in exchange for information and research. Got away free and never was punished \n\nSkip to 1:17:06 for an interview with a surgeon who worked in one of these facilities \n\nhttps://youtu.be/akLVQdVyGMk?si=pQrcajvXwuW035g-",
                "user": "u/lonely-position162"
            },
            {
                "text": "Pol Pot. Got to grow old after slaughtering millions.",
                "user": "u/writeyourwayout"
            },
            {
                "text": "The guys that tortured Junko Furuta.\n\nThe man who killed Renée Hartevelt.",
                "user": "u/Weekly-Rest1033"
            },
            {
                "text": "pol pot.  he died in exile, if i remember right.",
                "user": "u/fortwaltonbleach"
            },
            {
                "text": "Leopold the 2nd",
                "user": "u/rextremendae2007"
            },
            {
                "text": "The Marcos family. \n\nThis family plundered almost the entire Philippine treasury during Ferdinand Marcos’ two decade rule. \n\nThey were exiled to Hawaii for a few years, but they were able to go back to the Philippines nevertheless. They [Imelda (the wife of Ferdinand Marcos), Imee (the daughter of FM), and Bongbong (the son)] were also able to run for politics again. \n\nDespite the records being unequivocally clear that the Marcoses plundered the Philippine government, (Imelda was actually convicted, but was never jailed for “humanitarian reasons”) the Marcoses are now back. \n\nImee is a senator, and Ferdinand “Bongbong” Marcos Jr. is now the president of the Philippines. \n\nImelda is also still convicted but has still not, and it looks like will never in her life, taste jail time. \n\nTrillions of pesos and tens of thousands of lives lost.",
                "user": "u/CardoDalisay69"
            },
            {
                "text": "Nobusuke Kishi, rapist of Manchuria and twice Prime Minister of Japan",
                "user": "u/Kell_Galain"
            },
            {
                "text": "Idi amin of Uganda",
                "user": "u/Kell_Galain"
            },
            {
                "text": "The answer is the Sacklers.",
                "user": "u/Procure"
            },
            {
                "text": "I've haven't seen Nestlé",
                "user": "u/VincentcODy"
            },
            {
                "text": "A lot of these comments aren't people who won, but people who lost and just didn't get the punishment people thought they deserved.\n\nBut a real evil winner? Try the Dole company and what they did with Hawaii.",
                "user": "u/rowrowfightthepandas"
            },
            {
                "text": "Kim Jong Il. He lived in the lap of luxury while the vast majority of his country lived in abject poverty. He got steak and lobster every night, expensive alcohol imported from all over the world, had a film collection of 20,000 movies including Western films that were illegal for anyone else to own, fucked any woman he wanted, was infallible and worshiped by the very people he was oppressing.\n\nThat slimy little fuck enjoyed all of the luxuries imported from capitalist nations which were illegal for everybody else in the country.",
                "user": "u/dropofred"
            }
        ]
    },
    "1b9e9a2": {
        "post": "How did the State Of The Union ( SOTU ) speech by President Biden go according to you? ",
        "user": "u/CoolConsciousness",
        "comments": [
            {
                "text": "Watch it on C-Span if you haven’t watched it yet. Don’t listen to pundits. Watch it uncut and see Biden for yourself.\n\nwww.vote.gov\n\nEdit:  [C-Span Link](https://www.youtube.com/live/7V01QvlQels?si=r0qFQ4Ig-nHgJJiM)",
                "user": "u/KZED73"
            },
            {
                "text": "“You can’t love your country only when you win”\n\nHell of a powerful statement. \n\nAlso, an hour + is a hell of a long time to talk. I know he has experience doing it but I can barely give a presentation on zoom for my design work for 30 mins. I can do it, it’s just unbelievable stressful to have and stick to a narrative. That’s a skill. I know the dude is old and has a ton of help crafting this speech, but I think he nailed it. \n\nPlus it’s not people like me he needs to convince to vote for him. I already am. I think the people on the fence, I hope this speaks to them",
                "user": "u/_heisenberg__"
            },
            {
                "text": "Hands-down best moment is when he was talking about the Bipartisan Border Deal and the GOP gaggle got itself into a heckle, and as he starts shooting off all the aspects of the deal…\n\n… camera cuts to Jaime Langford, the Republican Senator out of Oklahoma who crafted the legislation and was later censured for crafting the legislation, nodding and muttering “that’s true”",
                "user": "u/Ryan_McL"
            },
            {
                "text": "Did you see the speaker of the house nod in disgust to everything Biden says?",
                "user": "u/Bubbly-Sentence-4931"
            },
            {
                "text": "\"I want to raise teacher salaries!\"\n\nWell, yeah, so do I. Meanwhile in Tulsa, the city is voting on raising the mayor's salary from 110k/year to 190k. Because you know, inflation.",
                "user": "u/d00mslinger"
            },
            {
                "text": "I applauded at my screen when he talked about removing junk fees. Specifically when he said he was going to make cable companies and ticket companies show the final cost at the beginning.",
                "user": "u/dandroid126"
            },
            {
                "text": "The Rebuttal by Katie Britt was epic. It was like a Stephen King demon trying to reassure everyone she was human and not going to eat your liver when you fall asleep.",
                "user": "u/FlyPenFly"
            },
            {
                "text": "I found it funny that MTG wanted Biden to say the name of a woman that was murdered by an illegal immigrant and he used her troll to point out that they wouldn’t vote on an immigration reform bill.",
                "user": "u/yoshisama"
            },
            {
                "text": "I enjoyed it when his populist proposals were booed and he just smiled like checkmate. Made me feel like democracy is still breathing.",
                "user": "u/bluegenera"
            },
            {
                "text": "I thought he did great. Marjorie looked ridiculous and an embarrassment to her party though. Her interruption backfired big time",
                "user": "u/Objective_Regret2768"
            },
            {
                "text": "aside from occasional hiccups, I think it is a great speech. Even Mike Johnson agrees with a lot of his points.\n\nMTG is the typical clown, but looked like Biden was ready with a witty comeback.\n\nThe Republican response afterward was pathetic with bad acting and melodramatic over the top performance though. I’ve seen better performance from elementary school plays.",
                "user": "u/aeolus811tw"
            },
            {
                "text": "Rope-a-dope. \n\nAfter the commentary of the last month, I thought he would get lost on the way to the podium and not be able to put words together. \n\nInstead Dark Brandon showed up with a flamethrower. And for nice contrast, it was followed by “youthful” Katie Britt in the weirdest political video I think I have ever seen. \n\nTo summarize, looks like this old man has still got it.",
                "user": "u/Meany12345"
            },
            {
                "text": "“Biden was too loud, too rude, and relentlessly political.” —Republicans, who support the loudest, rudest, and most relentlessly political candidate ever.           \n\nHe did fine.",
                "user": "u/FabulousCallsIAnswer"
            },
            {
                "text": "Not being American, I'm not going to watch the entire thing. Still, maybe an interesting perspective for you guys: my Dutch newspaper was rather positive calling him fiery, clearheaded, passionate and combative.\n\nEdit: had some spare time today and decided to watch the highlights. Who's that guy behind Biden? He kept shaking his head when Biden spoke about safeguarding democracy, standing for equality and during numerous other parts of the speech. He gave off impetulant child vibes, obstinately remaining seated while the woman next to him stood up, like he's being berated or something. What's up with the dude?",
                "user": "u/Conquestadore"
            },
            {
                "text": "He did well to mention that at one point he was called “too young” (for the Senate). I had not heard him use that retort but I thought it projected strength in to one of his biggest weaknesses.",
                "user": "u/MDJAnalyst"
            }
        ]
    },
    "1befoih": {
        "post": "If you died as an atheist and then met God, what would you say to him?",
        "user": "u/Pristine_Fox_3633",
        "comments": [
            {
                "text": "Oh",
                "user": "u/Amazing_Finance1269"
            },
            {
                "text": "Hey, where have you been?!",
                "user": "u/lonelygalexy"
            },
            {
                "text": "Holy shit God from Bible???????????????",
                "user": "u/theEluminator"
            },
            {
                "text": "\"You won't believe what people down there are doing in your name!\"  \nor  \n\"You need a better PR team\"",
                "user": "u/Strange1_au"
            },
            {
                "text": "So.. ummm... which one are you?",
                "user": "u/neuser_"
            },
            {
                "text": "I’m genuinely as shocked as you are",
                "user": "u/Couldofbeenanemail"
            },
            {
                "text": "After almost 5 years working with pediatric neurosurgery i would just ask \"why?\"",
                "user": "u/Instruction_No"
            },
            {
                "text": "\"...Do you take constructive criticism?\"",
                "user": "u/TOPSIturvy"
            },
            {
                "text": "You don't look like Alanis Morissette...",
                "user": "u/Big-Draw-9661"
            },
            {
                "text": "I'd like to talk to your manager please.",
                "user": "u/findabuffalo"
            },
            {
                "text": "Good job on \"boobs\", big fan",
                "user": "u/nowhereman136"
            },
            {
                "text": "Well, well, well...",
                "user": "u/oldnewswatcher"
            },
            {
                "text": "\"Well, shiet...\"",
                "user": "u/Yisuscrais69"
            },
            {
                "text": "Damn, that's crazy, I was just about to call you...",
                "user": "u/RevolutionaryRough96"
            },
            {
                "text": "Well, you’ve got a lot of fucking explaining to do",
                "user": "u/ghjkl098"
            }
        ]
    },
    "1bcsmoy": {
        "post": "What is the most sexually taboo sounding kink that is actually quite vanilla in practice?",
        "user": "u/ScrewedMyLifeUpSadly",
        "comments": [
            {
                "text": "As you grow older at some point MILFs and GMILFs are just women your own age.",
                "user": "u/Loki-L"
            },
            {
                "text": "My MIL would ask when we were going to have kids, like a lot. So I told her that my technique is good but I'm just not sticking the landing yet.\n\nShe stopped asking",
                "user": "u/intrntvato"
            },
            {
                "text": "Creampie sex is just normal sex.",
                "user": "u/spongystuff"
            },
            {
                "text": "\"Face sitting\" sounded so scary to the British Government they decided to outlaw it. Which is fuckin' wild! But it's basically just Cunnilingus will the receiver on top 🤷‍♂️🤷‍♂️🤷‍♂️",
                "user": "u/bored_jurong"
            },
            {
                "text": "Everyone thinks a breeding kink is normal sex till they see a ten person breeding party",
                "user": "u/hatsnatcher23"
            },
            {
                "text": "Not specifically sex related but Brazilian blow out sounds dirty as fuck and its a normal hair thing lol.",
                "user": "u/bneff81"
            },
            {
                "text": "Having sex with your children's mother.",
                "user": "u/ShutterBun"
            },
            {
                "text": "Most rp in general. It sounds fun like a porno scenario, but it's really just pretending to be or do something else while banging.",
                "user": "u/IceFisherP26"
            },
            {
                "text": "doggy style sounds more taboo than it is",
                "user": "u/lycos94"
            },
            {
                "text": "Uhh...reverse missionary?",
                "user": "u/Loud-Magician7708"
            },
            {
                "text": "I never realised \"Breeding\" kinks were a thing until recently, so it would have to be that. I mean, that just sounds like pretty standard sex to me",
                "user": "u/Benjamin10jamin"
            },
            {
                "text": "Edging",
                "user": "u/realrube"
            },
            {
                "text": "Skinship sounds like something messed up. It's just hugging or holding hands with skin contact. Not even sexual skin contact.",
                "user": "u/DuntadaMan"
            },
            {
                "text": "CNC sounds absolutely horrible until you realize that in the comfort of one's natural, safe surroundings, it's really just an X-Y plot cutting device for wood, plastic, and thin metal\n\nEdited for spelling",
                "user": "u/None"
            }
        ]
    },
    "1brypkg": {
        "post": "What’s the craziest story you’ve heard of a couple breaking up? ",
        "user": "u/ScarTissue5",
        "comments": [
            {
                "text": "Newly married woman (a teacher at a local school) cheated on her husband (also a teacher at the same school) with the principal. They got caught in the act on school property. Both their careers ruined and probably ruined the husbands life. ",
                "user": "u/PioneerDingus"
            },
            {
                "text": "The pretty girl in my class got married and had a kid with a decent guy. She was cheating on him with another local dude. Married dude found out and went to confront the other guy, other guy shot at him, hit him in the back, married guy escapes but dies on the side of a road from gunshot. Shooter claimed self defense and got off, victims family told wife and dude to get out of town or they would get wasted. She took the kid and left town with the guy. Feel bad for the kid living with their dads killer. Far as i know, the wife has never returned.\n\n&#x200B;\n\nEdit: this happened around 2010-2011, Mississippi.",
                "user": "u/McWaylon"
            },
            {
                "text": "Husband was eating breakfast when he noticed a new tattoo on his wife's wrist. It was the name of her new boyfriend. She also would drive down toll roads in his car without paying. When the bills came in, she threw them away. He was on the hook for thousands of dollars when he figured it out!",
                "user": "u/worker911"
            },
            {
                "text": "I don’t know if they broke up but this was how someone found out her pilot husband was cheating on her. \n\nWhen a family in Canada adds a child, they receive a monthly tax benefit. It’s a monthly payment dependent on your income but for a while there was one that wasn’t income tested (it was universal). Mrs Pilot got a higher than normal cheque, so she called our Revenue Agency to check (the CRA). They said it was for baby girl ______ Pilot, born {date}. What happened was her husband had a kid with someone else, other woman gives the baby Pilots last name and lists him as the father and the payment accidentally gets added to the wrong file",
                "user": "u/gratefulelderflower"
            },
            {
                "text": "Well... my ex broke up with me at the beginning of a 10 hour flight. We lived together, and his mother picked us up from the airport..",
                "user": "u/TimelessTravellor"
            },
            {
                "text": "Two of my old high school friends grew up and got married. Both are women. Turns out one was verbally and/or physically abusing the other and the victim divorced her and married the (her abuser’s) father. They’re still together. \n\nI found this out on Facebook.",
                "user": "u/AlaskaStiletto"
            },
            {
                "text": "A truck driver gets married . He and the wife buy a nice house . He’s on the road paying for it . One day he comes home and the wife is gone and six months of bills and a foreclosure notice is on the table . For six months she took every $ he made and kept it for herself until she eventually split with all his money .",
                "user": "u/Wrong-Currency5146"
            },
            {
                "text": "Heard this one from my old hair stylist. She had a female friend who was dating this guy who had a pet pig. It was huge, like a full grown pig. The pig hated the woman and pushed her out of bed to take her place next to her boyfriend. One day, she had enough and told him it is the pig or me. He told her that the pig was there first so he dumped her and stayed with the pig. Man that must have been a blow to her self esteem",
                "user": "u/ega110"
            },
            {
                "text": "I had an old coworker who was almost retired and did one of those dna kits with her husband. He was an M&A consultant who traveled for work for at least two decades. They found out that he had fathered 3 kids that were now adults. Who knows how many more. She divorced him after 42 years of marriage. \n\nI remember her crying in the office very vividly.",
                "user": "u/CherryManhattan"
            },
            {
                "text": "A couple in the blue mountains west of Sydney.\n\nClimbers, indoor  n outdoor. They climbed all day everyday.. it was their life.\n\nHe left her because he was at level 45, and she was at level 41.(can't remember the numbers. But I remember they were close.)\n\nShe was holding him back. So.....adios.",
                "user": "u/dntdrmit"
            },
            {
                "text": "Couple had been dating since middle school, stereotypical teen sweethearts everyone thought they’d get married. \n\nOne day she isn’t at school and he isn’t doing great. She’d tried to kill herself the night before and he wouldn’t say anything about it. It was odd since she had no history of depression and was an all around happy person. \n\nShe finally starts talking to people and what happened gets out. Her boyfriend had been fucking her mom from the beginning. The whole relationship. Destroyed her parents marriage. Dude ended up having to go to a different school over the drama and hate he got.",
                "user": "u/Karsa69420"
            },
            {
                "text": "This one couple i know would purposely break up in public and then make each other jealous by flirting with strangers before they eventually get back together.\n\nLike they would just ego-trip on getting attention from another person before deciding they were too afraid to lose the other.\n\nIt was kind of fun to see which one of them would get more jealous of the other. Although whenever the guy was \"winning,\" she would be a scary level of pissed.",
                "user": "u/LoudBelchStabbyFart"
            },
            {
                "text": "Friend was an underwater welder. Terrible job but pays well, they won't let you work after a certain age though (40?). Friend and partner had bought an amazing house in the Philippines near where he worked, and every dollar was now going into his retirement savings because the career was so time limited. Work was a couple weeks out at sea, then a couple weeks back and so on. One day he gets home from a shift, discovers his partner has sold the house and put all the proceeds as well as all the contents of their (his!) savings into HER parents name and then bugged out. Yes she had been cheating on him. My friend tried, but couldn't get any substantial money back, due to everything having been in both their names, and nothing obvious in the ex partner's accounts anyway. The in-laws were somehow untouchable. So he was close to retiring and living the sweet life in comfort in a glorious home he owned outright... To being nearly washed out of his career and also totally penniless. He moved back to Canada and lived in a crowded shared house with a bunch of 20somethings and started from scratch as a construction worker at 40.",
                "user": "u/867530nyeeine"
            },
            {
                "text": "I have a friend who was very insecure in high school, like... very insecure. She was dating a guy and accidentally farted in front of him. She was so embarrassed that she broke it off immediately after.",
                "user": "u/stevenconrad"
            },
            {
                "text": "Dude was 22, girl was 19. Guy lived in Seattle, girl lived in Mississippi. They met online and fell in love. Guy would fly down every month or two to take her out and spend time with her and her family. He would bring her family gifts every visit. \n\nHer family is absolutely adored Guy, hoping he'd marry their daughter. One of the cutest and most perfect couples ever. Just a romance out of a Disney movie. Almost two years later, Guy decides it's time. Packs his bags and drives across the country to move closer to her. They were both super excited. She was his whole world and his future.\n\nLess that a week after moving, girl cheated on and left Guy for someone with a perm and Harry Potter glasses. Guy drowned himself in alcohol and ended up taking his own life a few months later. He was my best friend. He didn't deserve that. Just a wild situation to break up in\n\nEdit: wow that's a lot of upvotes. Thank you for your kind words everyone. I'm sure if he knew people heard his story and had these things to say, he'd be really happy.",
                "user": "u/EsotericFormula"
            }
        ]
    },
    "1b8xm3n": {
        "post": "If you could telephathically say something to all 8 billion people on earth, what would you say? ",
        "user": "u/ComprehensiveMix2305",
        "comments": [
            {
                "text": "Hi I'm god please send 10% of your net worth to this account \\_\\_\\_\\_",
                "user": "u/JackhorseBowman"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "You’re the chosen one, don’t tell the others",
                "user": "u/RonnieBobs"
            },
            {
                "text": "I would count down from 1000. The resulting hour or so of absolute chaos and panic would be hilarious as I get closer and closer to zero.",
                "user": "u/Skank-Pit"
            },
            {
                "text": "Why have the sacrifices stopped? I'm hungry",
                "user": "u/SurvivingWow"
            },
            {
                "text": "I would just scream, no language barrier just scream.",
                "user": "u/Federal-Bat-7419"
            },
            {
                "text": "*I know what you do when no one's watching*",
                "user": "u/Ellsworth_Chewie"
            },
            {
                "text": "Game saved successfully.",
                "user": "u/Gysburne"
            },
            {
                "text": "\"Stop being a douchebag and start being nice now.\"",
                "user": "u/PolishPower335"
            },
            {
                "text": "Wake up..",
                "user": "u/Turbulent-Role4998"
            },
            {
                "text": "“I’m not sure how this message will reach you, but you’ve been in a coma for the last year. Please wake up. We miss you”",
                "user": "u/heatdish1292"
            },
            {
                "text": "\"Don't do it.\"  \nCould save some lives. Could stop some petty crime. Could prevent a perfectly good wedding from happening. Who knows? Results would be interesting.",
                "user": "u/Eastern_Chemist_803"
            },
            {
                "text": "Be excellent to each other.",
                "user": "u/tguy80"
            },
            {
                "text": "I love you",
                "user": "u/RobbieTheGreat2852"
            }
        ]
    }
}