{
    "1bu2eaj": {
        "post": "What seems to be overpriced, but in reality is 100% worth it?",
        "user": "u/Rice_farmer8",
        "comments": [
            {
                "text": "An Uber home instead of a DUI. Whether it’s court costs, the (more than monetary) costs of an accident, and the issue of having a suspended license. It’s not worth it, don’t drink and drive.\n\nEdit: My most upvoted comment is about not drinking and driving. I’m happy about that.",
                "user": "u/YoloSwaggins991"
            },
            {
                "text": "Good shoes and socks.",
                "user": "u/THGilmore"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "I'm usually a cheapskate but experience has taught me that some things are worth spending money on.  For example:\n\n1. Car wash vacuum cleaners.  So worth it to spend $1.50 or whatever to use one rather than trying to use your own vacuum cleaner.  And, they get your car cleaner much faster than dragging out your home vacuum to try to clean your car with. \n\n2. Electronics.  Buy them new from brand name shops.  It isn't worth hassling to save $10 somewhere and getting something that doesn't work or doesn't have a reasonable return policy. \n\n3. Household help.  If you can afford it get someone to come in and clean your house on a regular basis.  So it stays...always clean, without you having to do anything. \n\n4. Education.  Now this is a big one and far more could be written about it.  Obviously not all education expense is worthwhile, so I'm not necessarily referring to a college degree or whatnot.  But educating yourself - or especially, educating kids if you have them, can return dividends throughout their life. \n\n  \n'",
                "user": "u/TTTT27"
            },
            {
                "text": "A quality sofa. One from What A Room custom sofas, Room & Board, Arhaus or Flexsteel. Don't go for the junk from Joybird, Ashley, Burrow, West Elm, etc.",
                "user": "u/juanisimok"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Professional kitchen knives. You’re not just paying for the ability to cut; you’re investing in less prep time, safer handling, and a tool that, with proper care, will last a lifetime. Don’t undermine your culinary skills with subpar equipment. Remember, a dull knife is an injured chef's first sign of regret.",
                "user": "u/Boring-Leather-1433"
            },
            {
                "text": "Mattress, Shoes, Dental Care, Jacket.\n\nIn that order.",
                "user": "u/Kwinza"
            },
            {
                "text": "A good mattress.",
                "user": "u/CompetitiveLion43"
            },
            {
                "text": "Tailored clothing. Wearing clothing that fits correctly is more comfortable, looks better, and tends to be of a quality that lasts longer.",
                "user": "u/AlanMercer"
            },
            {
                "text": "Quality bicycles. That is if you care about riding bicycles at all.",
                "user": "u/DrYaklagg"
            }
        ],
        "processed": true
    },
    "1c1is9k": {
        "post": "What's the weirdest thing your partner does that you've just accepted?",
        "user": "u/VelvetSophieCream",
        "comments": [
            {
                "text": "When he's alone, he talks to himself in 3rd person, making comments on the things he's doing. \"Ladies and gentlemen, xxxx has done it again, he's made the best omelet in history.. for the 3rd time this month. He's the man of the year. Look at him getting a glass, and opening the fridge.. oooh is he going for orange juice? yes he is! okay now he needs to do something but what was it? ah righttt the toast. The toast, everybody. He almost forgot the toast.\" stuff like that. I'm glad he does it loudly, it's hilarious. Especially when he gets tired and stops mid-sentence but keeps doing what he's doing in silence. Even funnier when he starts speaking again all of a sudden.",
                "user": "u/the_crystal_temps"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "My wife microwaves lettuce. Like when she eats a salad at home, she “warms up” the lettuce. \n\nImagine if you cut off one of your feet and left it to rot for about a week. That’s what hot lettuce smells like.",
                "user": "u/pangderx"
            },
            {
                "text": "She usually dresses normal but sometimes she goes through phases where she dresses like people from different eras. Like a [70s disco phase outfit](https://i.ebayimg.com/images/g/2LwAAOSwnd5i0WpM/s-l1200.webp) or a 80s [rock chick outfit](https://i.pinimg.com/236x/de/ac/46/deac46acff42d01d956f249c23d8b49d.jpg) or a [1950s dress outfit.](https://i.pinimg.com/736x/e0/6c/c5/e06cc53b6c4a9cc950504ebbf008f8df.jpg) It's one thing to do this for a day or something... she will do it for like 3-4 weeks straight, ordering clothes on amazon to make new outfits, wearing the outfits to go grocery shopping or walking the dog etc. And then she rinses and repeats every once in a while. She also will obsessively watch movies from that era when this happens. \n\nShe has been doing this for 20+ years. She is known in our neighborhood for doing this.",
                "user": "u/frogvscrab"
            },
            {
                "text": "\nHe always finds random objects around the house to make into a “hat” for me. \n\nFresh laundry? Hat \n\nRandom plushies? Hat \n\nBubble wrap? Hat\n\nThen he makes one for himself, we take a funny picture and hang it on our “hat photos” wall.",
                "user": "u/brisketball23"
            },
            {
                "text": "When he wakes up in the morning, he puts on ALL his clothes, just to walk to the bathroom, take them off and have shower. Why?? I will never understand that lol",
                "user": "u/Altruistic-Notice707"
            },
            {
                "text": "I don’t know how weird this is, but my boyfriend constantly talks to himself.  He also gives voices to our pets- 2 cats and a dog.  Each pet has a distinct voice and accent.  Some of them have catchphrases.\n\nSometimes when he’s getting ready for work in the morning, I’ll hear him having conversations with the pets and himself in all the various voices.  It’s hilarious and adorable.  Sometimes I catch myself doing it now, too.",
                "user": "u/Cassiopeia299"
            },
            {
                "text": "My husband occasionally talks in his sleep and will also laugh like a little girl in his sleep. It absolutely cracks me up and creeps me out at the same time.",
                "user": "u/Putyourmoneyonme80"
            },
            {
                "text": "My wife is a neat freak, always cleans up after herself and is putting things away. However I noticed that when she runs out of toilet paper she will just take the new roll and stand it on top of the empty tube instead of replacing it. I asked her why she does that and she said “it’s the one thing I allow myself to be lazy about”. I think it’s hilarious.",
                "user": "u/Human-Magic-Marker"
            },
            {
                "text": "My wife says no to almost everything I ask her to do. If I ask her to bring me toilet paper because I’m out, she will say no but then proceed to bring it to me. It’s her way of practicing being able to say no.",
                "user": "u/amdabran"
            }
        ],
        "processed": true
    },
    "1bl4t0w": {
        "post": "What screams “I have depression”? ",
        "user": "u/il_balilla",
        "comments": [
            {
                "text": "Sleeping to avoid living. Even if you’re not necessarily tired.",
                "user": "u/yourstrulyval23"
            },
            {
                "text": "completely tired all the time, even when you don’t do anything",
                "user": "u/Comfortable_Size_658"
            },
            {
                "text": "Constantly in a world in your head. I struggle with living like this. My mind and body are normally never in the same place.",
                "user": "u/SuperCyberWitchcraft"
            },
            {
                "text": "Intense irritation at small things.",
                "user": "u/Sauce_senior"
            },
            {
                "text": "Feeling like it’s a chore to do things that you used to love doing.",
                "user": "u/Accomplished_Item710"
            },
            {
                "text": "Snoozing for an eternity because you know what awaits you when you get up and face the day.",
                "user": "u/ErBoProxy"
            },
            {
                "text": "Just kinda waiting for the day to end each day",
                "user": "u/4applepies1sweetea"
            },
            {
                "text": "Depression doesn’t scream, it would require too much energy.",
                "user": "u/DorkusMalorkus89"
            },
            {
                "text": "losing interest in literally everything and opting to just sleep instead.\n\nat one point i couldnt even bring myself to watch tv or netflix etc., i just did not care. same with being on my phone. then i lost interest in being awake and so sleep, beautiful beautiful sleep, became the answer.\n\nso i would say... that. lol",
                "user": "u/lizzard_lady8530"
            },
            {
                "text": "Gradually pulling away from everything. You hangout with friends less frequently. You start doing the bare minimum at work. Eventually you just stop caring all together and all you want to do is be alone.",
                "user": "u/DiamondCupcake"
            }
        ],
        "processed": true
    },
    "1brn5zf": {
        "post": "What would  be your reaction if Donald Trump dies tonight?",
        "user": "u/kRe4ture",
        "comments": [
            {
                "text": "Well, my reaction would be that you should have a *very* strong alibi for tonight, just in case.",
                "user": "u/allegate"
            },
            {
                "text": "Wouldn't it be really weird if he actually drops dead tonight",
                "user": "u/Glum_Possibility5204"
            },
            {
                "text": "\"You should never say bad things about the dead, only good. Joan Crawford is dead… good!\" - Bette Davis",
                "user": "u/rambleriver"
            },
            {
                "text": "There's absolutely no way the conspiracy crowd would see it as just a normal thing that happens to old people. I'd be pretty worried tbh.",
                "user": "u/AnAdorableDogbaby"
            },
            {
                "text": "Thanks Obama!",
                "user": "u/AdBroad8817"
            },
            {
                "text": "I think it was Mark Twain that said while he'd never wish death on anyone, he's not been too upset at reading their obituary",
                "user": "u/llcucf80"
            },
            {
                "text": "Tonight - this weekend?  Well, it will all depend on if he returns in 3 days.",
                "user": "u/SensitivePineapple83"
            },
            {
                "text": "Look, I was out till 3 AM “all claws no laws” after a metal show last night. I’m bruised and hungover, and all I want to do is eat my weight in eggs Benedict. \n\nBut if I gotta go party with my people, I gotta go party with my people.",
                "user": "u/teebalicious"
            }
        ],
        "processed": true
    },
    "1bvg1wv": {
        "post": "You're given immortality but as a cost you are sent back 3000 years - would you accept and what would you do?",
        "user": "u/ShamKumar7",
        "comments": [
            {
                "text": "I might accept this but I would need more information. 3000 years ago would be like 976 BC. Would I show up where I live now, or some where else? Could I take anything with me. Is immortality just not aging and disease or does it include not being violently killed.",
                "user": "u/Tink2013"
            },
            {
                "text": "Get early shares in apple, back then it’s just the fruit",
                "user": "u/Ok_Satisfaction_6680"
            },
            {
                "text": "Can you choose too die at any point? If not the 3000 years is irrelevant, I'm more concerned about being stuck alone in the void 900 quadrillion years from now. ",
                "user": "u/HMSon777"
            },
            {
                "text": "Like immortality and Im still young? Yeah why not, I would travel with my knowledge to every major event, or at least try.",
                "user": "u/K4T4N4B0Y"
            },
            {
                "text": "In the Netflix adaptation of The Sandman - which is really good by the way - Dream grants a dude the wish to be immortal. The guy lives hundreds of lives, some good, some bad, some awful, but in the end doesn't regret his decision because life moves on.\n\nAssuming 'immortal' includes being impervious to injury/ sickness/ etc then... yeah? Going that far back you'd be considered a deity for surviving fatal occurances. In the modern day you wouldn't but you could have a sick YT channel.",
                "user": "u/zackdaniels93"
            },
            {
                "text": "Immortal without health issues, being a perfectly healthy man with current skills and knowledge, then I am all okay to go all the way 3000 years back! \n\nI can manage to build a better world!!!",
                "user": "u/nextdoorboy_chn"
            },
            {
                "text": "I've done 37 years and already feel about done lol\n\nedit: this isn't a cry for help, just sayin a lot more time sounds like a nightmare.",
                "user": "u/bodycount19"
            },
            {
                "text": "No. No, that sounds awful all the way around. First off I do not want to be immortal second off I do not want to go back to a time when there are no flushing toilets. Yuck!",
                "user": "u/britishbobsyouruncle"
            },
            {
                "text": "Everyone here talking about Apple and Amazon.\n\nNobody talking about reuiniting earth and purging the universe from the mutant, the heretic, the alien.\n\nThe answers here are as boring as in that thread about being giftet 100 billion. \"I'd buy a house and sleep on it so I don't accidentaly blow it all\", like noone had any clue that they were handed an economic atom bomb.",
                "user": "u/Minimalphilia"
            }
        ],
        "processed": true
    },
    "1blsjzk": {
        "post": "What addiction is the hardest to quit?",
        "user": "u/_broWTF",
        "comments": [
            {
                "text": "as a former active H addict i will say i would not wish withdrawals on anyone. they are truly  hellacious. i feel blessed to have gotten out of all that before fentanyl took over, i would be dead now probably",
                "user": "u/breeeepce"
            },
            {
                "text": "Quitting smoking was probably the hardest thing I ever did in my life. And I tried many times before I finally succeeded but I haven’t had a cigarette in 25 years now and I smoked for 25 years.",
                "user": "u/nivek48"
            },
            {
                "text": "Cocaine was hard. \n\nBooze was harder.\n\nCancer sticks were the hardest. Took me 2 solid years of trying to quit. I’d go 2-3 days then have a whole pack. I finally waited until I got the flu really bad and haven’t smoked on cigarette in 2256 days! \n\nAccording to my app that’s 31578 cigarettes not smoked and over $200,00 not spent. The last pack I purchased was over $17.50 here in California.",
                "user": "u/thunderlips187"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Food addiction. Because you literally cannot quit, you just have to find a way to moderate your use without ever being able to.",
                "user": "u/BittenElspeth"
            },
            {
                "text": "Ive heard a Harvard psychiatrist who specializes in addictions say the addiction that's hardest to treat is the one where the patient says that it makes them feel like a normal person. Like it makes them feel like everyone else. Because that's a really hard thing to give up, feeling normal.\n\nDidn't think this would blow up like this, check out Dr K on YouTube and Twitch. u/KAtusm didn't know you were so active on Reddit my bad sir I would have tagged you right away! r/healthygamerGG",
                "user": "u/Mechanists"
            },
            {
                "text": "eating disorders. you can't not eat. people don't have compassion for people who suffer from them either.",
                "user": "u/ShouldBeASavage"
            },
            {
                "text": "Nicotine for me, very hard to quit",
                "user": "u/StarCode5000"
            }
        ],
        "processed": true
    },
    "1bute49": {
        "post": "People who liked Elon Musk but no longer do, what was the turning point? ",
        "user": "u/MeowMamiX",
        "comments": [
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "when he fired his secretary who's been loyal to him for years after she asked for a raise",
                "user": "u/wekoweko"
            },
            {
                "text": "Quite honestly - the turning point was immediately after I started to like him. *As* I was starting to like him, even.\n\nThe problem is that once you learn *anything* about him, you realize what a miserable sack of wasted flesh he is. Once you start looking into his social media presence, the reality becomes literally unavoidable.\n\nSo I thought \"hey, that Musk guy with the solar panels seems like he might be onto something,\" and then one google search later I realized I had been wrong. This was quite a while ago, so his personal opinions weren't yet plastered everywhere.",
                "user": "u/aquariarms"
            },
            {
                "text": "No single turning point, but several things over time. For me the very first moment was when he kept insisting that our world is a simulation based on incredibly flimsy logic and everybody was just like, \"oh yes yes good point Mr. Musk\". Like, I don't have a strong opinion on the idea, but I was sort of turned off by how he had somehow risen above scrutiny at that moment.\n\nThen came the Thai cave rescue incident. I wasn't bothered by him trying to contribute resources to help, even if nobody had asked for it. But the false accusation, calling his critic a \"pedo guy\" IIRC and everything that followed in that story was a big issue.\n\nThen came the Cybertruck. That thing is ridiculous on a practical level, in so many ways.\n\nThen came the actions he took immediately after purchasing Twitter. A lot of really bad business decisions and really poor treatment of people.",
                "user": "u/oldwoolensweater"
            },
            {
                "text": "I liked him when he was focused on making green energy affordable. I remember when he came out with the Tesla Solar Roof, and I thought it was very cool. I still think it's a great idea.\n\nThe turning point for me was when he became more political, when he started going down the \"anti-woke\" and conspiracy theorist path. I noticed that the type of people that were rallying around him were not the kind of people I like or even agree with. And Musk kept doubling down, to the point where he bought Twitter and lost all that money. It just became extremely obvious that he's very thin-skinned and he's the type of person that can never admit he's wrong about anything. Then, of course, he started letting his racism and anti-semitism slip out, but I was way past my turning point by then.",
                "user": "u/ImInJeopardy"
            }
        ],
        "processed": true
    },
    "1by3042": {
        "post": "What is your most disturbing secret?",
        "user": "u/Waltef_j",
        "comments": [
            {
                "text": "When I was around 7 years old, I was sexually exploited and had my toddler photos sold to pedophiles by a maid we hired. \n\nOne afternoon, Right after taking a bath I wanted to turn our PC on, but as a child I was afraid of plugs due to the electricity. So I asked her kindly to plug it in for me. But The maid then told me I should first 'Pose for a photo in the bed' otherwise she wouldn't do it. So, I went to my bed and posed — I had a Giant stuffed teddy bear at the time so I covered my bare body because I somehow knew it was wrong. Then She told me to take the teddy bear off. \n\nShe had also taken photos of my baby brother.\nThe other Maids carefully observed her and eventually told my parents. I watched her cry and beg on her knees, kissing my parents foot.. explaining it was a “Joke” as a kid, I honestly was laughing. \n\nThe police further investigated and found out she had been making a fortune off of the photos she takes of children she was hired to care for. Including me. I've never told anyone even on Reddit because I'm afraid no one will listen — but here I am.",
                "user": "u/grnarpy"
            },
            {
                "text": "My ex-husband told me one time that he didn’t think it was wrong for a father to be sexually intimate with his daughter, as long as she was “old enough.” No one will ever know why we truly divorced, because I don’t think anyone would believe me. He started talking about children. I’d never let my daughter be his.",
                "user": "u/Mistealakes"
            },
            {
                "text": "I was sexually abused  by my aunt at the age of 7-12. She recently got in a car accident and  now she's  paralyzed from the neck down. It sort of brings me  joy that she cant harm other kids",
                "user": "u/Agitated-Try3573"
            },
            {
                "text": "My family think I finished the computer science degree, but I dropped out. However I've been working in the sector for about 25 years in a row without any trouble and people (employers and colleagues) seem to think that I'm quite competent. It's not disturbing per se but for my parents it was a big deal that I finished my studies. My dad passed away three years ago without knowing. My mom is 83 and she is still proud of me and I hope things stay the same till she dies.",
                "user": "u/DeesoSaeed"
            },
            {
                "text": "I have a serious skin picking problem. I can just sit for hours straight in front of a mirror and inspect every pore on my face/chest/hands. It's gotten so bad that i have little scars all over my face. But i literally cant stop doing it.",
                "user": "u/skrozokejpekara"
            },
            {
                "text": "As a teen, I caught my parents' house on fire playing with pyrotechnics in the garage and then staged it to look like an electrical fire so i wouldn't get in trouble.\n\nI was regarded as the hero who put the fire out before it consumed the house (I was home alone at the time), but really, I was the cause.\n\nThey had all of the electrical redone in the house as a precaution against another fire... I never came clean.",
                "user": "u/Spencetron"
            },
            {
                "text": "I hid the remote control to the living room tv for absolutely no reason at all, and kept it hidden for probably a week. My dad began to have a meltdown by the 6th-7th day, so I just put it under a random blanket on the couch where I knew he would find it. What a weird kid I was",
                "user": "u/KittysOnKeyboarghjfg"
            },
            {
                "text": "About 5 years ago, one of my cousins started  messaging me on Facebook, and I realized right away that he was being extremely flirtatious. \n\nI obviously dodged it but tried to do it in a sensitive way, and he wound up confessing to me that his older brother had SA’d him for years when they were kids.\n\nThis man has a wife and (grown) children and lives a life that looks wonderful on the outside, and as far as I know, nobody else in the family has any idea what happened. His older brother also has a wife and (grown) children and lives a life that looks wonderful on the outside. \n\nI don’t know if there is anything I could do other than encourage my cousin to seek help, and I worry that my older cousin just…molested his brother for years and will get away with it.\n\nEdit: I didn’t expect any responses at all, and now I need to clear something up real quick! There are a lot of kind and concerned folks reading my comment who are worried about the older brother’s children. I should have added the detail that both brother’s children are all fully grown with lives of their own; I can see how my wording caused concern, and I’m really sorry for that! \n\nThe abuse to my cousin happened decades and decades ago, and for unrelated reasons, I don’t much speak to that side of the family anymore. \n\nI hope this doesn’t sound uncaring, but this is not my abuse to report at this point, especially since I never witnessed it myself; the only thing my report would rely on was the word of somebody else who doesn’t want his past trauma dragged up and inspected and brought to the light for everyone to see.\n\nIf the abuser’s kids were still living in his house when I found out, I absolutely would have reported it at that time!\n\nI really appreciate the kind and caring responses I’ve had here. Y’all are some good eggs.",
                "user": "u/purseburger"
            }
        ],
        "processed": true
    },
    "1bwf1sq": {
        "post": "What are some really dangerous things most people don’t realize are dangerous?",
        "user": "u/Dani0873",
        "comments": [
            {
                "text": "At the beach, riptide, if you don't spot them and don't know how to get out of one, it can be terrifying and deadly",
                "user": "u/No-Effort6590"
            },
            {
                "text": "Combining different cleaning products can lead to toxic gas in the room.",
                "user": "u/Cutterstrophe_"
            },
            {
                "text": "Falling/knocking people over. hit your head at just the right angle and spot and boom dead.",
                "user": "u/Forward-Essay-7248"
            },
            {
                "text": "Driving while not getting enough sleep.",
                "user": "u/skipabeat123"
            },
            {
                "text": "Visiting the wrong doctor. The general public will never know what makes a good doctor and what makes a bad one. The standard of care you get from one hospital to the next can be life changing...",
                "user": "u/Kovah01"
            },
            {
                "text": "Hiring the “cheapest electrician” to change the basement fuse box… 💥🔥⚡️☄️",
                "user": "u/SpecialistWay3804"
            },
            {
                "text": "Moving water.\n\nIt can only take 6 inches of fast flowing water to knock you over, and double that can float a car.",
                "user": "u/NarrativeScorpion"
            },
            {
                "text": "Tooth infections",
                "user": "u/m1racle"
            },
            {
                "text": "Tailgating, especially at speed.",
                "user": "u/Demonyx12"
            }
        ],
        "processed": true
    },
    "1btpxjf": {
        "post": "What is something that most people don't know?",
        "user": "u/TechSavvy_Ryan",
        "comments": [
            {
                "text": "Ctrl Backspace deletes the entire word.",
                "user": "u/Brueguard"
            },
            {
                "text": "Squirrels run faster up trees than on flat surfaces.",
                "user": "u/sstebbinss"
            },
            {
                "text": "Most the people involved in the Hindenburg disaster lived.",
                "user": "u/CaligulaMoney"
            },
            {
                "text": "irukandji jellyfish grow only to about 1 cubic cm in size, but have an incredibly painful sting. One symptom of the sting is a strong impending sense of doom. Victims have begged their doctor to be killed as they were certain they would die anyways.",
                "user": "u/NikkiRex"
            },
            {
                "text": "You can collapse your lungs from laughing.",
                "user": "u/ContentTask2032"
            },
            {
                "text": "A company called Warner Chappell Music collected licensing fees for use of the song “Happy Birthday to You” all the way until 2015. That’s why characters in movies often sing other songs like “For He’s a Jolly Good Fellow” and restaurant chains often have their own birthday songs they sing to customers.",
                "user": "u/ItsMeCourtney"
            },
            {
                "text": "battleships in museums/ on display that are WW2 and later cannot start their engines because they have preservative grease inside in case the Navy has to bring the ship back into service.",
                "user": "u/Stravata"
            },
            {
                "text": "A burial plot is called a graveyard if it's part of a church lot. It's called a cemetery if separate.",
                "user": "u/Missusmidas"
            },
            {
                "text": "Sharks predate trees",
                "user": "u/External_Crazy_6568"
            }
        ],
        "processed": true
    },
    "1c5tcbu": {
        "post": "What popular consumer product is actually a giant rip-off?",
        "user": "u/EnchantedSophia",
        "comments": [
            {
                "text": "Many luxury skincare products have markups based on brand reputation rather than effectiveness, with similar ingredients as much cheaper products.",
                "user": "u/BeautifulGuarantee19"
            },
            {
                "text": "Herbalife. Nutrition Shops. Those shakes are just Herbalife.",
                "user": "u/vintagepoppy"
            },
            {
                "text": "fabric softener. every authority i’ve seen agrees that it’s bad for your clothes and your washer",
                "user": "u/itisthemaya"
            },
            {
                "text": "Dr. Dre does not have a degree in headphones.",
                "user": "u/Shh-poster"
            },
            {
                "text": "Any compression sleeves with copper or magnets in them.\n\nThe compression is fine.  But the copper or magnets do nothing.",
                "user": "u/DreadPirateGriswold"
            },
            {
                "text": "NFTs was probably the funniest thing I’ve ever witnessed",
                "user": "u/Ismokeradon"
            },
            {
                "text": "Designer eye glasses. Luxxottica is a monopoly that controls most of the market and commands a premium for cheap plastic glasses.",
                "user": "u/ethsmither"
            },
            {
                "text": "Telescope enthusiast here.  The scopes you see on a shelf in a store are almost exclusively garbage.  Research it a little and buy online.  Do not buy that scope you saw at Costco.\nIf you really want one of those crappy scopes - go on FB marketplace and you’ll find people basically giving them away, and for good reason.",
                "user": "u/nautius_maximus1"
            }
        ],
        "processed": false
    },
    "1bytmwv": {
        "post": "What addiction is seen as completely normal by society? ",
        "user": "u/whoam_itho",
        "comments": [
            {
                "text": "mobile scrolling",
                "user": "u/Beauty-Corner"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Some folks just can't see that they're always competing with others and wonder why they aren't liked. So, they try even harder, but it's a never-ending cycle. They'll never be happy with what they've got in life.",
                "user": "u/Single-Cartoonist124"
            },
            {
                "text": "infinite scrolling in apps",
                "user": "u/Potential-Tone-3628"
            },
            {
                "text": " Caffeine and sugar",
                "user": "u/notCRAZYenough"
            },
            {
                "text": "Being a workaholic",
                "user": "u/Patient_Effective_49"
            },
            {
                "text": "Coke. I know people that don't remember the last time they drank water.",
                "user": "u/Nyanzerfaust"
            },
            {
                "text": "Caffeine.\n\nThe amount of coffee I've seen people drink all on ambition to \"get through the day\" is rather alarming.",
                "user": "u/Jncocontrol"
            },
            {
                "text": "Honestly I think alcohol culture. Especially here in Australia, I can’t talk for other countries. Everyone is so dependant on drinking it’s a shame",
                "user": "u/d4ddy1998"
            },
            {
                "text": "TikTok",
                "user": "u/EngineDigital2796"
            },
            {
                "text": "Shopping and overspending.",
                "user": "u/Lunakill"
            }
        ],
        "processed": false
    },
    "1c2ubv0": {
        "post": "What’s the biggest scam in tech that has become widely accepted?",
        "user": "u/cutypatotie",
        "comments": [
            {
                "text": "“We have changed our terms of service.  Click here to accept and continue using our services.”",
                "user": "u/sunnyspiders"
            },
            {
                "text": "Unsubscribe button not being honored. Tactics include:\n\n1. It takes 15 days to unsubscribe but 1 min to subscribe.\n2. Sometimes link does not exists at all.\n3. Sometimes it takes you to a non existent page.\n4. Sometimes it asks you to login but you never had an account.\n5. Sometimes they will randomly send emails even after unsubscribing , especially around holiday season. Like out of the blue they will email, I think they got a new incompetent marketing guy.\n6. Them not realizing that they product they sell is not something I buy or need on a regular basis. Eg: indochino , how frequently do you think I buy a new suit.\n7. The whole marketing email is an image and not an html. Clicking on it just opens the image or takes you to home page (mostly sites from India )\n8. Somehow referencing the canspam act and sending it to their privacy email stops all the emails suddenly. But the. Point 5 happens.",
                "user": "u/kindrudekid"
            },
            {
                "text": "Trapping customers with subscriptions",
                "user": "u/YJeezy"
            },
            {
                "text": "Printer cartridges",
                "user": "u/mica280amg"
            },
            {
                "text": "Non-replaceable batteries. ",
                "user": "u/whittlingcanbefatal"
            },
            {
                "text": "Subscription with ads. Ads was only widely accepted because “we had to maintain our work somehow”. Ads ruined the internet.  \n  \nThen subscription came along, fine a paid version to get rid of those pesky adverts.  \nBut hey ho, let’s get more money from both sides.  \n  \nAlso, premium content.  \nAll content use the same platform.  \nThey are forced to do extra work to separate content in the delivery and choose which content is premium.  \n  \nIt’s a scam on top of their subscription scam.",
                "user": "u/ImTalkingGibberish"
            },
            {
                "text": "Everything needs an app.  Especially physical devices.  I don't want your cheap buggy app to use my thermostat, scale, battery, lock, or light bulb.  Ship one if you want, but devices should conform to standards-based, documented protocols so I can control them however I want.  I also don't want to install an app just to do something that works just fine on a website.\n\nAlso requiring Internet connectivity is crappy design.  I don't want basic functionality depending on your servers being up (and requiring accounts and giving you unknown data).  My whatever should not stop working because you decided to stop spending money on the servers.  This is bad with software but egregious with hardware and unacceptable with household devices (my water heater should never depend on outside servers).\n\nI've been in tech a long time.  While greed and control and access to sellable data drives lots of things, there is also an attitude surviving from the 90s and 00s that the lifespan of anything is a few years.  This attitude infects product design even in fields where lifespans are decades and replacement costs are high as we add compute to everything (which can be a great thing).\n\nUSB was successful not because it had one (ish) plug, but because it standardized the protocols devices used.  All mice speak one protocol, so anything that knows it (hci class) can handle any mouse.  Zwave and ZigBee tried to do this for household stuff, but instead we got vendor proprietary, Internet connected, phone-home, WiFi devices.\n\nRant done.",
                "user": "u/darthsata"
            },
            {
                "text": "Here’s a new product! (Uber! DoorDash! Amazon!) It’s so cheap and easy! \n\nOne year later: Sorry! We had to raise prices! Sorry, you have to pay for a membership now! Sorry, we had to make the app really confusing so you’re not really sure what you’re buying! Sorry, you have to wade through 1 million ads to find what you’re looking for!\n\nSorry, not sorry!",
                "user": "u/r33c3d"
            },
            {
                "text": "Everything as a service",
                "user": "u/redditmethisonesir"
            },
            {
                "text": "Apps and accounts for *eeeeeeverything*. Especially when it could just be a website with guest checkout. I'll never go to McDonald's again because you need an app to get their real, ~~affordable~~ **non-absurd** price, and last weekend I tried skiing at Pico or Magic, but they needed an account to be created online, and you could only buy a ticket through the account. They didn't let you just walk up to the ticket window and buy a ticket. Ridiculous.",
                "user": "u/i_drink_wd40"
            }
        ],
        "processed": false
    },
    "1bk5rgs": {
        "post": "Police officers of reddit, what are some things innocent people do that make them seem suspicious?",
        "user": "u/NeatEhEff",
        "comments": [
            {
                "text": "I know this isn’t what was asked, but I’ve always been told, if you want to look inconspicuous around police, pick your nose. Nobody picks their nose if they think they’re being watched",
                "user": "u/Altruistic_Box_8307"
            },
            {
                "text": "Retired police here from UK. Innocent people seem to confess everything even when not a crime as they're so desperate not to be in trouble. Example  - knocking on doors for information. Guy answers door and immediately started to confess his tyres are a little bald and he has some dodgy cigarettes and he did accidents drop some litter. Like dude..chill out, it's fine.",
                "user": "u/None"
            },
            {
                "text": "Former LEO.  I can tell you the most helpful thing for you, yet most infuriating (to the LEO) is to keep your mouth shut.  Just, you know, quit talking.  It will be much better for you in the long run.  I was never looking to just jam somebody up, but man people get themselves in so much trouble with their mouth.",
                "user": "u/Intrepid-Bison-2016"
            },
            {
                "text": "I was a fire investigator for awhile. It was talking a lot. Now some people just talk a lot when they get nervous and that's easy to tell. Like those people aren't actually talking about anything, they're just saying words at you. \n\nThe suspicious ones are the ones who are clearly trying to talk you directly to where they've set up their diversion but can't just stop talking about it and adding more and more and more details. To the point where they've \"remembered\" too much about what happened.",
                "user": "u/fireinvestigator113"
            },
            {
                "text": "I had an officer clarify unintentional suspicious activity, if it helps. \n\nIt was a super hot day, and an officer was just sitting in his car in the hot sun in the parking lot with his window rolled down. I was walking to my car and told him it was pretty hot out and I was heading to taco bell. Asked him if he wanted me to grab him a drink or something while I was there. He said no, he was good. So I hopped in my car and started to pull out of the parking lot. I noticed the officer started pulling out of his spot. I started driving to taco bell down the road, and sure enough, the officer was following me. I pulled into the taco bell parking lot and parked. The officer pulled up his car behind mine blocking me in. He started asking all sorts of questions about my personal life, where do I work, and so on. He eventually just said, \"What you just did was SUPER suspicious.\" I asked how being nice to someone is suspicious, and he just put it into drive and drove off. I started walking into taco bell and noticed he discretely pulled into a parking lot across the street. I know the taco bell peeps pretty well, so I went in there for an entire hour just chillin, eating, and generally socializing. Afterwards, I left, started driving to a gas station, and the officer pulled out of the parking lot and started following me along with TWO other police cars. Suddenly I had 3 police cars just following me all over town for the next 15 minutes. They eventually pulled away and that was it. \n\nSo I guess being nice to police officers is considered extremely suspicious. :/",
                "user": "u/RpTheHotrod"
            },
            {
                "text": "\"I'm not a cop but\"... Never change reddit",
                "user": "u/Jakewolf123"
            }
        ],
        "processed": false
    },
    "1bnbhjm": {
        "post": "[Serious] What are realistic ways someone can make $300-$1000 a month outside of their day job?",
        "user": "u/GothamKnight3",
        "comments": [
            {
                "text": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies.\n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
                "user": "u/AutoModerator"
            },
            {
                "text": "Call your local car dealerships and ask them if they need drivers. \n\nThey usually need people to go grab some cars from other dealerships around your state or province during the weekends. They will pay cash and all you need is a driver's licence. \n\nMy dad is retired and he does this when he needs a bit of extra cash.",
                "user": "u/lordpanda"
            },
            {
                "text": "Get added to some catering company's on-call lists. They'll hit you up when they have larger events and need more staff. Usually pays about $25-$30 an hour. Sometimes more in HCOL areas. And you generally get gratuity.",
                "user": "u/wannaloseitloseit"
            },
            {
                "text": "Not even kidding, I use to help my mother-in-law shower her mother every Thursday for $50 (a day!)  \n\n\nShe had a bingo group, and my name got passed around, and now I have a very real side gig cleaning old people... but it's solid money.",
                "user": "u/a_burdie_from_hell"
            },
            {
                "text": "Dog or cat sitting. I used to do this around twice a month and could make between $300-500 depending on the length of the job.",
                "user": "u/hinleybear13"
            },
            {
                "text": "Dog walking - I make a $1000 a month walking two dogs a day (20 mins each), down the street from my house during lunch break.",
                "user": "u/pradaquasimodo"
            },
            {
                "text": "Piano tuning.\n\nTakes a bit of time to learn, but the hardware is relatively inexpensive, and once you’re good at it, you can have a piano tuned in less than 2 hours. Standard pay is between $100-$150 per tuning. And in most metro areas, there is more work than there is tuners to do it all.",
                "user": "u/jerryondrums"
            },
            {
                "text": "I drive a wealthy old lady who (wisely) no longer wants to drive herself. Once or twice a week and only if I have the time. My fee is $39/hr. Most of the time she goes to a phys rehab center that's two minutes from where I live. I drop her off, she tells me how long she'll be, I go home and faff around on Reddit or play with the dogs, and pick her back up again when it's time.\n\nBonus: After her husband passed away, she wanted me to have his wine collection (she doesn't drink). I demurred but she insisted, so I took about 175 bottles over the summer. Some of the them are worth four figures.",
                "user": "u/DaytonaDemon"
            },
            {
                "text": "I became a notary in my state and take mobile signing whenever I can. I work a normal 9-5 and do loan closings probably two or three times a week.\n\nSigning can pay anywhere from $30 an instance to $250 an instance",
                "user": "u/Trinimaninmass"
            },
            {
                "text": "There was a high school kid with one of those spinning pressure washers that came to my neighborhood and knocked on people’s doors and asked if they wanted their driveways pressure washed right then and there for just $50. Didn’t take him long and he easily made over $500 in that afternoon.",
                "user": "u/hobbitybobbit"
            },
            {
                "text": "If you live near a university or academic medical center, there are some research studies that pay decently well",
                "user": "u/bonc826"
            }
        ],
        "processed": false
    },
    "1bnpw0j": {
        "post": "What's weird about your body?",
        "user": "u/Jesus-Chr",
        "comments": [
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "My proportions are all over the place.\n\nI used to study art. In drawing class, we had to study human proportions using our hands in strange positions and our bodies in front of a mirror. I got a bad grade, was told that my proportions were wrong. I had to go show the teacher that, yes, my thighs are unusually long, my pinkies abnormally short etc. \n\nMy grade was changed",
                "user": "u/isabellepeppergreen"
            },
            {
                "text": "I was born with a webbed hand. Had a bunch of surgeries to correct it but my hand is smaller than my normal hand and my co workers call me Tiny Paw",
                "user": "u/buckeyemountain"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "My fingerprints have almost faded away.  I’m 56, and I can’t use those fingerprint readers for anything.  It happened to my mom, and now my 31-year old daughters are going.  It’s weird!",
                "user": "u/feelingmyage"
            },
            {
                "text": "My right ear has a little point at the top… like an elf. My son’s right ear has a notch, like it’s missing the extra I have… weird!",
                "user": "u/Heardaboutthat"
            },
            {
                "text": "My body does not make it's own antibodies. So once a week for the last 15 years, I've had to get an infusion of antibodies that are pulled from plasma donations. \n\nIf you donate plasma- thank you for keeping me alive!",
                "user": "u/stumphead11"
            }
        ],
        "processed": false
    },
    "1bpg9du": {
        "post": "Women of reddit, what are some unwritten examples of girl code?",
        "user": "u/Specific-Voice3301",
        "comments": [
            {
                "text": "That look that says “help me leave this conversation/interaction”.",
                "user": "u/Apprehensive_Pickle3"
            },
            {
                "text": "Wait until your friend gets inside before pulling away",
                "user": "u/Flutterflut"
            },
            {
                "text": "Always watch your friend's drink if she leaves on the table in a club.",
                "user": "u/AshamedClassroom413"
            },
            {
                "text": "Help a girl out when she is stuck with period problems \n\nHelp a girl out if she’s sexually harassed, followed etc",
                "user": "u/PeterDuttonsButtWipe"
            },
            {
                "text": "if a random woman comes up to you pretending to know you, you’ve know her for your whole life",
                "user": "u/Emergency_Can_8"
            },
            {
                "text": "If a woman compliments your dress and it has pockets you must immediately put your hands in said pockets and say the words “IT HAS POCKETS!!!”",
                "user": "u/big_data_mike"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "If you have the means, spare a square.",
                "user": "u/Equivalent_Delays_97"
            }
        ],
        "processed": false
    },
    "1bkp6qk": {
        "post": "What is the oddest thing you thought was ok/normal and ended up being a medical problem?",
        "user": "u/Prudent_Tip4118",
        "comments": [
            {
                "text": "I thought I pulled a muscle playing with my dogs one day. One week later I finally go to the hospital because the pain is getting worse. Turns out I suffer from a genetic blood clotting condition and had a two foot log clot in my leg and multiple pulmonary embolisms on my lungs. Doctor was legit surprised I was alive.",
                "user": "u/EchoRespite"
            },
            {
                "text": "It took my lungs collapsing at 17 years old before doctors realized I wasn’t breathing in deeply enough to expand the bottom half of my lungs for basically my whole life. They asked why I never complained about shortness of breath. I never knew breathing was supposed to be easier than what I was experiencing.",
                "user": "u/honeybeebzzz"
            },
            {
                "text": "Until I was 16 I thought everyone got stomach cramps a few times a day. Turns out I'm lactose intolerant. ",
                "user": "u/go_eat_worms"
            },
            {
                "text": "My family told me I would randomly “space out”, although I never remembered, all thought it was normal. Turned out, I was having “absence seizures”. We only found that out at a routine doctor’s appointment, just conversing with the doc, when I guess I just came to and the doctor said she wanted to get a bunch of tests done. Been an epileptic for almost 17 years now.\n\nEdit: I woke up to all these upvotes and replies and was shocked, tbh to see how many of my Reddit fam has or had what I have. Unfortunately, my Epilepsy has evolved into tonic clonic seizures, I rarely have absence’s anymore, but had one focal back in November. For anyone who has friends and/or family who has seizures and Epilepsy, thank you for being there for them. Just know, we appreciate you all. For all that HAVE seizures and Epilepsy, UNITE!!! Love you all Reddit fam, you’re the best.",
                "user": "u/Loves_me_tacos125"
            },
            {
                "text": "That pulled muscle was actually a collapsed lung. After days of hot baths, massages, trying to relax-nah, nothing helped. No wonder.",
                "user": "u/bmbmwmfm2"
            },
            {
                "text": "Losing weight suddenly got a little easier, and I assumed it was due to my efforts. Happy with my success, I buckled down harder (funny how it's easy to keep \"being good\" when you're actually seeing results). I lost more! It actually got to be almost easy. I thought I was doing such a great job! Turns out it was cancer. I guess I should have known something was up, but I honestly thought I was just doing a really great job with my diet and exercise. Had 4 surgeries and treatment and I'm doing well. Now I'm on meds with all kinds of side effects, including weight gain. Yay. But I'm alive, and so much better off than many others. I've only gained a little bit back, despite working really hard not to.",
                "user": "u/Grilled_Cheese10"
            },
            {
                "text": "As a kid I had anxiety and my heart would\nrace.  Fast.  It felt like a hummingbird in my chest and would abruptly pause and resume a normal pace after a few minutes.  \n\nAt age 23 I had a bad reaction to a tricyclic antidepressant called imipramine and was rushed to the hospital. They ran an EKG and that rapid heart rate was a congenital defect known as Wolfe Parkinson White syndrome. \n\nBasically I had an accessory or 2nd electrical system in my heart that would cause a  “short circuit” occasionally and my heart rate would skyrocket.  It was cured via a procedure using radio waves to form scar tissue around the accessory node because the impulse could not conduct through the tissue. \n\nNo problems since.",
                "user": "u/Ambitious_Doubt_1101"
            },
            {
                "text": "A random sharp pain above my right ear and my tongue curling slightly.  I thought it was just old age. Doc recognized it instantly as something wrong with my tongue.  The cancer has been cured for seven years.",
                "user": "u/cwsjr2323"
            }
        ],
        "processed": false
    },
    "1c0w1gr": {
        "post": "What family secret was finally spilled in your family?",
        "user": "u/kaushman2",
        "comments": [
            {
                "text": "My aunt didn't lose her teaching job due to budget cuts like she'd always claimed. Turns out she had never had a valid teaching license to begin with, regularly had affairs with the dads, and embezzled PTA money!",
                "user": "u/itsjustmo_"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "That my dad's little sister wasn't really his little sister.  It was his sister's baby, raised by his mom.  The girl didn't know until she was 21.",
                "user": "u/Ok-Thing-2222"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "My sister and I found out in our mid/late-20s that we had a full-on brother. Our dad got our mom pregnant in high school and cause it was the 60s it was all hush-hush and she went to do her senior year “with family” and just quietly came back to town. They ended up getting together for real in college and no one knew - not their life-long friends or even my uncle. Our brother had a good childhood with his adoptive family, but he was always curious about his birth mother so he wrote her a letter. He sure was surprised to also come to meet his dad and two sisters. Crazy thing is he didn’t live too far away and we all look extremely alike. Would have been weird if we’d have bumped into each other otherwise.",
                "user": "u/LazyLeslieKnope"
            },
            {
                "text": "My mother is kid #7 of 10. My aunt (kid #4) who was born in 1945 did her DNA and found out that she has a different father from everyone else. She was devastated. There was always rumor that there was an affair but nobody talked about it. She has so many questions but nobody's alive to answer her.",
                "user": "u/bossykrissyCC"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            }
        ],
        "processed": false
    },
    "1c3yv0n": {
        "post": "Women of Reddit who chose to be a “side chick” to a taken man, why did you do it? How did it end?",
        "user": "u/FinalEntertainment60",
        "comments": [
            {
                "text": "He left her for me, I married him, he cheated on me with her hahaha 💀💀💀",
                "user": "u/RoutineBanana4289"
            },
            {
                "text": "I had a friend that cheated on all her partners or dated other friend’s partners. She was extremely attractive and seductive. She knew exactly how to get any man. The day she told me she slept with our mutual friend’s boyfriend, I knew I couldn’t trust her. Our friendship fizzled out months later.",
                "user": "u/Remarkable_Rub_701"
            },
            {
                "text": "I didn't know for two years. When I confronted him about making plans on FB to move in with another chick and accused him of having another women, he told me that technically I was the other women, but she was willing to let me move in with them.  We broke up and he moved in with her a few months later.\n\nA year after we broke up he called me complaining that she wasn't financially responsible and wasn't able to run a house as well as me. He asked me to move to Florida with him. I laughed at him and said he should have thought about that before telling me I was the other woman.",
                "user": "u/darklinghate"
            },
            {
                "text": "I was 19, he was 39 and my manager. Now that I grow up and I see things from an outside perspective I feel completely disgusting about the whole situation and I feel very bad for her cause she never knew and I believe they got married in the end. Sorry not much to say I just need it to take it out of my chest...",
                "user": "u/effs19"
            },
            {
                "text": "He told me he left her.  He didn't. So I chose to out him to her every chance I could get. Ie. He'd send me letters apologizing or begging we stay together, so I'd mail them to her workplace so she could see what a loser she has.  Welp... he died at age 35,  she got a $950,000 insurance payout, and I was left salty and bitter.  Lol",
                "user": "u/Immediate-Ad-6364"
            },
            {
                "text": "Because I have major commitment issues and the idea of a low-maintenance \"relationship\" is the dream. Spoiler alert: it ended with me feeling like a complete idiot.",
                "user": "u/Adventuroussexy"
            }
        ],
        "processed": false
    },
    "1bo3573": {
        "post": "What was affordable 50 years ago that now only the rich can buy? ",
        "user": "u/[deleted]",
        "comments": [
            {
                "text": "Disney has gotten crazy expensive. \n\nGoing to sports or concerts.",
                "user": "u/Urbanredneck2"
            },
            {
                "text": "A summer house. I know many families that have an old house on a lake that they go to in the summers. It’s been passed down for a couple generations. Nobody in the current generation could afford one but some how a family with a single income bought it 50 years ago and the man’s wife and wife and kids would spend the whole summer there and he would go up on weekends.",
                "user": "u/spidereater"
            },
            {
                "text": "Tickets for events.",
                "user": "u/shingaladaz"
            },
            {
                "text": "A middle income starter home.",
                "user": "u/Blutroice"
            },
            {
                "text": "Chicken wings, nobody should be paying $2 per wing",
                "user": "u/utopianexile"
            },
            {
                "text": "Disneyland",
                "user": "u/Altruistic_Kick2068"
            },
            {
                "text": "In the UK, the obvious answer to this is houses. A very large proportion of 1st time buyers now get help with the deposit from the bank of mum and dad",
                "user": "u/Tigweg"
            },
            {
                "text": "A new comic book from 50 years ago.",
                "user": "u/PoignantPoint22"
            },
            {
                "text": "Single engine airplanes",
                "user": "u/ItsyBitsySPYderman"
            },
            {
                "text": "A house",
                "user": "u/Top-Ranger-289"
            }
        ],
        "processed": false
    },
    "1bxchx7": {
        "post": "What is your not so fun fact?",
        "user": "u/Ghost-5AVAGE_786",
        "comments": [
            {
                "text": "One of the most common ways to get testicular torsion is just sleeping wrong.",
                "user": "u/ContentTask2032"
            },
            {
                "text": "Horses can't throw up. If they need to throw up, they'll die.",
                "user": "u/AdExcellent8978"
            },
            {
                "text": "There is a condition in which damaged tissue is replaced by bone. People with this condition are slowly consumed by their own skeleton and have to choses which position they want to spend the rest of their life in after a certain point",
                "user": "u/BaymaxJr"
            },
            {
                "text": "Andy was a goose who was born without feet on a farm in Nebraska. He was disabled for the first two years of his life, until an inventor called Gene Flemings heard about his disability and decided to create a new method of movement for him - he initially tried to teach Andy to ride a skateboard, but eventually settled on teaching the goose to walk in baby-sized sneakers. Since Gene worked with a local charity for disabled children, Andy became a role model - and even caught the eyes of the media, with Nike offering a lifetime supply of shoes, and the pair featuring on the Tonight Show with Johnny Carson.\n\nAndy disappeared on October 19th, 1991, and was later found with his head and wings torn off. The perpetrator was never found.",
                "user": "u/Cardinal-Lad"
            },
            {
                "text": " Butterflies prefer blood, sweat, and tears to pollen and nectar.",
                "user": "u/fighterpilotace1"
            },
            {
                "text": "There's a serial killer in my state. Bodies have been found dumped in the same way in the same spot a few miles south of me. It's not been reported to the news at all but there's public police reports that all describe the same thing. People go about their daily lives in the surrounding neighborhoods and even hike in the park every day. None of them have a clue or something close to a hint that tells them they could stumble upon a body in those woods.",
                "user": "u/Accidental_Taco"
            },
            {
                "text": "Dolphins can be sexually attracted to you and will definitely try to do something about it",
                "user": "u/NazunaSimp9"
            },
            {
                "text": "There is a whale called [52 Blue](https://en.wikipedia.org/wiki/52-hertz_whale) that only sings at their frequency meaning it can't communicate with other whales. It is nicknamed the loneliest whale on the planet.",
                "user": "u/GotPC"
            },
            {
                "text": "Judith Barsi, the girl who played ducky in the land before time was shot in the head by her own father after years of abuse at his hands",
                "user": "u/smartshoe"
            },
            {
                "text": "Horses have 350° vision they have a 5° gap at the front of their sight and a 5° gap at the back of their sight. If you stand directly behind them they don't see you. And that is what triggers the kick reaction",
                "user": "u/OkInterest3646"
            }
        ],
        "processed": false
    },
    "1c6fxlf": {
        "post": "What is your \"I'm calling it now\" prediction?",
        "user": "u/_forum_mod",
        "comments": [
            {
                "text": "Starbucks will be selling bubble tea by 2027.\n\nEdit: For clarification, I mean classic bubble tea (sweet and creamy leaf tea with tapioca pearls), not fruity drinks with popping “boba” juice balls.",
                "user": "u/BoneDaddyChill"
            },
            {
                "text": "We've only just begun to see what small drone warfare looks like. These war flying tech breakthroughs always start with simple recon and dropping bombs. Soon they'll have guns and fly in coordinated swarms.",
                "user": "u/elheber"
            },
            {
                "text": "AI responses to all questions will be sponsored and yield responses that favor the advertiser rather than objective responses based on available evidence.",
                "user": "u/BlueSpotBingo"
            },
            {
                "text": "The company store will become a thing again in our lifetime.",
                "user": "u/ShortOneSausage"
            },
            {
                "text": "45 year mortgages will be the standard like we’re starting to see with 8 year car loans",
                "user": "u/Trip420x"
            },
            {
                "text": "Grown up children of Youtube family vloggers will start dropping Mommy Dearest style exposés about their horrible childhoods and laws will be imposed against the whole practice.",
                "user": "u/storm_walkers"
            },
            {
                "text": "In the coming years companies will start ditching call center staff in favour of AI systems. It will be awful.",
                "user": "u/Appropriate-Divide64"
            },
            {
                "text": "A Jenner will get a cybernetic implant by 2030.",
                "user": "u/Vic_Hedges"
            }
        ],
        "processed": false
    },
    "1bzn2oq": {
        "post": "What's the best example you have witnessed, of someone destroying their own happiness/Life?",
        "user": "u/Addictiveprinces",
        "comments": [
            {
                "text": "I was a Child Protection Specialist for years. I was assigned to work with a certain mom. It was the third time the courts had been involved with her due to “drug abuse”. But her drug of choice was huffing. The only huffing case I ever had. She was absolutely a lovely person. She had worked hard to earn a degree and enter into a career field. She was kind and beautiful. She was cooperative and she was determined. But despite how hard she was trying she would relapse and this was to be the last chance she got with the courts so the stakes were high. We worked so well together. She spent 18 months going to treatment, getting re-employed, getting her own place and having increased visits with her kids. Who were also wonderful. The kids had been staying at her parent’s place while we were working towards progress. We went to court and requested reunification and the judge granted it. We were all so proud of her!! And happy for them as a family. We planned to fully move her kids home with her a week from that very court date. \n\nTwo days before we planned to return her kids to her she drove her car through the front of a Walmart because she had been huffing and was high. She killed a Walmart employee and proceeded to huff herself to death in the electronics isle, where there was keyboard duster spray, while law enforcement was on its way. I got the news at 5am that she was dead and had to go tell her children they wouldn’t be going back to their mother. Ever.",
                "user": "u/Strong_Tree_8690"
            },
            {
                "text": "I worked on a school bus as a monitor/aid. There was one driver (we'll call him Ed). Ed was always complaining about something,  every single day there was some new issue, some problem. He was a bit of a pain. He got into an argument with one of our supervisors over the radio one day and earned himself a 3 day suspension.\n\nHis first morning back from his suspension. First route of the day, he gets on the radio and starts back complaining. Dispatch asks him a few simple questions, he responds with hostility and some really unprofessional comments. The director of transportation (our big boss) gets on the radio and asks Ed to meet him in his office after morning routes. Ed responds, \"I'll be there if I have time\" boss says, \"I need you to understand, this is not optional\" Ed comes back, \"I need YOU to understand, I'll be there if I have time!\" Mind you, this is on the radio as we are picking up high school kids, everyone can hear what's happening this entire time. Another dispatcher calls in and tells Ed \"when you finish your high school route, park your bus there at the school. We are bringing someone to take your route over, and to bring you back to the lot\". Ed did not like this and responded by saying, \"Negative. I am finishing my route. Me. If you want someone to drive my route, you get (our boss's boss) and have her come drive this route. Otherwise, I am finishing my route.\"  Dispatch asked for an ETA to the high school, he responded \"whenever (our boss's boss) is gonna be there. Otherwise, I get there when I get there\". Somewhere around this time he starts talking like, they were targeting him and picking on him and that  \"it ends today\". Again, at this point he has a bus full of high school kids.\n\nNow, I did not see what happened at the high school, but I heard from several other drivers. Apparently the police were waiting for him once he got there and they removed him from his bus. To quote one driver \"he acted a fool the entire time\". I'm not sure exactly what he was charged with, maybe kidnapping since he acted like he wasn't gonna bring the kids to school unless he got what he wanted? Theft for not bringing the bus back? No clue. But I do know he was arrested and fired. A few days later we get the news that he had a heart attack and died. Most likely from all the stress.",
                "user": "u/Klown1327"
            },
            {
                "text": "My parents old pastor and best friend. He had many friends, a successful music career, ran an music venue, had a doting wife, five kids. Then he decided to cheat on his wife. He became hugely paranoid and started tracking his wife and kids so that he knew where they were and he wouldn't get caught. He installed hidden cameras throughout his house because he convinced himself that his wife was probably cheating too. (she wasn't) He also would tell her to stay home because \"no one likes you\" and \"no one wants you to come because you are boring.\" Also lies. My parents caught him red-handed all over a woman at a concert that he didn't think they would be at. They told his wife and she called him and he lied and then let slip that he knew where she was. That's when she found the cameras and the air tag on her car. \n\nNow, none of his children talk to him, he lost the house, his friends, his music buddies, everything. The woman too. She left him when he had nothing to give. And he's not remotely apologetic about it and still tries to convince people that he was in the right. He lives in a trailer by the beach now, trying to relive his youth at 65.",
                "user": "u/FiendishCurry"
            },
            {
                "text": "Recent example, guy was a doctor and now cannot work because he hit his wife while they were getting divorced \n\nI don’t know the specifics of it but the domestic violence offence on his record is prohibiting him from working in medicine",
                "user": "u/badgersprite"
            },
            {
                "text": "My dad. He was a really talented mechanic and the shop foreman. Well liked, made great money, loved his job, owned a nice house in a beautiful neighbourhood, in a port town we all loved. Married to a wonderful woman (my mom), had two kids. He just couldn’t stop drinking. He became abusive and horrible. Lost everything. His house, his job, his family. He drank himself to death when I was 19, and my sister was 17. He died alone. \n\n\nTo her enormous credit: after she left, my mom put herself through school and supported us all on her own. She got blacklisted by my dad’s family and hers since the divorce was something they all looked down upon, and felt she shouldn’t “shame the family”. They even threatened to gang up on her and lie in court saying she was on drugs. She was not. It was the bravest, and best thing she ever could’ve done for us. At the funeral all these same people just kept telling her how “brave” she was, and “we didn’t know how bad he was til years later”.\n\n\nMy sister and I are both successful, thriving adults with great professions. We have our own families and children, we both own our houses and have a good income. We’re well educated. Our lives are filled with love. It’s all thanks to my mom. \n\n\nOver the years I think about my dad from time to time. Having my own children now, a husband, all of whom I love dearly - I can’t imagine any scenario I would ever put them through that. I don’t feel sad about it anymore. But it’s just such a waste. His whole life. And for what? Some liquid in a bottle. \n\n\nAddiction is a terrible thing.\n\n\n\nEdit to add: My mom is a rockstar - nice to know the internet thinks so too. The three of us don’t have contact with either side of the family anymore, and haven’t for a long time. We love our little trio that has grown to include in-laws, grandchildren, and lots of friends. Your family is who you make it - don’t waste time on people who dont love you.",
                "user": "u/Polishmich"
            }
        ],
        "processed": false
    },
    "1bjdxey": {
        "post": "What's a thing that's currently \"in\" nowadays but you think is just pure cringe?",
        "user": "u/Imaginary_Eye3804",
        "comments": [
            {
                "text": "Posting updates and photos about your children's medical/personal issues. I cannot imagine trying to grow up with a parent like that.",
                "user": "u/skaggaroni"
            },
            {
                "text": "Filters. People don’t even look real or remotely like themselves anymore in their pictures or videos",
                "user": "u/Symchuck"
            },
            {
                "text": "Posting everything about your life on social media.",
                "user": "u/Curious_Doof"
            },
            {
                "text": "People acting like arrogant assholes for attention on the internet, and then playing the victim when the attention they get from acting like assholes is predictably negative.",
                "user": "u/Clintman"
            },
            {
                "text": "The people who video themselves crying, in different angles. I just think that's so gross. Why do you need to video yourself crying? And from 3 different angles. I just don't understand it. Maybe I'm officially old and just think some things should be private.",
                "user": "u/jenna_leee"
            },
            {
                "text": "People photoshopping their pics until they look nothing like real life. I'm a millennial, when I was a teenager this was such a LOSER thing to do. Now it's just normal 🤦‍♀️",
                "user": "u/saskiastern"
            },
            {
                "text": "The automated robot voice on ticktok videos.",
                "user": "u/The_She_Ghost"
            }
        ],
        "processed": false
    },
    "1bmno8k": {
        "post": "What are some things that rich/ultra-rich people do which the average person doesn’t even consider? ",
        "user": "u/infinitemirrorss",
        "comments": [
            {
                "text": "Years ago I read an article about someone whose business was keeping ultra-rich people’s cars ready to go - as in if you have a Ferrari in multiple cities they’d keep it fueled up, oil changed, etc and drive it around the block once a week or so, and have it waiting at the airport when the owner flies into town.",
                "user": "u/AtlEngr"
            },
            {
                "text": "Buying a home for their college age children.  Then they sell the house when their kid graduates.  Sometimes this sale pays for college.",
                "user": "u/NeroBoBero"
            },
            {
                "text": "There are several single family owned Montessori schools. Like a family office put together an entire mini school just for their kids and their friends kids. It became a thing to do when the pandemic hit. Some of them are 100% mobile too, like teaching on the jet/all over the world.",
                "user": "u/cholula_is_good"
            },
            {
                "text": "Having separate sets of clothing in each house so they don't have to take more than carry on luggage when travelling.",
                "user": "u/Diligent-Comfort-191"
            },
            {
                "text": "I live near Scottsdale with alot of wealthy people.  They constantly remodel their vacation homes so there’s always great stuff. I bought a brand new Viking refrigerator from Craigslist. Still wrapped. It’s 8feet tall, 36”. The homeowners decided they wanted a double refrigerator instead. They’ve owned the home two years. Still haven’t stayed a night there.  The refrigerator retails for $18K. I got it for $1,500.",
                "user": "u/Majestic_Winter9951"
            },
            {
                "text": "I have several rich friends who are my age (50s) and don't work.  Their biggest perk is attending every concert and show and buying front row.  Not just our area, but if their favorite band is playing across the country, they fly (with their kids) there and spend the weekend.",
                "user": "u/MoonieNine"
            },
            {
                "text": "My mum's boss buys a brand new top of the range car almost every year and gives the year old one to one of his kids or family members.\n\nI jokingly asked for one. Truth is I doubt I could even afford the insurance let alone maintenence and fuel.",
                "user": "u/EitherChannel4874"
            },
            {
                "text": "I dated a girl from a super rich family for a couple years and every spring her entire family would go through their closets and donate 90% of their wardrobe and then go out and drop $20k+ on entirely new clothes for the year because they HAD to have the new season of everything. As some one who grew up wearing clothes till they fell apart and patching them if they still fit, this blew my mind, getting rid of perfectly good clothes because they were \"last season\" is just insane to me",
                "user": "u/Windy_Beard"
            },
            {
                "text": "Paying hundreds of thousands of dollars for golf course memberships. I photograph luxury homes in the most exclusive golf course neighborhoods in my state. I know of one neighborhood where membership runs 400k+ and there’s a wait list of people wanting to join.",
                "user": "u/b0red88"
            },
            {
                "text": "I have a client who is so wealthy she is functionally invisible. No online presence, un-Googleable. The name she uses isn’t even her legal name, but I have no idea what her real name is, because she has a family office (private wealth management) that handles her money, so checks from her come from that group. \n\nBut what I love is that she does nothing. Every detail of her life is done by magic - car always immaculate, dogs walked and fed, and taken to the vet. Once a week a beauty staff show up to wax and manicure. She legit has no idea how her clothes are always clean and immaculately pressed, her house perfect, fridge always stocked, meals on the table twice a day, bills paid, taxes done, investments invested, garden weeded, etc. Like, she knows she has staff, and they do it all, but she has no idea what ‘all’ is, or how they do it. She wanted to try paddle boarding and an hour later a top of the line paddle board and accessories was unpacked and ready to go in her car. She just dials a phone number and says what she wants and then she gets it, immediately. She has a concierge on staff. \n\nThat’s what the ultra rich do. Nothing.",
                "user": "u/TheNightWitch"
            },
            {
                "text": "They call boutique stores ahead of time to say they are coming in on date x . The boutique high end store pulls every  super expensive items complete with accessories on a rolling rack to have ready . \nI worked in a a high end store back in the day . \nIf it was on sale - they pulled the sale tag off and literally tried to get rid of all the expensive items - think layering to up sell.",
                "user": "u/B_true_to_self2020"
            }
        ],
        "processed": false
    },
    "1bn81jt": {
        "post": "If you won the lottery and didn’t tell anyone, what subtle signs/changes would people start noticing in your life?",
        "user": "u/BuildRome",
        "comments": [
            {
                "text": "I think they'll notice when I stop complaining about work...",
                "user": "u/Miserable-Tadpole-90"
            },
            {
                "text": "Supervisor: Why are you 2 hours late\n\nMe: Watch your mouth",
                "user": "u/Turbulent-Cry-9028"
            },
            {
                "text": "My house would be clean",
                "user": "u/honkifyouresimpy"
            },
            {
                "text": "I know someone who won a comfortable amount, but not sure.it was euromillons jackpot big. Big family and a few who would have been grabby if they knew the amount and they were mature enough to realise money could upset their relationships. \n\n\nThey traded up house, still worked but part time (don't think many people were aware). Used the reason for move that they have been saving for years to upgrade, hence always being skint. I was one of those who knew, they had won something but didn't really pry onto amount, probably why they shared it with me. \n\n\nI like that when they went on holiday they let family know they were going to Spain, but kept quiet about travelling first class and class of hotel. Still really happy and seem to have kept family from finding out and creating grief. ",
                "user": "u/Zabkian"
            },
            {
                "text": "A full set of teeth.",
                "user": "u/CauliflowerBoomerang"
            },
            {
                "text": "\"Finally got new glasses, I see.\"",
                "user": "u/yParticle"
            },
            {
                "text": "I'll buy printer ink",
                "user": "u/Reverse_Psycho_1509"
            },
            {
                "text": "I’d reduce my hours in my job to part time, I’m one of the lucky ones that love my job",
                "user": "u/Firewhiskey55"
            },
            {
                "text": "I would travel more often.",
                "user": "u/Red_Marvel"
            },
            {
                "text": "smiling, I would start smiling",
                "user": "u/BlagojevBlagoje"
            }
        ],
        "processed": false
    },
    "1c0xrwz": {
        "post": "What’s the worst episode of a good TV show ever made?",
        "user": "u/moon_jock",
        "comments": [
            {
                "text": "When Eric went to Africa and was replaced by Randy in That’s 70’s Show",
                "user": "u/TheGreatCornolio682"
            },
            {
                "text": "Whatever the episode of Dexter where we first realise Deb wants to F her bro. OR the lumberjack finale.",
                "user": "u/blahblahrasputan"
            },
            {
                "text": "That first episode of Two Many Cooks. Almost didn't make it through even the intro",
                "user": "u/tbaytdot123"
            },
            {
                "text": "That episode of Blue’s Clues where Steve went to college.",
                "user": "u/Monty279"
            },
            {
                "text": "The one episode of ‘Lost’ that explains where Jack got his Tattoo. Season 3 Episode ‘Stranger in a Strange Land’",
                "user": "u/Schootypantz"
            },
            {
                "text": "When Fonzie jumped the shark.",
                "user": "u/Old-Ad3718"
            },
            {
                "text": "Series finale of Dexter. Felt insanely rushed, Dexter didn’t behave the way we as viewers know he would behave and they just ended it in a terrible way. I was furious. That was 10 years ago and I’m still furious",
                "user": "u/caffPOW1201"
            },
            {
                "text": "Those Beth in the hospital episodes in The Walking Dead.",
                "user": "u/Capta1nKrunch"
            },
            {
                "text": "The last episode of The Man in the High Castle. It’s almost as if they never planned an ending and just rushed it all in the last 20 minutes. What a waste of a series.",
                "user": "u/TheGrinningSkull"
            }
        ],
        "processed": false
    },
    "1bujupw": {
        "post": "Obama supporters in 2008 or 2012, how do you view him now over 10 years later? ",
        "user": "u/Ironically__Swiss",
        "comments": [
            {
                "text": "I still remember a guy on Facebook complaining about Obamacare and saying ACA was better. People corrected him and he deleted his account.",
                "user": "u/pendletonskyforce"
            },
            {
                "text": "There have been many years in which I've benefited from the ACA. So thanks, Obama.",
                "user": "u/TJ_McWeaksauce"
            },
            {
                "text": "As a non USA person (Australia) my view is he was a diplomat, a fine representative for your country, articulate, and a decent person. His track record of getting things through was a bit below par, though he didn't always have a supportive Congress. Overall, a good person and President. IMHO.",
                "user": "u/De_chook"
            },
            {
                "text": "Wish he was tougher on banks but overall he was fine.",
                "user": "u/kingofmymachine"
            },
            {
                "text": "we didnt realize how good we had it",
                "user": "u/weepinwilo"
            },
            {
                "text": "I still love Obama the person. However, when I look at how the democrats under Biden have been able to rally together, pass multiple laws, work behind the scenes with international partners, win state elections… I wonder if there isn’t some, if not a lot of truth in the commentary that Peter Zeihan has of Obama in that he was largely an Ivory Tower professor who enjoyed debates with his cabinet but didn’t really want to meet with others and didn’t quite understand how to wield the executive branch effectively. Looking at what the democrats under Biden have been able to do with the CHIPs act, the IRA, the infrastructure bill, erasing student debt, winning back state legislatures, coordinate aid for Ukraine, nudge the Saudis and Israelis closer, working the Hungarians and Turks behind the scenes to allow the Swedes and Finns into NATO, putting China on the economic defensive, etc. I can only dream of what Obama could have achieved if he had more experience in govt. \n\nIn summary: still love Obama the person but I wish he had more experience going into the presidency and could work the US govt to get more of his goals achieved.",
                "user": "u/sikhster"
            }
        ],
        "processed": false
    },
    "1byldco": {
        "post": "What’s a secret you’ll never tell your significant other?",
        "user": "u/CowboyLikeMegan",
        "comments": [
            {
                "text": "That sometimes, her ambitions get in the way of living an actual life.\nLike Bill Withers said ; \"It's okay to head out for wonderful. But when you get to allright, stop and take a look around. Because this might be as far as you need to go.\"",
                "user": "u/ezionjd"
            },
            {
                "text": "That his mother is an exhausting gossiping windmill of geriatric nonsense",
                "user": "u/PettySquabble"
            },
            {
                "text": "That I often fantasize about being a hermit in a cabin in the complete wilderness.",
                "user": "u/SaladFingerzzz"
            },
            {
                "text": "that i think his mom is a terrible person because she didn't protect him. and their relationship is super weird.",
                "user": "u/Routine_Wear8442"
            },
            {
                "text": "I occasionally take a day off work to have some time to myself. I love them dearly, but I cherish having the apartment to myself, watching what I want on TV, and just enjoying the solitude. It’s my secret mental health day.",
                "user": "u/New_Art_1721"
            },
            {
                "text": "How challenging it is to navigate through their depressive episodes. Some days I’m so exhausted from picking up the slack and taking care of the kids and working. It’s hard to find compassion. I know he didn’t choose this. Some days are just harder than other and today was one of those day. I love you more than you’ll ever know.",
                "user": "u/exWiFi69"
            },
            {
                "text": "A few years ago one of our cats died after we had her for 14 years. We were all heartbroken and devastated by her loss. We noticed something was wrong on Thursday, took her to the vet on Friday, and she died late Sunday night.\n\nThe night she died, I sent everyone to bed and I stayed up with her. She kept getting into the bathtub and lying down as opposed to a bed we had set up for her.\n\nJust before she died, she let out a horrible scream and went into convulsions. Then she just stopped breathing.\n\nI never told my spouse or kids about that last few moments. I just told them she just slipped away. I still want to cry every time I think about it. I will never tell them about that.",
                "user": "u/123fofisix"
            },
            {
                "text": "When we first met he made me promise “if I ever gain too much weight you have to tell me to hit the gym.” We laughed about it but that was almost 5 years ago, and now he has gotten pretty overweight and I don’t know if I’m supposed to keep my promise or just let him choose his own path with his weight. I’m still attracted to him and love him more than ever, but I want him to be healthy…",
                "user": "u/Hot-Neck-9524"
            },
            {
                "text": "that i dont like his family",
                "user": "u/its_annaa_"
            },
            {
                "text": "The day after I met his parents for the first time in person, we were driving to his hometown and I had fallen asleep.\n\nI then woke up hearing them talking about me. \n\nHis dad, a man of few words, said “a woman like her who is both beautiful and intelligent is extremely hard to find. You are lucky and blessed.”\n\nThey kept speaking such pure, lovely, genuine words about me for a while, in Spanish at that. My boyfriend kept kissing my forehead while they were talking, assuming I was still asleep. I was listening the entire time. :)\n\nAdditional context: I’m Asian but I had been learning Spanish for a few months so I could connect with his family more. They probably would’ve thought I couldn’t understand them if I was “awake”, too, hehe.",
                "user": "u/Agile_Mud4957"
            }
        ],
        "processed": false
    },
    "1by3xvv": {
        "post": "What do you secretly judge people for?",
        "user": "u/BushidoX0",
        "comments": [
            {
                "text": "People’s self awareness like when they watch Tik toks loud in a quiet room without headphones. Or not knowing how to act in certain establishments.",
                "user": "u/icencream27"
            },
            {
                "text": "People who throw trash out of their cars onto the highway/street. People who just deliberately litter outdoors in a park or at an event.",
                "user": "u/Significant_You6221"
            },
            {
                "text": "Parents being jerks to their children and stepchildren.",
                "user": "u/Demonicbunnyslippers"
            },
            {
                "text": "Being obliviously in the way. Like getting to the end of an escalator and just standing there. Or standing with a group of people in a doorway or aisle. Or stopping to stare at your phone in the middle of the sidewalk.\n\nJust move out of the way like 2 steps and everyones life is easier.",
                "user": "u/Heavy_Analysis5"
            },
            {
                "text": "Things they decide to post online",
                "user": "u/anti_histamine_"
            },
            {
                "text": "When people don't clear their tables and leave rubbish behind at food courts or fast food restaurants.",
                "user": "u/Moon_Jewel90"
            },
            {
                "text": "Littering! If you knowingly throw trash on the ground, you don’t deserve the beautiful world we live in. Go live in Chernobyl or your local landfill, you piece of trash!",
                "user": "u/dontmakeitathing"
            },
            {
                "text": "How they talk behind someone’s back",
                "user": "u/xtinex89"
            },
            {
                "text": "Letting their kids act like assholes and pretending not to notice \n\nHowever, I don’t judge them if I can tell they’re stressed and trying their best- sometimes kids will act like assholes no matter what. \n\nIt’s rlly more abt how the parents act",
                "user": "u/Street-Winner6697"
            },
            {
                "text": "Not having social awareness. Talking loudly in a restaurant, Taking up a space on the sidewalk to take photos, holding up a line at a restaurant, etc.",
                "user": "u/Other_Self_2520"
            }
        ],
        "processed": false
    }
}