{
    "1c9kenq": {
        "post": "What scientific breakthrough are we closer to than most people realize?",
        "user": "u/skunkspinner",
        "comments": [
            {
                "text": "They're hoping that a new drug will be available for use by 2030 that essentially grows your teeth back. It stimulates stem cells in your tooth pulp and encourages growth.\n\n(Also to my understanding this drug was originally being tested as an alzheimer treatment in japan.)",
                "user": "u/Tilting_planet"
            },
            {
                "text": "Growing back your own enamel instead of needing crowns/replacements. \n\nhttps://www.researchgate.net/figure/The-essential-steps-in-using-EAER-electrically-accelerated-and-enhanced_fig2_322650984",
                "user": "u/octopush"
            },
            {
                "text": "A cure for symptomatic rabies! Using monoclonal antibodies, scientists were able to alter the immune response in rats CNS significantly into infection. You can read the study [here](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10565638/). \n\nThis is awesome because before this treatment, once you showed symptoms you were essentially dead. Rabies is also a lot more common in Asia and Africa, with roughly 56k cases a year.",
                "user": "u/Juliette_xx"
            },
            {
                "text": "**Edit:** The publication in question left out an important element that needs addressing before we can raise our arms in excitement. [Response, substack: EQ Precursors, not so fast](https://earthquakeinsights.substack.com/p/earthquake-precursors-not-so-fast)\n\n*****\n\nEarthquake warning system up to 2 hours.\n\nPermanent GPS antennas are located all over the world and more densely at fault zones. About a year ago geologists found that if they stacked all historical GPS data proximal to large earthquakes, they saw there is a very small acceleration of the surface about two hours before the actual earthquake.\n\nWe are literally only missing the technology to make even more precise GPS measures, so we can do this in real time on singular regions. It is proven that this is an actual thing that happens and we can literally warn of earthquakes with a significant time span.\n\n> And the land movement is so subtle that only by lumping all the data together did the precursor stand out, Bletery says. “If you just remove one or two quakes, you still see it,” he says. “But if you remove half, it’s hard to see.”\n\nThis is not a solution or has saved any lives, but it is an absolutely staggering discovery that will have an insane focus in the upcoming years.\n\nhttps://www.science.org/content/article/warning-signs-detected-hours-ahead-big-earthquakes",
                "user": "u/PTSDaway"
            },
            {
                "text": "Geothermal energy.  \n\nPeople have figured out how to reuse all the drilling technology developed for fracking to dig geothermal wells [almost anywhere.](https://arstechnica.com/science/2024/04/how-new-tech-is-making-geothermal-energy-a-more-versatile-power-source/)   Geothermal has the benefits of nuclear — reliable baseband power — without the downsides.   The footprint is smaller,  and unlike nuclear power, you can turn it on and off pretty quickly which is important for filling the gaps in green energy when the sun doesn't shine or the wind stops blowing.  \n\nThe US government [just cleared out almost all the red tape](https://arstechnica.com/science/2024/04/how-new-tech-is-making-geothermal-energy-a-more-versatile-power-source/) for digging geothermal wells on public land too, basically it is now as easy to dig a geothermal well as it is to dig an oil well.\n\n\n\nThey are even looking at using geothermal wells [like batteries](https://www.technologyreview.com/2023/03/07/1069437/this-geothermal-startup-showed-its-wells-can-be-used-like-a-giant-underground-battery/) by pumping water into them and pressurizing them.   So when there is an excess of solar or wind electricity, it can be stored in the geothermal wells.",
                "user": "u/JimWilliams423"
            },
            {
                "text": "Growing transplantable organs",
                "user": "u/Willbreaker-Broken1"
            },
            {
                "text": "Curing addiction with a diet drug (GLP-1’s) There have been life long alcoholics, drug addicts, people with eating disorders, gamblers, etc who’ve lost all desire for these things while on Ozempic, Wegovy, and semaglutide. They’re conducting studies already.",
                "user": "u/Carrots-1975"
            },
            {
                "text": "Early diagnosis and treatment of Parkinson's, I think. I've been following a story for a few years now of a woman who could smell Parkinson's and is now working with researchers to turn her weird unique ability into an early screening test.",
                "user": "u/OutAndDown27"
            },
            {
                "text": "Insanely effective cancer treatments.\n\nCell therapy is absolutely crazy, and it's available for a fair few diseases",
                "user": "u/arabidopsis"
            },
            {
                "text": "I have a lot of family that works in different pharma companies. We were recently discussing that there is a very promising treatment for Alzheimers in the works that could stop the progression of the disease and maybe reverse some of the brain damage. It's still in testing phase and wouldn't be on the market for years but it's something that would be awesome to be able to use.",
                "user": "u/Chickadee12345"
            }
        ],
        "processed": true
    },
    "1bu2eaj": {
        "post": "What seems to be overpriced, but in reality is 100% worth it?",
        "user": "u/Rice_farmer8",
        "comments": [
            {
                "text": "An Uber home instead of a DUI. Whether it’s court costs, the (more than monetary) costs of an accident, and the issue of having a suspended license. It’s not worth it, don’t drink and drive.\n\nEdit: My most upvoted comment is about not drinking and driving. I’m happy about that.",
                "user": "u/YoloSwaggins991"
            },
            {
                "text": "Good shoes and socks.",
                "user": "u/THGilmore"
            },
            {
                "text": "I'm usually a cheapskate but experience has taught me that some things are worth spending money on.  For example:\n\n1. Car wash vacuum cleaners.  So worth it to spend $1.50 or whatever to use one rather than trying to use your own vacuum cleaner.  And, they get your car cleaner much faster than dragging out your home vacuum to try to clean your car with. \n\n2. Electronics.  Buy them new from brand name shops.  It isn't worth hassling to save $10 somewhere and getting something that doesn't work or doesn't have a reasonable return policy. \n\n3. Household help.  If you can afford it get someone to come in and clean your house on a regular basis.  So it stays...always clean, without you having to do anything. \n\n4. Education.  Now this is a big one and far more could be written about it.  Obviously not all education expense is worthwhile, so I'm not necessarily referring to a college degree or whatnot.  But educating yourself - or especially, educating kids if you have them, can return dividends throughout their life. \n\n  \n'",
                "user": "u/TTTT27"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "A quality sofa. One from What A Room custom sofas, Room & Board, Arhaus or Flexsteel. Don't go for the junk from Joybird, Ashley, Burrow, West Elm, etc.",
                "user": "u/juanisimok"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Professional kitchen knives. You’re not just paying for the ability to cut; you’re investing in less prep time, safer handling, and a tool that, with proper care, will last a lifetime. Don’t undermine your culinary skills with subpar equipment. Remember, a dull knife is an injured chef's first sign of regret.",
                "user": "u/Boring-Leather-1433"
            },
            {
                "text": "Mattress, Shoes, Dental Care, Jacket.\n\nIn that order.",
                "user": "u/Kwinza"
            },
            {
                "text": "Quality bicycles. That is if you care about riding bicycles at all.",
                "user": "u/DrYaklagg"
            },
            {
                "text": "Tailored clothing. Wearing clothing that fits correctly is more comfortable, looks better, and tends to be of a quality that lasts longer.",
                "user": "u/AlanMercer"
            },
            {
                "text": "A good mattress.",
                "user": "u/CompetitiveLion43"
            }
        ],
        "processed": true
    },
    "1c6fxlf": {
        "post": "What is your \"I'm calling it now\" prediction?",
        "user": "u/_forum_mod",
        "comments": [
            {
                "text": "Jo Jo siwa’s mental breakdown",
                "user": "u/ShadowConspiracy"
            },
            {
                "text": "We've only just begun to see what small drone warfare looks like. These war flying tech breakthroughs always start with simple recon and dropping bombs. Soon they'll have guns and fly in coordinated swarms.",
                "user": "u/elheber"
            },
            {
                "text": "AI responses to all questions will be sponsored and yield responses that favor the advertiser rather than objective responses based on available evidence.",
                "user": "u/BlueSpotBingo"
            },
            {
                "text": "Starbucks will be selling bubble tea by 2027.\n\nEdit: For clarification, I mean classic bubble tea (sweet and creamy leaf tea with tapioca pearls), not fruity drinks with popping “boba” juice balls.",
                "user": "u/BoneDaddyChill"
            },
            {
                "text": "Grown up children of Youtube family vloggers will start dropping Mommy Dearest style exposés about their horrible childhoods and laws will be imposed against the whole practice.",
                "user": "u/storm_walkers"
            },
            {
                "text": "The company store will become a thing again in our lifetime.",
                "user": "u/ShortOneSausage"
            },
            {
                "text": "45 year mortgages will be the standard like we’re starting to see with 8 year car loans",
                "user": "u/Trip420x"
            },
            {
                "text": "In the next 10 years you’ll no longer speak to a nurse before seeing your Primary Care Physician. You’ll be questioned by an AI with full knowledge of your entire medical history and it will craft new questions based on your answers. It will inform your doctor of important risk factors and suggest where to go from there",
                "user": "u/stowns3"
            }
        ],
        "processed": true
    },
    "1cbkr96": {
        "post": "What screams \"I´m not doing so well mentally\"?",
        "user": "u/ramonapap1",
        "comments": [
            {
                "text": "For me, it's when my house becomes dirty and unorganized. My dishes start to pile up; my dirty laundry is left on the floor, trash can is doing a balancing act- normally I'm on top of all these things daily and weekly, but sometimes I can tell that a depressive episode is just around the corner based on the state of my home. ",
                "user": "u/None"
            },
            {
                "text": "Sudden change in personality and/or spending habits.",
                "user": "u/freezingprocess"
            },
            {
                "text": "They are not interested in their hobbies.",
                "user": "u/AgitatedPatience5729"
            },
            {
                "text": "They’re slacking on hygiene",
                "user": "u/JustinR8"
            },
            {
                "text": "They quit reaching out as much. A friend of mine thanked me for being an annoyance when he stopped reaching out, it saved his life.",
                "user": "u/gothiclg"
            },
            {
                "text": "One thing I notice in me is that I stop listening to music. Like all I want to hear is silence, and nothing more.",
                "user": "u/TotallyNotSecretCrab"
            },
            {
                "text": "I can’t motivate myself to do simple things around the house that I actually never mind doing when I’m feeling OK. \n\nI don’t want to see anybody. I don’t want to answer the phone. I don’t want to participate in any activities. I just want time to stand still.",
                "user": "u/thomport"
            },
            {
                "text": "I haven't been out my room except to go to work or eat, and I usually wait until no one is around so I can eat.",
                "user": "u/Zero_Hyndyn"
            },
            {
                "text": "Sleeping excessively, often neglecting other responsibilities to do so",
                "user": "u/SnailsInYourAnus"
            },
            {
                "text": "My business math teacher used to come to school looking like he got dressed under his desk. One morning I will NEVER forget, he wore 2 different shoes (black dressed show and light brown shoe) which also were the wrong sides also (left foot right shoe, right shoe left foot),  half-tucked shirt, bed hair and like a liquid stain on the neck of his shirt. His excuse for looking like that? \"I got dressed in the dark this morning and I picked up the wrong shoes and accidentally grabbed a dirty shirt!\" \n\nAs a teenager, I just thought \"He's a messy person!\" But as I got older, I believe he went through a bad divorce and he didn't take it so well! I still think about him and wonder what really happened!",
                "user": "u/Lord_Bentley"
            }
        ],
        "processed": true
    },
    "1c1is9k": {
        "post": "What's the weirdest thing your partner does that you've just accepted?",
        "user": "u/VelvetSophieCream",
        "comments": [
            {
                "text": "When he's alone, he talks to himself in 3rd person, making comments on the things he's doing. \"Ladies and gentlemen, xxxx has done it again, he's made the best omelet in history.. for the 3rd time this month. He's the man of the year. Look at him getting a glass, and opening the fridge.. oooh is he going for orange juice? yes he is! okay now he needs to do something but what was it? ah righttt the toast. The toast, everybody. He almost forgot the toast.\" stuff like that. I'm glad he does it loudly, it's hilarious. Especially when he gets tired and stops mid-sentence but keeps doing what he's doing in silence. Even funnier when he starts speaking again all of a sudden.",
                "user": "u/the_crystal_temps"
            },
            {
                "text": "My wife microwaves lettuce. Like when she eats a salad at home, she “warms up” the lettuce. \n\nImagine if you cut off one of your feet and left it to rot for about a week. That’s what hot lettuce smells like.",
                "user": "u/pangderx"
            },
            {
                "text": "She usually dresses normal but sometimes she goes through phases where she dresses like people from different eras. Like a [70s disco phase outfit](https://i.ebayimg.com/images/g/2LwAAOSwnd5i0WpM/s-l1200.webp) or a 80s [rock chick outfit](https://i.pinimg.com/236x/de/ac/46/deac46acff42d01d956f249c23d8b49d.jpg) or a [1950s dress outfit.](https://i.pinimg.com/736x/e0/6c/c5/e06cc53b6c4a9cc950504ebbf008f8df.jpg) It's one thing to do this for a day or something... she will do it for like 3-4 weeks straight, ordering clothes on amazon to make new outfits, wearing the outfits to go grocery shopping or walking the dog etc. And then she rinses and repeats every once in a while. She also will obsessively watch movies from that era when this happens. \n\nShe has been doing this for 20+ years. She is known in our neighborhood for doing this.",
                "user": "u/frogvscrab"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Loses one sock.   \n\nShe'll be sitting in a chair watching tv or something, and 20 minutes later one sock is gone.\n\nI'd understand if she took both of them off - Heat, Comfort, whatever.  But one is just weird.",
                "user": "u/MarmosetRevolution"
            },
            {
                "text": "\nHe always finds random objects around the house to make into a “hat” for me. \n\nFresh laundry? Hat \n\nRandom plushies? Hat \n\nBubble wrap? Hat\n\nThen he makes one for himself, we take a funny picture and hang it on our “hat photos” wall.",
                "user": "u/brisketball23"
            },
            {
                "text": "When he wakes up in the morning, he puts on ALL his clothes, just to walk to the bathroom, take them off and have shower. Why?? I will never understand that lol",
                "user": "u/Altruistic-Notice707"
            },
            {
                "text": "My wife says no to almost everything I ask her to do. If I ask her to bring me toilet paper because I’m out, she will say no but then proceed to bring it to me. It’s her way of practicing being able to say no.",
                "user": "u/amdabran"
            },
            {
                "text": "I don’t know how weird this is, but my boyfriend constantly talks to himself.  He also gives voices to our pets- 2 cats and a dog.  Each pet has a distinct voice and accent.  Some of them have catchphrases.\n\nSometimes when he’s getting ready for work in the morning, I’ll hear him having conversations with the pets and himself in all the various voices.  It’s hilarious and adorable.  Sometimes I catch myself doing it now, too.",
                "user": "u/Cassiopeia299"
            }
        ],
        "processed": true
    },
    "1brn5zf": {
        "post": "What would  be your reaction if Donald Trump dies tonight?",
        "user": "u/kRe4ture",
        "comments": [
            {
                "text": "Well, my reaction would be that you should have a *very* strong alibi for tonight, just in case.",
                "user": "u/allegate"
            },
            {
                "text": "Wouldn't it be really weird if he actually drops dead tonight",
                "user": "u/Glum_Possibility5204"
            },
            {
                "text": "\"You should never say bad things about the dead, only good. Joan Crawford is dead… good!\" - Bette Davis",
                "user": "u/rambleriver"
            },
            {
                "text": "There's absolutely no way the conspiracy crowd would see it as just a normal thing that happens to old people. I'd be pretty worried tbh.",
                "user": "u/AnAdorableDogbaby"
            },
            {
                "text": "Thanks Obama!",
                "user": "u/AdBroad8817"
            },
            {
                "text": "I think it was Mark Twain that said while he'd never wish death on anyone, he's not been too upset at reading their obituary",
                "user": "u/llcucf80"
            },
            {
                "text": "Tonight - this weekend?  Well, it will all depend on if he returns in 3 days.",
                "user": "u/SensitivePineapple83"
            },
            {
                "text": "Look, I was out till 3 AM “all claws no laws” after a metal show last night. I’m bruised and hungover, and all I want to do is eat my weight in eggs Benedict. \n\nBut if I gotta go party with my people, I gotta go party with my people.",
                "user": "u/teebalicious"
            },
            {
                "text": "Canadian here. Make some popcorn and turn our lawn chairs facing south to watch the show.",
                "user": "u/gramgoesboom"
            }
        ],
        "processed": true
    },
    "1bvg1wv": {
        "post": "You're given immortality but as a cost you are sent back 3000 years - would you accept and what would you do?",
        "user": "u/ShamKumar7",
        "comments": [
            {
                "text": "I might accept this but I would need more information. 3000 years ago would be like 976 BC. Would I show up where I live now, or some where else? Could I take anything with me. Is immortality just not aging and disease or does it include not being violently killed.",
                "user": "u/Tink2013"
            },
            {
                "text": "Get early shares in apple, back then it’s just the fruit",
                "user": "u/Ok_Satisfaction_6680"
            },
            {
                "text": "Can you choose too die at any point? If not the 3000 years is irrelevant, I'm more concerned about being stuck alone in the void 900 quadrillion years from now. ",
                "user": "u/HMSon777"
            },
            {
                "text": "Like immortality and Im still young? Yeah why not, I would travel with my knowledge to every major event, or at least try.",
                "user": "u/K4T4N4B0Y"
            },
            {
                "text": "In the Netflix adaptation of The Sandman - which is really good by the way - Dream grants a dude the wish to be immortal. The guy lives hundreds of lives, some good, some bad, some awful, but in the end doesn't regret his decision because life moves on.\n\nAssuming 'immortal' includes being impervious to injury/ sickness/ etc then... yeah? Going that far back you'd be considered a deity for surviving fatal occurances. In the modern day you wouldn't but you could have a sick YT channel.",
                "user": "u/zackdaniels93"
            },
            {
                "text": "Immortal without health issues, being a perfectly healthy man with current skills and knowledge, then I am all okay to go all the way 3000 years back! \n\nI can manage to build a better world!!!",
                "user": "u/nextdoorboy_chn"
            },
            {
                "text": "I've done 37 years and already feel about done lol\n\nedit: this isn't a cry for help, just sayin a lot more time sounds like a nightmare.",
                "user": "u/bodycount19"
            },
            {
                "text": "No. No, that sounds awful all the way around. First off I do not want to be immortal second off I do not want to go back to a time when there are no flushing toilets. Yuck!",
                "user": "u/britishbobsyouruncle"
            },
            {
                "text": "Everyone here talking about Apple and Amazon.\n\nNobody talking about reuiniting earth and purging the universe from the mutant, the heretic, the alien.\n\nThe answers here are as boring as in that thread about being giftet 100 billion. \"I'd buy a house and sleep on it so I don't accidentaly blow it all\", like noone had any clue that they were handed an economic atom bomb.",
                "user": "u/Minimalphilia"
            }
        ],
        "processed": true
    },
    "1bute49": {
        "post": "People who liked Elon Musk but no longer do, what was the turning point? ",
        "user": "u/MeowMamiX",
        "comments": [
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "when he fired his secretary who's been loyal to him for years after she asked for a raise",
                "user": "u/wekoweko"
            },
            {
                "text": "Quite honestly - the turning point was immediately after I started to like him. *As* I was starting to like him, even.\n\nThe problem is that once you learn *anything* about him, you realize what a miserable sack of wasted flesh he is. Once you start looking into his social media presence, the reality becomes literally unavoidable.\n\nSo I thought \"hey, that Musk guy with the solar panels seems like he might be onto something,\" and then one google search later I realized I had been wrong. This was quite a while ago, so his personal opinions weren't yet plastered everywhere.",
                "user": "u/aquariarms"
            },
            {
                "text": "No single turning point, but several things over time. For me the very first moment was when he kept insisting that our world is a simulation based on incredibly flimsy logic and everybody was just like, \"oh yes yes good point Mr. Musk\". Like, I don't have a strong opinion on the idea, but I was sort of turned off by how he had somehow risen above scrutiny at that moment.\n\nThen came the Thai cave rescue incident. I wasn't bothered by him trying to contribute resources to help, even if nobody had asked for it. But the false accusation, calling his critic a \"pedo guy\" IIRC and everything that followed in that story was a big issue.\n\nThen came the Cybertruck. That thing is ridiculous on a practical level, in so many ways.\n\nThen came the actions he took immediately after purchasing Twitter. A lot of really bad business decisions and really poor treatment of people.",
                "user": "u/oldwoolensweater"
            },
            {
                "text": "I liked him when he was focused on making green energy affordable. I remember when he came out with the Tesla Solar Roof, and I thought it was very cool. I still think it's a great idea.\n\nThe turning point for me was when he became more political, when he started going down the \"anti-woke\" and conspiracy theorist path. I noticed that the type of people that were rallying around him were not the kind of people I like or even agree with. And Musk kept doubling down, to the point where he bought Twitter and lost all that money. It just became extremely obvious that he's very thin-skinned and he's the type of person that can never admit he's wrong about anything. Then, of course, he started letting his racism and anti-semitism slip out, but I was way past my turning point by then.",
                "user": "u/ImInJeopardy"
            }
        ],
        "processed": true
    },
    "1by3042": {
        "post": "What is your most disturbing secret?",
        "user": "u/Waltef_j",
        "comments": [
            {
                "text": "When I was around 7 years old, I was sexually exploited and had my toddler photos sold to pedophiles by a maid we hired. \n\nOne afternoon, Right after taking a bath I wanted to turn our PC on, but as a child I was afraid of plugs due to the electricity. So I asked her kindly to plug it in for me. But The maid then told me I should first 'Pose for a photo in the bed' otherwise she wouldn't do it. So, I went to my bed and posed — I had a Giant stuffed teddy bear at the time so I covered my bare body because I somehow knew it was wrong. Then She told me to take the teddy bear off. \n\nShe had also taken photos of my baby brother.\nThe other Maids carefully observed her and eventually told my parents. I watched her cry and beg on her knees, kissing my parents foot.. explaining it was a “Joke” as a kid, I honestly was laughing. \n\nThe police further investigated and found out she had been making a fortune off of the photos she takes of children she was hired to care for. Including me. I've never told anyone even on Reddit because I'm afraid no one will listen — but here I am.",
                "user": "u/grnarpy"
            },
            {
                "text": "My ex-husband told me one time that he didn’t think it was wrong for a father to be sexually intimate with his daughter, as long as she was “old enough.” No one will ever know why we truly divorced, because I don’t think anyone would believe me. He started talking about children. I’d never let my daughter be his.",
                "user": "u/Mistealakes"
            },
            {
                "text": "I was sexually abused  by my aunt at the age of 7-12. She recently got in a car accident and  now she's  paralyzed from the neck down. It sort of brings me  joy that she cant harm other kids",
                "user": "u/Agitated-Try3573"
            },
            {
                "text": "My family think I finished the computer science degree, but I dropped out. However I've been working in the sector for about 25 years in a row without any trouble and people (employers and colleagues) seem to think that I'm quite competent. It's not disturbing per se but for my parents it was a big deal that I finished my studies. My dad passed away three years ago without knowing. My mom is 83 and she is still proud of me and I hope things stay the same till she dies.",
                "user": "u/DeesoSaeed"
            },
            {
                "text": "I have a serious skin picking problem. I can just sit for hours straight in front of a mirror and inspect every pore on my face/chest/hands. It's gotten so bad that i have little scars all over my face. But i literally cant stop doing it.",
                "user": "u/skrozokejpekara"
            },
            {
                "text": "I have a recurring dream that a tsunami is approaching. In almost every dream, it swallows me up and kills me, although one time I survived and rescued a small boy.",
                "user": "u/Diego_DeLaMuncha"
            },
            {
                "text": "As a teen, I caught my parents' house on fire playing with pyrotechnics in the garage and then staged it to look like an electrical fire so i wouldn't get in trouble.\n\nI was regarded as the hero who put the fire out before it consumed the house (I was home alone at the time), but really, I was the cause.\n\nThey had all of the electrical redone in the house as a precaution against another fire... I never came clean.",
                "user": "u/Spencetron"
            },
            {
                "text": "I hid the remote control to the living room tv for absolutely no reason at all, and kept it hidden for probably a week. My dad began to have a meltdown by the 6th-7th day, so I just put it under a random blanket on the couch where I knew he would find it. What a weird kid I was",
                "user": "u/KittysOnKeyboarghjfg"
            }
        ],
        "processed": true
    },
    "1bwf1sq": {
        "post": "What are some really dangerous things most people don’t realize are dangerous?",
        "user": "u/Dani0873",
        "comments": [
            {
                "text": "At the beach, riptide, if you don't spot them and don't know how to get out of one, it can be terrifying and deadly",
                "user": "u/No-Effort6590"
            },
            {
                "text": "Combining different cleaning products can lead to toxic gas in the room.",
                "user": "u/Cutterstrophe_"
            },
            {
                "text": "Falling/knocking people over. hit your head at just the right angle and spot and boom dead.",
                "user": "u/Forward-Essay-7248"
            },
            {
                "text": "Driving while not getting enough sleep.",
                "user": "u/skipabeat123"
            },
            {
                "text": "Visiting the wrong doctor. The general public will never know what makes a good doctor and what makes a bad one. The standard of care you get from one hospital to the next can be life changing...",
                "user": "u/Kovah01"
            },
            {
                "text": "Hiring the “cheapest electrician” to change the basement fuse box… 💥🔥⚡️☄️",
                "user": "u/None"
            },
            {
                "text": "Moving water.\n\nIt can only take 6 inches of fast flowing water to knock you over, and double that can float a car.",
                "user": "u/NarrativeScorpion"
            },
            {
                "text": "Tooth infections",
                "user": "u/m1racle"
            },
            {
                "text": "Tailgating, especially at speed.",
                "user": "u/Demonyx12"
            }
        ],
        "processed": true
    },
    "1btpxjf": {
        "post": "What is something that most people don't know?",
        "user": "u/TechSavvy_Ryan",
        "comments": [
            {
                "text": "Ctrl Backspace deletes the entire word.",
                "user": "u/Brueguard"
            },
            {
                "text": "Squirrels run faster up trees than on flat surfaces.",
                "user": "u/sstebbinss"
            },
            {
                "text": "Most the people involved in the Hindenburg disaster lived.",
                "user": "u/CaligulaMoney"
            },
            {
                "text": "irukandji jellyfish grow only to about 1 cubic cm in size, but have an incredibly painful sting. One symptom of the sting is a strong impending sense of doom. Victims have begged their doctor to be killed as they were certain they would die anyways.",
                "user": "u/NikkiRex"
            },
            {
                "text": "You can collapse your lungs from laughing.",
                "user": "u/ContentTask2032"
            },
            {
                "text": "A company called Warner Chappell Music collected licensing fees for use of the song “Happy Birthday to You” all the way until 2015. That’s why characters in movies often sing other songs like “For He’s a Jolly Good Fellow” and restaurant chains often have their own birthday songs they sing to customers.",
                "user": "u/ItsMeCourtney"
            },
            {
                "text": "battleships in museums/ on display that are WW2 and later cannot start their engines because they have preservative grease inside in case the Navy has to bring the ship back into service.",
                "user": "u/Stravata"
            },
            {
                "text": "A burial plot is called a graveyard if it's part of a church lot. It's called a cemetery if separate.",
                "user": "u/Missusmidas"
            },
            {
                "text": "Sharks predate trees",
                "user": "u/External_Crazy_6568"
            }
        ],
        "processed": true
    },
    "1cbx765": {
        "post": "What screams \"I'm bad with money\"?",
        "user": "u/tranquilsnailgarden",
        "comments": [
            {
                "text": "My mom and sister live together still. Couldn't afford rent or their car between the two of them. Nearly had the car repossessed and were closing in on eviction until my grandmother loaned them--she explicitly said \"pay me back when you're more stable--enough money to keep the car and stay in their apartment.\n\nFour months later my sister gets her tax refund for ~$4500 (she had a kid and isn't with the father) and, instead of making any effort to pay my grandmother back, pay off the car, or have any sort of emergency fund...the two of them buy an expensive purebred puppy (airedale terrier). They dropped over $2k for the dog and then spent another $500 on a crate, toys, leashes, and dog food.\n\nLess than 6 months later they lost the car and were evicted. They moved in with my aunt and her husband hated the dog so it was taken to the SPCA. It wasn't even a year old. My grandmother didn't seen a cent of money returned before she died.\n\nSo...that. People bad with money buy things they can't afford instead of stabilizing what they already have.",
                "user": "u/bythog"
            },
            {
                "text": "Impulse spending, while complaining about being broke all the time.",
                "user": "u/cgtdream"
            },
            {
                "text": "I know someone that paid to get their used red Nissan Sentra wrapped in blue. They are unemployed.",
                "user": "u/0r0B0t0"
            },
            {
                "text": "Using credit to buy luxury items, then paying the minimum due, accumulating interest.",
                "user": "u/ChanceMysterious8247"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "I work on cars for a living and the vast majority of the BMWs that come into my shop have slick tires and lights blinking on their dash. So many of these people can barely afford a luxury car, let alone the maintenance required to keep them nice and running.",
                "user": "u/tarheel_204"
            },
            {
                "text": "I had a buddy in college who would go though a cycle of bragging about how much money he had, spend it all on dumb stuff, then brag about how poor he was. All while bragging how he was a rich kid. \n\nThe best part was when he was bragging about having some money to this girl he liked. Turns out that girl came from an actually wealthy family. She said \"Its only $5k, why do you keep mentioning it? ......... is that a lot to you?\". That event shut him up for a bit lol",
                "user": "u/nagol93"
            },
            {
                "text": "Showing off expensive purchases on social media when they can’t afford basic necessities.",
                "user": "u/Crafty-Roll4333"
            },
            {
                "text": "Depends on what you call “bad”. My sister has been a saver/penny pincher since childhood (which was a bit traumatic, admittedly). \n\nShe is now nearing retirement and everything she and her husband have is paid off. She isn’t “rich”, but will have the comfortable retirement she has earned and deserves. She hates going into debt and her cards are paid down monthly. Sounds great, right?\n\nIt would be if she wasn’t so completely\nobsessed and angered by people who don’t do or think as she does (including her husband). For instance, her house and cars are modest-to-decent, while her friends are all buying nicer things, vacation homes, travel, and other luxury items. Most, if not all, of these things are paid for with credit and it just drives her crazy. She is so jealous of what they have, yet so angry at how they got it. On the occasion that she and her husband join friends for a cruise or resort stay, her main concern is cost (which ruins a huge part of the trip for her every time) and monitoring how others are “wasting” their money (never to their faces - this is just what she says to me after). \n\nHer husband used to be a pretty fun guy about 30 years ago, when they met, but has become bitter and grumpy after decades of having to fight for things she deems “unnecessary”, like tickets to his favorite concerts or pricey sports/music memorabilia (which he’s always been into). It has resulted in dishonesty between the two (which is not the kind of guy he really is) and she has grown disgusted by his need for “childish” hobbies and entertainment. My sister has always been a bit of a fun-hater, but it’s gotten to the point where it makes her, and sometimes the people around her, miserable. \n\nShe lives and works in a small town and pays attention to who is getting free lunch, who is paying with food stamps at checkout, who is driving a car they can’t afford, etc. She has called me and listed the items she’s seen a family buying with food stamps - can’t fathom them buying Doritos and Kool-Aid. \n\nThere is more than one way to be bad with money.",
                "user": "u/timscookingtips"
            },
            {
                "text": "Buying lottery tickets regularly as a serious plan to improve their financial situation.",
                "user": "u/Impressive_Big_1322"
            },
            {
                "text": "Never reading the financial terms and conditions but always signing up for new financial obligations.",
                "user": "u/ButterflyAnnual7320"
            }
        ],
        "processed": true
    },
    "1c5tcbu": {
        "post": "What popular consumer product is actually a giant rip-off?",
        "user": "u/EnchantedSophia",
        "comments": [
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Herbalife. Nutrition Shops. Those shakes are just Herbalife.",
                "user": "u/vintagepoppy"
            },
            {
                "text": "fabric softener. every authority i’ve seen agrees that it’s bad for your clothes and your washer",
                "user": "u/itisthemaya"
            },
            {
                "text": "Dr. Dre does not have a degree in headphones.",
                "user": "u/Shh-poster"
            },
            {
                "text": "Any compression sleeves with copper or magnets in them.\n\nThe compression is fine.  But the copper or magnets do nothing.",
                "user": "u/DreadPirateGriswold"
            },
            {
                "text": "NFTs was probably the funniest thing I’ve ever witnessed",
                "user": "u/Ismokeradon"
            },
            {
                "text": "Designer eye glasses. Luxxottica is a monopoly that controls most of the market and commands a premium for cheap plastic glasses.",
                "user": "u/ethsmither"
            },
            {
                "text": "Telescope enthusiast here.  The scopes you see on a shelf in a store are almost exclusively garbage.  Research it a little and buy online.  Do not buy that scope you saw at Costco.\nIf you really want one of those crappy scopes - go on FB marketplace and you’ll find people basically giving them away, and for good reason.",
                "user": "u/nautius_maximus1"
            }
        ],
        "processed": true
    },
    "1bytmwv": {
        "post": "What addiction is seen as completely normal by society? ",
        "user": "u/whoam_itho",
        "comments": [
            {
                "text": "mobile scrolling",
                "user": "u/Beauty-Corner"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Some folks just can't see that they're always competing with others and wonder why they aren't liked. So, they try even harder, but it's a never-ending cycle. They'll never be happy with what they've got in life.",
                "user": "u/Single-Cartoonist124"
            },
            {
                "text": "infinite scrolling in apps",
                "user": "u/Potential-Tone-3628"
            },
            {
                "text": " Caffeine and sugar",
                "user": "u/notCRAZYenough"
            },
            {
                "text": "Being a workaholic",
                "user": "u/Patient_Effective_49"
            },
            {
                "text": "Coke. I know people that don't remember the last time they drank water.",
                "user": "u/Nyanzerfaust"
            },
            {
                "text": "Caffeine.\n\nThe amount of coffee I've seen people drink all on ambition to \"get through the day\" is rather alarming.",
                "user": "u/Jncocontrol"
            },
            {
                "text": "Honestly I think alcohol culture. Especially here in Australia, I can’t talk for other countries. Everyone is so dependant on drinking it’s a shame",
                "user": "u/d4ddy1998"
            },
            {
                "text": "TikTok",
                "user": "u/EngineDigital2796"
            },
            {
                "text": "Shopping and overspending.",
                "user": "u/Lunakill"
            }
        ],
        "processed": true
    },
    "1c2ubv0": {
        "post": "What’s the biggest scam in tech that has become widely accepted?",
        "user": "u/cutypatotie",
        "comments": [
            {
                "text": "“We have changed our terms of service.  Click here to accept and continue using our services.”",
                "user": "u/sunnyspiders"
            },
            {
                "text": "Unsubscribe button not being honored. Tactics include:\n\n1. It takes 15 days to unsubscribe but 1 min to subscribe.\n2. Sometimes link does not exists at all.\n3. Sometimes it takes you to a non existent page.\n4. Sometimes it asks you to login but you never had an account.\n5. Sometimes they will randomly send emails even after unsubscribing , especially around holiday season. Like out of the blue they will email, I think they got a new incompetent marketing guy.\n6. Them not realizing that they product they sell is not something I buy or need on a regular basis. Eg: indochino , how frequently do you think I buy a new suit.\n7. The whole marketing email is an image and not an html. Clicking on it just opens the image or takes you to home page (mostly sites from India )\n8. Somehow referencing the canspam act and sending it to their privacy email stops all the emails suddenly. But the. Point 5 happens.",
                "user": "u/kindrudekid"
            },
            {
                "text": "Trapping customers with subscriptions",
                "user": "u/YJeezy"
            },
            {
                "text": "Printer cartridges",
                "user": "u/mica280amg"
            },
            {
                "text": "Non-replaceable batteries. ",
                "user": "u/whittlingcanbefatal"
            },
            {
                "text": "Subscription with ads. Ads was only widely accepted because “we had to maintain our work somehow”. Ads ruined the internet.  \n  \nThen subscription came along, fine a paid version to get rid of those pesky adverts.  \nBut hey ho, let’s get more money from both sides.  \n  \nAlso, premium content.  \nAll content use the same platform.  \nThey are forced to do extra work to separate content in the delivery and choose which content is premium.  \n  \nIt’s a scam on top of their subscription scam.",
                "user": "u/ImTalkingGibberish"
            },
            {
                "text": "Here’s a new product! (Uber! DoorDash! Amazon!) It’s so cheap and easy! \n\nOne year later: Sorry! We had to raise prices! Sorry, you have to pay for a membership now! Sorry, we had to make the app really confusing so you’re not really sure what you’re buying! Sorry, you have to wade through 1 million ads to find what you’re looking for!\n\nSorry, not sorry!",
                "user": "u/r33c3d"
            },
            {
                "text": "Everything needs an app.  Especially physical devices.  I don't want your cheap buggy app to use my thermostat, scale, battery, lock, or light bulb.  Ship one if you want, but devices should conform to standards-based, documented protocols so I can control them however I want.  I also don't want to install an app just to do something that works just fine on a website.\n\nAlso requiring Internet connectivity is crappy design.  I don't want basic functionality depending on your servers being up (and requiring accounts and giving you unknown data).  My whatever should not stop working because you decided to stop spending money on the servers.  This is bad with software but egregious with hardware and unacceptable with household devices (my water heater should never depend on outside servers).\n\nI've been in tech a long time.  While greed and control and access to sellable data drives lots of things, there is also an attitude surviving from the 90s and 00s that the lifespan of anything is a few years.  This attitude infects product design even in fields where lifespans are decades and replacement costs are high as we add compute to everything (which can be a great thing).\n\nUSB was successful not because it had one (ish) plug, but because it standardized the protocols devices used.  All mice speak one protocol, so anything that knows it (hci class) can handle any mouse.  Zwave and ZigBee tried to do this for household stuff, but instead we got vendor proprietary, Internet connected, phone-home, WiFi devices.\n\nRant done.",
                "user": "u/darthsata"
            },
            {
                "text": "Everything as a service",
                "user": "u/redditmethisonesir"
            },
            {
                "text": "Apps and accounts for *eeeeeeverything*. Especially when it could just be a website with guest checkout. I'll never go to McDonald's again because you need an app to get their real, ~~affordable~~ **non-absurd** price, and last weekend I tried skiing at Pico or Magic, but they needed an account to be created online, and you could only buy a ticket through the account. They didn't let you just walk up to the ticket window and buy a ticket. Ridiculous.",
                "user": "u/i_drink_wd40"
            }
        ],
        "processed": true
    },
    "1c851kx": {
        "post": "In 20 years someone will ask what was covid lockdown like, how will you answer?",
        "user": "u/MooglePomCollector",
        "comments": [
            {
                "text": "Covid lit something in me and I've been gassed up ever since. I started mowing lawns out the trunk of my '03 Accord. Then I learned how to climb and properly remove trees. I have a big ol truck and trailer and a ton of equipment now. I was an alcoholic server/bartender before and super depressed. Two of my teenage kids have moved in with me and I'm in the best shape of my life.",
                "user": "u/jamestoneblast"
            },
            {
                "text": "\"Ahh, the great toilet paper shortage of the 20s,\" is how I'll begin.",
                "user": "u/Acrobatic_Garbage_52"
            },
            {
                "text": "The bizarre determinations on who could be considered an \"essential worker\".  My son was considered an essential worker.  He was a teenager working his first job in fast food.",
                "user": "u/nicoal123"
            },
            {
                "text": "Surreal mostly",
                "user": "u/raccoonlovechild"
            },
            {
                "text": "Weird. Lots of anxiety but it was also kinda peaceful.\n\nI count myself very lucky that I had a stable job that I could do from home and that I owned a house with a nice outdoor space.",
                "user": "u/Hrekires"
            },
            {
                "text": "I'll be surprised if anyone asks.   When it did strike, my brother who studied infectious diseases while in college, was astonished he'd never thought to ask our four grandparents about the Spanish Flu.  They were all young adults when it hit.",
                "user": "u/BigGrayBeast"
            },
            {
                "text": "My best friend started wearing masks, carrying hand sanitizers and telling everyone that when the vaccine becomes available, she is first in line.\n\nRight before she could get the vaccine, she got COVID, ended up in ICU where she was isolated for 6 weeks and no one could visit her at the hospital, then moved up to another part of the hospital where she died. \n\nThe last phone call we had, She told me she can't stand the hospital because \"the food sucks here\". \n\nShe couldn't taste the food. \n\nRIP Sully. Everyone loved you and we all miss you.",
                "user": "u/PULLS-NOSE-HAIRS"
            },
            {
                "text": "*\"It was the best of times, it was the worst of times. It was the cleanest of times, it was the dirtiest of times. It was the quietest of times, it was the loudest of times. It was the funnest of times, it was the boringest of times.\"*",
                "user": "u/Old_RedditIsBetter"
            },
            {
                "text": "No difference for me. Work was somehow considered “essential”. We make cabinets drawers and I think we had maybe 3-4 orders for the Covid tents during the lockdown.\n\nOne day of work to be considered essential for the whole lockdown.\n\nAm an introvert/gamer and just bought my house so didn’t really have need to go anywhere.\n\nOk one difference: Walmart closing at 8pm meant I couldn’t go grocery shopping after work anymore.",
                "user": "u/jwagne51"
            }
        ],
        "processed": true
    },
    "1c3yv0n": {
        "post": "Women of Reddit who chose to be a “side chick” to a taken man, why did you do it? How did it end?",
        "user": "u/FinalEntertainment60",
        "comments": [
            {
                "text": "He left her for me, I married him, he cheated on me with her hahaha 💀💀💀",
                "user": "u/RoutineBanana4289"
            },
            {
                "text": "I had a friend that cheated on all her partners or dated other friend’s partners. She was extremely attractive and seductive. She knew exactly how to get any man. The day she told me she slept with our mutual friend’s boyfriend, I knew I couldn’t trust her. Our friendship fizzled out months later.",
                "user": "u/Remarkable_Rub_701"
            },
            {
                "text": "I didn't know for two years. When I confronted him about making plans on FB to move in with another chick and accused him of having another women, he told me that technically I was the other women, but she was willing to let me move in with them.  We broke up and he moved in with her a few months later.\n\nA year after we broke up he called me complaining that she wasn't financially responsible and wasn't able to run a house as well as me. He asked me to move to Florida with him. I laughed at him and said he should have thought about that before telling me I was the other woman.",
                "user": "u/darklinghate"
            },
            {
                "text": "I was 19, he was 39 and my manager. Now that I grow up and I see things from an outside perspective I feel completely disgusting about the whole situation and I feel very bad for her cause she never knew and I believe they got married in the end. Sorry not much to say I just need it to take it out of my chest...",
                "user": "u/effs19"
            },
            {
                "text": "He told me he left her.  He didn't. So I chose to out him to her every chance I could get. Ie. He'd send me letters apologizing or begging we stay together, so I'd mail them to her workplace so she could see what a loser she has.  Welp... he died at age 35,  she got a $950,000 insurance payout, and I was left salty and bitter.  Lol",
                "user": "u/Immediate-Ad-6364"
            },
            {
                "text": "Because I have major commitment issues and the idea of a low-maintenance \"relationship\" is the dream. Spoiler alert: it ended with me feeling like a complete idiot.",
                "user": "u/Adventuroussexy"
            }
        ],
        "processed": true
    },
    "1c0w1gr": {
        "post": "What family secret was finally spilled in your family?",
        "user": "u/kaushman2",
        "comments": [
            {
                "text": "My aunt didn't lose her teaching job due to budget cuts like she'd always claimed. Turns out she had never had a valid teaching license to begin with, regularly had affairs with the dads, and embezzled PTA money!",
                "user": "u/itsjustmo_"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "That my dad's little sister wasn't really his little sister.  It was his sister's baby, raised by his mom.  The girl didn't know until she was 21.",
                "user": "u/Ok-Thing-2222"
            },
            {
                "text": "My sister and I found out in our mid/late-20s that we had a full-on brother. Our dad got our mom pregnant in high school and cause it was the 60s it was all hush-hush and she went to do her senior year “with family” and just quietly came back to town. They ended up getting together for real in college and no one knew - not their life-long friends or even my uncle. Our brother had a good childhood with his adoptive family, but he was always curious about his birth mother so he wrote her a letter. He sure was surprised to also come to meet his dad and two sisters. Crazy thing is he didn’t live too far away and we all look extremely alike. Would have been weird if we’d have bumped into each other otherwise.",
                "user": "u/LazyLeslieKnope"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "My mother is kid #7 of 10. My aunt (kid #4) who was born in 1945 did her DNA and found out that she has a different father from everyone else. She was devastated. There was always rumor that there was an affair but nobody talked about it. She has so many questions but nobody's alive to answer her.",
                "user": "u/bossykrissyCC"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            }
        ],
        "processed": true
    },
    "1bxchx7": {
        "post": "What is your not so fun fact?",
        "user": "u/Ghost-5AVAGE_786",
        "comments": [
            {
                "text": "One of the most common ways to get testicular torsion is just sleeping wrong.",
                "user": "u/ContentTask2032"
            },
            {
                "text": "Horses can't throw up. If they need to throw up, they'll die.",
                "user": "u/AdExcellent8978"
            },
            {
                "text": "There is a condition in which damaged tissue is replaced by bone. People with this condition are slowly consumed by their own skeleton and have to choses which position they want to spend the rest of their life in after a certain point",
                "user": "u/BaymaxJr"
            },
            {
                "text": "Andy was a goose who was born without feet on a farm in Nebraska. He was disabled for the first two years of his life, until an inventor called Gene Flemings heard about his disability and decided to create a new method of movement for him - he initially tried to teach Andy to ride a skateboard, but eventually settled on teaching the goose to walk in baby-sized sneakers. Since Gene worked with a local charity for disabled children, Andy became a role model - and even caught the eyes of the media, with Nike offering a lifetime supply of shoes, and the pair featuring on the Tonight Show with Johnny Carson.\n\nAndy disappeared on October 19th, 1991, and was later found with his head and wings torn off. The perpetrator was never found.",
                "user": "u/Cardinal-Lad"
            },
            {
                "text": " Butterflies prefer blood, sweat, and tears to pollen and nectar.",
                "user": "u/fighterpilotace1"
            },
            {
                "text": "There's a serial killer in my state. Bodies have been found dumped in the same way in the same spot a few miles south of me. It's not been reported to the news at all but there's public police reports that all describe the same thing. People go about their daily lives in the surrounding neighborhoods and even hike in the park every day. None of them have a clue or something close to a hint that tells them they could stumble upon a body in those woods.",
                "user": "u/Accidental_Taco"
            },
            {
                "text": "Dolphins can be sexually attracted to you and will definitely try to do something about it",
                "user": "u/NazunaSimp9"
            },
            {
                "text": "There is a whale called [52 Blue](https://en.wikipedia.org/wiki/52-hertz_whale) that only sings at their frequency meaning it can't communicate with other whales. It is nicknamed the loneliest whale on the planet.",
                "user": "u/GotPC"
            },
            {
                "text": "Judith Barsi, the girl who played ducky in the land before time was shot in the head by her own father after years of abuse at his hands",
                "user": "u/smartshoe"
            },
            {
                "text": "Horses have 350° vision they have a 5° gap at the front of their sight and a 5° gap at the back of their sight. If you stand directly behind them they don't see you. And that is what triggers the kick reaction",
                "user": "u/OkInterest3646"
            }
        ],
        "processed": true
    },
    "1bzn2oq": {
        "post": "What's the best example you have witnessed, of someone destroying their own happiness/Life?",
        "user": "u/Addictiveprinces",
        "comments": [
            {
                "text": "I was a Child Protection Specialist for years. I was assigned to work with a certain mom. It was the third time the courts had been involved with her due to “drug abuse”. But her drug of choice was huffing. The only huffing case I ever had. She was absolutely a lovely person. She had worked hard to earn a degree and enter into a career field. She was kind and beautiful. She was cooperative and she was determined. But despite how hard she was trying she would relapse and this was to be the last chance she got with the courts so the stakes were high. We worked so well together. She spent 18 months going to treatment, getting re-employed, getting her own place and having increased visits with her kids. Who were also wonderful. The kids had been staying at her parent’s place while we were working towards progress. We went to court and requested reunification and the judge granted it. We were all so proud of her!! And happy for them as a family. We planned to fully move her kids home with her a week from that very court date. \n\nTwo days before we planned to return her kids to her she drove her car through the front of a Walmart because she had been huffing and was high. She killed a Walmart employee and proceeded to huff herself to death in the electronics isle, where there was keyboard duster spray, while law enforcement was on its way. I got the news at 5am that she was dead and had to go tell her children they wouldn’t be going back to their mother. Ever.",
                "user": "u/Strong_Tree_8690"
            },
            {
                "text": "I worked on a school bus as a monitor/aid. There was one driver (we'll call him Ed). Ed was always complaining about something,  every single day there was some new issue, some problem. He was a bit of a pain. He got into an argument with one of our supervisors over the radio one day and earned himself a 3 day suspension.\n\nHis first morning back from his suspension. First route of the day, he gets on the radio and starts back complaining. Dispatch asks him a few simple questions, he responds with hostility and some really unprofessional comments. The director of transportation (our big boss) gets on the radio and asks Ed to meet him in his office after morning routes. Ed responds, \"I'll be there if I have time\" boss says, \"I need you to understand, this is not optional\" Ed comes back, \"I need YOU to understand, I'll be there if I have time!\" Mind you, this is on the radio as we are picking up high school kids, everyone can hear what's happening this entire time. Another dispatcher calls in and tells Ed \"when you finish your high school route, park your bus there at the school. We are bringing someone to take your route over, and to bring you back to the lot\". Ed did not like this and responded by saying, \"Negative. I am finishing my route. Me. If you want someone to drive my route, you get (our boss's boss) and have her come drive this route. Otherwise, I am finishing my route.\"  Dispatch asked for an ETA to the high school, he responded \"whenever (our boss's boss) is gonna be there. Otherwise, I get there when I get there\". Somewhere around this time he starts talking like, they were targeting him and picking on him and that  \"it ends today\". Again, at this point he has a bus full of high school kids.\n\nNow, I did not see what happened at the high school, but I heard from several other drivers. Apparently the police were waiting for him once he got there and they removed him from his bus. To quote one driver \"he acted a fool the entire time\". I'm not sure exactly what he was charged with, maybe kidnapping since he acted like he wasn't gonna bring the kids to school unless he got what he wanted? Theft for not bringing the bus back? No clue. But I do know he was arrested and fired. A few days later we get the news that he had a heart attack and died. Most likely from all the stress.",
                "user": "u/Klown1327"
            },
            {
                "text": "My parents old pastor and best friend. He had many friends, a successful music career, ran an music venue, had a doting wife, five kids. Then he decided to cheat on his wife. He became hugely paranoid and started tracking his wife and kids so that he knew where they were and he wouldn't get caught. He installed hidden cameras throughout his house because he convinced himself that his wife was probably cheating too. (she wasn't) He also would tell her to stay home because \"no one likes you\" and \"no one wants you to come because you are boring.\" Also lies. My parents caught him red-handed all over a woman at a concert that he didn't think they would be at. They told his wife and she called him and he lied and then let slip that he knew where she was. That's when she found the cameras and the air tag on her car. \n\nNow, none of his children talk to him, he lost the house, his friends, his music buddies, everything. The woman too. She left him when he had nothing to give. And he's not remotely apologetic about it and still tries to convince people that he was in the right. He lives in a trailer by the beach now, trying to relive his youth at 65.",
                "user": "u/FiendishCurry"
            },
            {
                "text": "Recent example, guy was a doctor and now cannot work because he hit his wife while they were getting divorced \n\nI don’t know the specifics of it but the domestic violence offence on his record is prohibiting him from working in medicine",
                "user": "u/badgersprite"
            },
            {
                "text": "Ex Co-worker applied for same internal job opening as me. I got the position, and she instantly messaged all of our co-workers that she was going to \"punch me if she sees me in the parking lot\"  while they and myself were at work. Someone reported it, and that's how I found out.  She got fired on the spot. For weeks, she continued to call my personal phone and state I owed her money for her losing her job. Anyways, she ruined her reputation, her creds were reported to the board by my employer. \nAll she had to do was take a step back and ask the employer why she didn't get the position instead of going right to emotions and completely jeopardizing her job.",
                "user": "u/thatpunknurse"
            }
        ],
        "processed": true
    },
    "1ccrmu6": {
        "post": "What screams “I’m economically illiterate”?",
        "user": "u/ZombieCapital3247",
        "comments": [
            {
                "text": "Confusing personal finance with economics",
                "user": "u/Lets_Smith"
            },
            {
                "text": "Expecting prices to reduce when inflation goes down.",
                "user": "u/Banditofbingofame"
            },
            {
                "text": "Not understanding marginal taxes.\n\nNo, there is no scenario where you get a raise and your take-home pay goes down because of reaching a new tax bracket.",
                "user": "u/ryegye24"
            },
            {
                "text": "Refusing a raise because \"it'll bump you up to the next tax bracket.\"",
                "user": "u/zkgv"
            },
            {
                "text": "Not knowing the difference between finance and economics",
                "user": "u/Elin_Woods_9iron"
            },
            {
                "text": "A parrot whose owner has buyer's remorse.",
                "user": "u/Non-NutritiveProduct"
            },
            {
                "text": "One time I worked at lowes, and a customer wanted to buy an item. I told her that she could buy the rest of the items and come back for that one when we had it in stock.\n\nShe says \"no because then I'll pay more in taxes.\" \n\nShe must have thought that purchasing items separately would cost more in sales taxes.",
                "user": "u/Voltshift773"
            },
            {
                "text": "Sunk cost fallacy.",
                "user": "u/PaulRudin"
            },
            {
                "text": "There was a survey done in the last year or so, asking Americans whether they thought the current unemployment rate was a 50 year high or a 50 year low.\n\n\nA substantial fraction thought it was a fifty year *high*.\n\n\nMost people are totally unfamiliar with the actual economy and instead have beliefs driven by news headlines.",
                "user": "u/BlackWindBears"
            }
        ],
        "processed": true
    },
    "1c0xrwz": {
        "post": "What’s the worst episode of a good TV show ever made?",
        "user": "u/moon_jock",
        "comments": [
            {
                "text": "When Eric went to Africa and was replaced by Randy in That’s 70’s Show",
                "user": "u/TheGreatCornolio682"
            },
            {
                "text": "Whatever the episode of Dexter where we first realise Deb wants to F her bro. OR the lumberjack finale.",
                "user": "u/blahblahrasputan"
            },
            {
                "text": "That first episode of Two Many Cooks. Almost didn't make it through even the intro",
                "user": "u/tbaytdot123"
            },
            {
                "text": "That episode of Blue’s Clues where Steve went to college.",
                "user": "u/Monty279"
            },
            {
                "text": "The one episode of ‘Lost’ that explains where Jack got his Tattoo. Season 3 Episode ‘Stranger in a Strange Land’",
                "user": "u/Schootypantz"
            },
            {
                "text": "When Fonzie jumped the shark.",
                "user": "u/Old-Ad3718"
            },
            {
                "text": "Series finale of Dexter. Felt insanely rushed, Dexter didn’t behave the way we as viewers know he would behave and they just ended it in a terrible way. I was furious. That was 10 years ago and I’m still furious",
                "user": "u/caffPOW1201"
            },
            {
                "text": "Those Beth in the hospital episodes in The Walking Dead.",
                "user": "u/Capta1nKrunch"
            },
            {
                "text": "The last episode of The Man in the High Castle. It’s almost as if they never planned an ending and just rushed it all in the last 20 minutes. What a waste of a series.",
                "user": "u/TheGrinningSkull"
            }
        ],
        "processed": true
    },
    "1bujupw": {
        "post": "Obama supporters in 2008 or 2012, how do you view him now over 10 years later? ",
        "user": "u/Ironically__Swiss",
        "comments": [
            {
                "text": "I still remember a guy on Facebook complaining about Obamacare and saying ACA was better. People corrected him and he deleted his account.",
                "user": "u/pendletonskyforce"
            },
            {
                "text": "There have been many years in which I've benefited from the ACA. So thanks, Obama.",
                "user": "u/TJ_McWeaksauce"
            },
            {
                "text": "As a non USA person (Australia) my view is he was a diplomat, a fine representative for your country, articulate, and a decent person. His track record of getting things through was a bit below par, though he didn't always have a supportive Congress. Overall, a good person and President. IMHO.",
                "user": "u/De_chook"
            },
            {
                "text": "Wish he was tougher on banks but overall he was fine.",
                "user": "u/kingofmymachine"
            },
            {
                "text": "we didnt realize how good we had it",
                "user": "u/weepinwilo"
            },
            {
                "text": "I still love Obama the person. However, when I look at how the democrats under Biden have been able to rally together, pass multiple laws, work behind the scenes with international partners, win state elections… I wonder if there isn’t some, if not a lot of truth in the commentary that Peter Zeihan has of Obama in that he was largely an Ivory Tower professor who enjoyed debates with his cabinet but didn’t really want to meet with others and didn’t quite understand how to wield the executive branch effectively. Looking at what the democrats under Biden have been able to do with the CHIPs act, the IRA, the infrastructure bill, erasing student debt, winning back state legislatures, coordinate aid for Ukraine, nudge the Saudis and Israelis closer, working the Hungarians and Turks behind the scenes to allow the Swedes and Finns into NATO, putting China on the economic defensive, etc. I can only dream of what Obama could have achieved if he had more experience in govt. \n\nIn summary: still love Obama the person but I wish he had more experience going into the presidency and could work the US govt to get more of his goals achieved.",
                "user": "u/sikhster"
            }
        ],
        "processed": true
    },
    "1cc3pnq": {
        "post": "In the USA when we dug holes we were 'digging a hole to China' in your country, where were you digging to?",
        "user": "u/wafflecheese",
        "comments": [
            {
                "text": "South America.\n\nI'm from China.",
                "user": "u/chenyu768"
            },
            {
                "text": "Australia. I'm in the UK.",
                "user": "u/cyclodextrin"
            },
            {
                "text": "To the USA",
                "user": "u/Lmknot"
            },
            {
                "text": "Germany here, we are digging to china as well :D",
                "user": "u/FieserKiller"
            },
            {
                "text": "Also China, even though the point exact opposite of Toronto is somewhere in the Pacific Ocean.",
                "user": "u/Gramage"
            },
            {
                "text": "China too. It is weird that it's china too because my home country is very far from the US",
                "user": "u/Divine-Crusader"
            },
            {
                "text": "In Japan the one I heard the most was digging the hole to Brazil.",
                "user": "u/lazyflavors"
            },
            {
                "text": "[This site](https://www.antipodesmap.com/) lets you see where you would have actually been digging to.",
                "user": "u/jpiro"
            },
            {
                "text": "We dug a hole about 20 feet deep \"to China\", mostly one kid at the bottom scooping dirt into a bucket on a rope lowered by other kids from the surface. \n\nEventually our parents found out and made us fill it with raked leaves (it was fall).\n\nWe still hung out at our hole, jumping into the leaves until one day one of us (not me) threw a lit match into the hole. Fire department was called and we were all grounded.",
                "user": "u/SufficientDust9379"
            },
            {
                "text": "Hopefully we hear from someone who grew up in Australia or China. I really want to know where they were digging to, since apparently there are so many different locations that dig to them.",
                "user": "u/staring_at_keyboard"
            },
            {
                "text": "Seeing as how we're all ending up in China, how about we meet in Chaoyang? Get us some dumplings!",
                "user": "u/Of_Mice_And_Meese"
            }
        ],
        "processed": true
    },
    "1byldco": {
        "post": "What’s a secret you’ll never tell your significant other?",
        "user": "u/CowboyLikeMegan",
        "comments": [
            {
                "text": "That sometimes, her ambitions get in the way of living an actual life.\nLike Bill Withers said ; \"It's okay to head out for wonderful. But when you get to allright, stop and take a look around. Because this might be as far as you need to go.\"",
                "user": "u/ezionjd"
            },
            {
                "text": "That his mother is an exhausting gossiping windmill of geriatric nonsense",
                "user": "u/PettySquabble"
            },
            {
                "text": "That I often fantasize about being a hermit in a cabin in the complete wilderness.",
                "user": "u/SaladFingerzzz"
            },
            {
                "text": "that i think his mom is a terrible person because she didn't protect him. and their relationship is super weird.",
                "user": "u/Routine_Wear8442"
            },
            {
                "text": "I occasionally take a day off work to have some time to myself. I love them dearly, but I cherish having the apartment to myself, watching what I want on TV, and just enjoying the solitude. It’s my secret mental health day.",
                "user": "u/New_Art_1721"
            },
            {
                "text": "How challenging it is to navigate through their depressive episodes. Some days I’m so exhausted from picking up the slack and taking care of the kids and working. It’s hard to find compassion. I know he didn’t choose this. Some days are just harder than other and today was one of those day. I love you more than you’ll ever know.",
                "user": "u/exWiFi69"
            },
            {
                "text": "A few years ago one of our cats died after we had her for 14 years. We were all heartbroken and devastated by her loss. We noticed something was wrong on Thursday, took her to the vet on Friday, and she died late Sunday night.\n\nThe night she died, I sent everyone to bed and I stayed up with her. She kept getting into the bathtub and lying down as opposed to a bed we had set up for her.\n\nJust before she died, she let out a horrible scream and went into convulsions. Then she just stopped breathing.\n\nI never told my spouse or kids about that last few moments. I just told them she just slipped away. I still want to cry every time I think about it. I will never tell them about that.",
                "user": "u/123fofisix"
            },
            {
                "text": "When we first met he made me promise “if I ever gain too much weight you have to tell me to hit the gym.” We laughed about it but that was almost 5 years ago, and now he has gotten pretty overweight and I don’t know if I’m supposed to keep my promise or just let him choose his own path with his weight. I’m still attracted to him and love him more than ever, but I want him to be healthy…",
                "user": "u/Hot-Neck-9524"
            },
            {
                "text": "that i dont like his family",
                "user": "u/its_annaa_"
            },
            {
                "text": "The day after I met his parents for the first time in person, we were driving to his hometown and I had fallen asleep.\n\nI then woke up hearing them talking about me. \n\nHis dad, a man of few words, said “a woman like her who is both beautiful and intelligent is extremely hard to find. You are lucky and blessed.”\n\nThey kept speaking such pure, lovely, genuine words about me for a while, in Spanish at that. My boyfriend kept kissing my forehead while they were talking, assuming I was still asleep. I was listening the entire time. :)\n\nAdditional context: I’m Asian but I had been learning Spanish for a few months so I could connect with his family more. They probably would’ve thought I couldn’t understand them if I was “awake”, too, hehe.",
                "user": "u/Agile_Mud4957"
            }
        ],
        "processed": true
    },
    "1c4yo2h": {
        "post": "What are some subtle signs a person is not quite alright mentally?",
        "user": "u/BUMITHEGIANTANTEATER",
        "comments": [
            {
                "text": "Personal hygiene is usually for me a sign something ain't alright",
                "user": "u/Silent_Ad_8672"
            },
            {
                "text": "Difficulty to make simple decisions, hyper sensitiveness of any kind of criticism",
                "user": "u/ramonapap1"
            },
            {
                "text": "Speech patterns are a good indication. Mania can make people talk really fast or depression can make people not speak at all. How they speak, the words used, can also indicate issues. It's best to just ask if they're ok.",
                "user": "u/Suspicious-Goat-1452"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Isolation from other people. Little to no social battery because in their minds they think they are bothersome to people or that other people would not really notice them gone anyway.",
                "user": "u/starkissedjade"
            },
            {
                "text": "For me, it’s isolation. I haven’t been okay in years so now I work nights and barely interact with anyone. I’ve become so isolated\nI don’t even know how to integrate back into society or communicate properly. Appetite is also an indicator. When I stop eating and lose weight rapidly, something is very wrong. I’m usually hoping for death by starvation.",
                "user": "u/slut4suffering333"
            },
            {
                "text": "cancelling plans& making excuses not to do things \n\nlack of motivation& disinterest in normal activities\n\nhygiene lacking (even simply not brushing hair or teeth especially if it’s out of the normal) putting less effort into appearance \n\nmessy house, unable to cook or stay on top of normal tasks \n\ndefensive and hyper sensitive, irritable \n\nsleeping more or less\neating more or less \ndrinking more alcohol/ smoking/ spending/ eating or taking drugs more frequently\n\ngetting in trouble at work/ with the law for things like traffic offences \n\nfixation or obsession with certain things (could be anything) \n\non higher alert, on edge \n\nfailing in study, taking time off work \n\nmore interest in things that make you withdrawn from socialising  such as spending way more time on the internet or listening to music \n\nmore shy and nervous (less involved with conversations or more “embarrassed” when talking to people) \n\n \nthis is what i experience when my mental state starts faultering anyway.",
                "user": "u/blondieegamergirl8"
            },
            {
                "text": "Ever talk to someone for a while, like know the guy for months, and realize one day you don't really know anything about them? Can't recall them ever mentioning a family member or even a favorite color. Maybe you went out to eat a few times and they always insisted you pick the restaurant. Like they're scared to let you know anything about them. They're perfectly friendly, get you to talk about yourself, listen to you ramble about your hyper fixations, but when you try to talk to them about them they suddenly don't have anything to say.\n\nI've met a few people like this and most of the time I never figure out what's up, but a few times I've gotten them to open up about being bullied or emotionally abused as a kid.",
                "user": "u/None"
            },
            {
                "text": "As someone who's been there and seen others suffer, I have some to contribute\n\n-Sudden changes in behavior\n\n-Reckless behavior \n\n-Lack of motivation \n\n-Very high highs and very low lows \n\n-Mood swings \n\n-Changes in appetite (over/undereating)",
                "user": "u/hiyacoolcat7685"
            },
            {
                "text": "Lives in filth and squalor. Severe depression and other mental illnesses impair your executive functioning and motivation, so tending to basic hygiene and cleanliness is extremely difficult.",
                "user": "u/Ordinary-Grade-5427"
            }
        ],
        "processed": true
    },
    "1by3xvv": {
        "post": "What do you secretly judge people for?",
        "user": "u/BushidoX0",
        "comments": [
            {
                "text": "People’s self awareness like when they watch Tik toks loud in a quiet room without headphones. Or not knowing how to act in certain establishments.",
                "user": "u/icencream27"
            },
            {
                "text": "People who throw trash out of their cars onto the highway/street. People who just deliberately litter outdoors in a park or at an event.",
                "user": "u/Significant_You6221"
            },
            {
                "text": "Parents being jerks to their children and stepchildren.",
                "user": "u/Demonicbunnyslippers"
            },
            {
                "text": "Being obliviously in the way. Like getting to the end of an escalator and just standing there. Or standing with a group of people in a doorway or aisle. Or stopping to stare at your phone in the middle of the sidewalk.\n\nJust move out of the way like 2 steps and everyones life is easier.",
                "user": "u/Heavy_Analysis5"
            },
            {
                "text": "Things they decide to post online",
                "user": "u/anti_histamine_"
            },
            {
                "text": "When people don't clear their tables and leave rubbish behind at food courts or fast food restaurants.",
                "user": "u/Moon_Jewel90"
            },
            {
                "text": "Littering! If you knowingly throw trash on the ground, you don’t deserve the beautiful world we live in. Go live in Chernobyl or your local landfill, you piece of trash!",
                "user": "u/dontmakeitathing"
            },
            {
                "text": "How they talk behind someone’s back",
                "user": "u/xtinex89"
            },
            {
                "text": "Letting their kids act like assholes and pretending not to notice \n\nHowever, I don’t judge them if I can tell they’re stressed and trying their best- sometimes kids will act like assholes no matter what. \n\nIt’s rlly more abt how the parents act",
                "user": "u/Street-Winner6697"
            },
            {
                "text": "Not having social awareness. Talking loudly in a restaurant, Taking up a space on the sidewalk to take photos, holding up a line at a restaurant, etc.",
                "user": "u/Other_Self_2520"
            }
        ],
        "processed": true
    },
    "1c2iuqp": {
        "post": "If you were handed a box of everything you have ever lost, what would you look for first?",
        "user": "u/Themissrebecca103",
        "comments": [
            {
                "text": "I'd definitely be searching for my favorite childhood toy that mysteriously disappeared one day. It was this plush monkey named Bananas, and we were inseparable until one day he vanished into thin air. I've always wondered where he ended up.",
                "user": "u/fdjkafhlas4"
            },
            {
                "text": "My nana made me a quilt when I turned 18. Took her ages. We went to the fabric store to pick out patterns and colors and IT. WAS. BEAUTIFUL. Went to a Laundromat to wash it and all my babys clothes. Lived right around the corner. My son pooped, so I thought I'd run him home, and be back in 10 min. When I got back, 10 min later, my quilt was gone. Nowhere. I contacted the number for the place multiple times, but nobody ever found it. I still cry about it and never told her. That's what id look for first.",
                "user": "u/Friendly_Afternoon19"
            },
            {
                "text": "My pictures. 4 different times in my life I’ve lost all my photos",
                "user": "u/Capable-Ground8272"
            },
            {
                "text": "My orange stuffed rabbit named Sherbert that my grandfather gave me when I was born. I left him at a hotel when I was about 7 years old.",
                "user": "u/Human_2468"
            },
            {
                "text": "A box that had my stillborn son's pictures, hospital hat, and other items from the day I gave birth.",
                "user": "u/cheesusismygod"
            },
            {
                "text": "\"Bitcoin wallet password\"\n\n\\~ way too many early adopter bitcoiners probably",
                "user": "u/rackoblack"
            },
            {
                "text": "Mom's silver necklace that I (as a teen) gave to someone I thought I was close to but wasn't. Never saw the person or the necklace again.",
                "user": "u/Cuteprinces05"
            },
            {
                "text": "A skeleton key that my kindergarten friend gave me to remember her by on the last day of school that year. I never saw her again, and 6 year old me didn't do a great job of keeping track of important things back then lol",
                "user": "u/kaboomerific"
            }
        ],
        "processed": true
    },
    "1bvowdt": {
        "post": "you just won the lottery for 1.4 billion, what you doing ? ",
        "user": "u/DownBad_3x",
        "comments": [
            {
                "text": "Getting a Lawyer, an Accountant (Edit:) and a Fiduciary!",
                "user": "u/AnEpicBowlOfRamen"
            },
            {
                "text": "Find that Reddit post that tells me what to do when I win the lottery.",
                "user": "u/Head_Conference_68"
            },
            {
                "text": "Stay lowkey for a month use that time to set your priorities, goals, life ensurance, investments, business then execute one at a time",
                "user": "u/Tiny_Description_305"
            },
            {
                "text": "Quietly hire lawyers and accountants.  Begin a slow withdraw from my job, and social media.  quietly move, change my numbers, contract someone to wipe out my online footprint, strategize the most private way to claim the prize. try to disappear without anyone saying \"what happened to..?\"  Then spend a year traveling and acclimating to extreme wealth.  Once i'm over the woohoo! phase, figure out what i'm still passionate about and then do it to a level previously unimaginable.",
                "user": "u/Background-Mirror612"
            },
            {
                "text": "buy every house in my street and the nearby streets\n\nnow i have a zombie apocalyse simulation just for me, just need the zombies",
                "user": "u/siralmasy"
            },
            {
                "text": "Maybe finally be able to relax and not have the overwhelming obsessive thoughts about how I’m going to have to work every day until I die.",
                "user": "u/Sven_88"
            },
            {
                "text": "Buy more lottery tickets.  \nIf one ticket gets a load of money, just think how much a load of tickets would get.  \nPretty solid investment.",
                "user": "u/West_Appearance_8726"
            },
            {
                "text": "Ask reddit for advice",
                "user": "u/mknicks"
            },
            {
                "text": "Go to reddit and post with the title: \"**you just won the lottery for 1.4 billion, what you doing** ?\"",
                "user": "u/Apprehensive-Tap7672"
            },
            {
                "text": "Giving half of it to the government.",
                "user": "u/Challendjinn"
            }
        ],
        "processed": true
    },
    "1bq3xlr": {
        "post": "If you could dis-invent something, what would it be?",
        "user": "u/leo__78",
        "comments": [
            {
                "text": "Pop-up ads",
                "user": "u/AviatorShades_"
            },
            {
                "text": "Household appliances that are tied to subscription services",
                "user": "u/TheJH2M"
            },
            {
                "text": "I have heard of three inventors who regret what they put into the world (not going to bother looking up names rn)\n\nThe USB inventor regrets not making it so it could be inserted in either orientation \n\nThe k-cup inventor regrets how much extra trash they cause\n\nThe pop up inventor regrets inventing them at all.",
                "user": "u/LittleOrangeBoi"
            },
            {
                "text": "Spam calls, robo calls, phishing emails, pop up ads, and micro transactions in games",
                "user": "u/Hungry-panda23"
            },
            {
                "text": "Gerrymandering",
                "user": "u/GayGeekInLeather"
            },
            {
                "text": "planned obsolescence",
                "user": "u/w0rlds"
            },
            {
                "text": "Those nearly-blinding, unnecessarily bright car head lamps.",
                "user": "u/anonicrow"
            },
            {
                "text": "The medical insurance industry.",
                "user": "u/PizzaPastaRigatoni"
            },
            {
                "text": "Subscription services. Either let me try it for free then buy it full Price or let me rent it and charge me only for the amount of time I used it for.\n\nEDIT: Of course, it doesn't apply to everything. Subscriptions make sense for something like Apple Music, Xbox Game Pass or Costco, but I don't want to have to pay Adobe 60 dollars a month for Photoshop when I could just rent a license. You don't subscribe to a car, you just rent it for how many days you need it for.",
                "user": "u/SwiftlyIntrestedFr"
            }
        ],
        "processed": true
    },
    "1bqr3ji": {
        "post": "What's a terrible movie that you still love because you loved it as a kid?",
        "user": "u/Faultylntelligence",
        "comments": [
            {
                "text": "\"Van Helsing\" was critically panned for a number of reasons, but its gothic atmosphere and monster mash-up premise were just too cool for my young self to resist. I still enjoy its over-the-top action and Hugh Jackman’s performance.",
                "user": "u/OutsideMaterial4098"
            },
            {
                "text": "3 Ninjas",
                "user": "u/qwer1234abcd"
            },
            {
                "text": "Waterworld \nI’ve only heard bad things from everyone in the world about this movie, but I just loved it and always will",
                "user": "u/SherbsSketches"
            },
            {
                "text": "The Last Dragon. I mustve watched that movie 1000 times.",
                "user": "u/Jesters_thorny_crown"
            },
            {
                "text": "Macaulay Culkin's The Pagemaster makes me feel nostalgic ",
                "user": "u/SwimmingOwl8586"
            },
            {
                "text": "The Last Starfighter was my first favorite movie! Is it great? Probably not. But it’ll always be great to me!",
                "user": "u/Basic_Experience_186"
            },
            {
                "text": "The Lost In Space movie from 1998. It’s a mixed bag tonally and some of the SFX are clearly unfinished and the ending of the story is… not great. \n\nBut I love the designs and aesthetics. The acting and dialogue is fun and I really liked Matt LeBlanc playing a Han Solo-ish, smarmy pilot. I feel like if it had been completed and released during the ‘grittier, darker’ reboot era it would have been more successful.",
                "user": "u/Antoniobanflorez"
            },
            {
                "text": "Toy Soldiers with Sean Astin and Wil Wheaton LOL\n\nSo cringe but I was a middle schooler with big dreams of saving my school from a terrorist attack LOL",
                "user": "u/No_Designer_5374"
            },
            {
                "text": "Iron Eagle 1986 \n\nRIP Louis Gossett Jr. (just died today)",
                "user": "u/throwaway-6217"
            }
        ],
        "processed": true
    },
    "1c422iv": {
        "post": "You get paired with 100 random humans, if you're better than all of them at something you get 1billion dollars. What are you choosing?",
        "user": "u/ChaoticZac",
        "comments": [
            {
                "text": "Guess what brake pad belongs to a car, so many years working at a car repair shop have benefits.",
                "user": "u/Ykored01"
            },
            {
                "text": "Not bragging or anything, but I spent YEARS training to spit tooth paste directly into the sink hole with no splash back or paste getting on the rest of the sink bowl. Bullseye every time.",
                "user": "u/obviouslyfakecozduh"
            },
            {
                "text": "Procrastination.  I’m a Grand Master.  I got a birthmark when I was 9.",
                "user": "u/Metalhed69"
            },
            {
                "text": "Properly operating a nuclear reactor.",
                "user": "u/athomasflynn"
            },
            {
                "text": "Touching the highest possible point on a wall without jumping. I’m 6’8” so pretty good odds I’m gonna come out on top.",
                "user": "u/Thrilling1031"
            },
            {
                "text": "Logging into my online banking.",
                "user": "u/alex8339"
            },
            {
                "text": "Solving a Rubik's cube quickly. I'm not that fast, but I reckon the odds are in my favour",
                "user": "u/stephengc"
            },
            {
                "text": "Time for my Tetris 99 skills to shine 😁",
                "user": "u/PhysicalReindeer6577"
            },
            {
                "text": "Starcraft 2, my Diamond 1 rank is higher than any other person there.",
                "user": "u/Myrnalinbd"
            },
            {
                "text": "Ice hockey. Most people don’t know how to skate let alone play the sport well.",
                "user": "u/No-Ad7899"
            }
        ],
        "processed": true
    },
    "1cji04o": {
        "post": "Obese people of Reddit, what is something non-obese people don’t understand, or can’t understand? ",
        "user": "u/A_Lonely_Troll",
        "comments": [
            {
                "text": "The constant need to physically adjust yourself. \n\nI wear clothes that fit but I'm still constantly adjusting my clothes, my body position, etc. just to be comfortable and for my clothes to have a chance of hiding some of what's going on here. My thin friends almost never adjust their clothes and such.",
                "user": "u/Complete-Scar-2077"
            },
            {
                "text": "CHAFING\n\nIt's particularly cruel because it makes you even more likely to avoid walking or exercise thus ensuring you put on more weight.",
                "user": "u/IcyCrust"
            },
            {
                "text": "As a former obese person, having to pull down your tshirt/shirt to prevent it from lifting up. My non-obese self has well fitting clothes and I still subconsciously pull my tshirt down.\n\n\nThat and the glaring looks that you get when you stand in food lines at buffets or at airports. ",
                "user": "u/amadnomad"
            },
            {
                "text": "Finding clothes that fit, worrying if furniture would support you",
                "user": "u/beef_burrito_supreme"
            },
            {
                "text": "Shopping for clothes has definitely different criteria than skinny people. It’s not ”ooh, that looks pretty”, but ”ooh, they actually sell this in 5XL”!",
                "user": "u/ahjteam"
            },
            {
                "text": "How much you dread people taking photos of you because it always ruins your day to see yourself in a photo.",
                "user": "u/Schmomas"
            }
        ],
        "processed": true
    },
    "1ci4qug": {
        "post": "People who went to a wedding where the couple didn’t last long, what happened?",
        "user": "u/skilled-dreamer",
        "comments": [
            {
                "text": "(Witnessed by my parents, not me)   \n  \nDuring the wedding reception someone asked the bride and groom when they were going to have kids (They had been dating for 8 years before getting married, so everyone assumed they were going to have kids immediately after getting married). \n\nThe groom loudly said \"Oh man, I'm NEVER having kids!\" \n\nThe Bride burst into tears and had to go to the restroom. They lasted about a year. \n\nYou'd think that's something they would have talked about during that long time, but who knows.",
                "user": "u/paul_swimmer"
            },
            {
                "text": "The bride and groom got married and within 3 months, the bride found out the groom was married and had kids in a different country.",
                "user": "u/mimibox"
            },
            {
                "text": "My grandmother was married before she met my grandfather (this is back in the 50’s). I’ve only heard the story once or twice, but:\n\nShe was 17, he was in his 20’s. She was dirt poor in Kentucky, and he had a job. They got married, and within a few weeks he got pretty rough with her. When she told her parents, it came to light that he’d been abusive for a while. \n\nHer dad and brothers didn’t know her new husband as well as they’d like, since he was going to be part of the family and all, so they invited him on a hunting trip. \n\nAnyway, there was some kind of accident, and the guy got shot. Since he’d been in the service and she was his widow, my grandmother got some veterans benefits for the rest of her life. \n\nShortly thereafter (when she was 19-20) she met my grandfather and they were married just a few months shy of 50 years. One of the most compatible couples I’ve ever met.",
                "user": "u/Nwcray"
            },
            {
                "text": "I didn't actually attend the wedding. During lockdown, when we were working from home, this one colleague was always reluctant to have work related one to one calls with male colleagues such as myself. Eventually, I found out that her fiance would moan and get jealous that she was talking to other men on Teams, even if it was 100% professional  and work related. Even then, I thought \"woah\" but figured it wasn't my place to say anything. \n\nThey got married about 2 years ago. About 9 months ago, he asked for a divorce by text as HE, Mr Jealous, had found someone else.",
                "user": "u/SnooChickens9666"
            },
            {
                "text": "Both my brother and sister had short marriages.\n\nSister: husband turned up to the wedding high on crack. She fell in love with someone else.\n\nBrother: had a destination wedding on the top of a mountain that took half a day for the guests to hike including my dad who is missing a knee cap. They wound up with an open marriage, but the wife ran off with the “other guy” and their cat.",
                "user": "u/Myspacetui"
            },
            {
                "text": "They were both 35 successful lawyer and doctor. But had never spent the night at each other's house. \n\n\nAfter the marriage they couldn't agree who would move in with who. And filed for divorce after 3 months. No one knows why they even got married at all. I guess they felt like they were supposed to at that age.",
                "user": "u/randallAtl"
            },
            {
                "text": "Saw some signs at the wedding like ignoring each other, making rude and snide remarks publicly, etc. They tried to fix their marriage by having a kid earlier than they planned and that led to divorce. Both are married to different people now and have had more kids, by all accounts far more civil, even cordial with each other.",
                "user": "u/AgingLemon"
            },
            {
                "text": "During the reception the brides niece accidentally knocked over a drink that splashed the brides shoes and she back handed her in front of everyone. It caused a huge fight and the groom walked out right then.",
                "user": "u/Rare-Highlight-9674"
            }
        ],
        "processed": true
    },
    "1cfyo1s": {
        "post": "People above 30, what is something you regret doing/not doing when you were younger?",
        "user": "u/ThickEmployee8948",
        "comments": [
            {
                "text": "Worked an awful, dead end job for way too long.",
                "user": "u/celiacsunshine"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "This is a little complicated, but I wish I had been able to come to terms with not caring what people think of me when I was younger. It did wonders for my confidence.",
                "user": "u/DeepDown2332"
            },
            {
                "text": "Standing up for myself. \n\nI lived way too long trying to make others happy and letting them manipulate me\nMy family used this to their fullest advantage\nI stopped it now but wish I had the backbone 20 years ago",
                "user": "u/BreezinOnBy"
            },
            {
                "text": "TEETH\n\nWish I’d Brushed and flossed more regularly, gone to the dentist every six months; etc.",
                "user": "u/anthonystank"
            },
            {
                "text": "Staying in shape. It is so much harder later in life to keep up. lose weight and all the rest.",
                "user": "u/teaisjustsadwater"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "My friends and I talked about doing a 2-3 week Europe trip back in our 20s. “Oh maybe next year”. Eventually jobs, bills and families put all that to rest.",
                "user": "u/TraditionPast4295"
            },
            {
                "text": "Started smoking cigarettes. Did it for about 30 years although I've quit now. Don't do it kids !",
                "user": "u/sneakysmokey56"
            },
            {
                "text": "I regret thinking that nice things were not for people like me. The number of experiences, travel, career opportunities I turned down is crazy. All because I didn't think I was good enough to deserve them.",
                "user": "u/tea_ninja"
            }
        ],
        "processed": true
    },
    "1chjjm5": {
        "post": "What was advertised as the next big thing but then just vanished?",
        "user": "u/swedishplayer97",
        "comments": [
            {
                "text": "3D Televisions",
                "user": "u/cyclejones"
            },
            {
                "text": "Google+  they made it as this whole new social media thing and it flopped hard",
                "user": "u/Toematehos"
            },
            {
                "text": "Airship moorings at the Empire State Building",
                "user": "u/RunsWithPremise"
            },
            {
                "text": "Google glasses",
                "user": "u/CrissBliss"
            },
            {
                "text": "Quibi",
                "user": "u/SirNortonOfNoFux"
            },
            {
                "text": "HD DVD. BluRay won over. Then streaming killed it all.",
                "user": "u/latruce"
            },
            {
                "text": "The Metaverse",
                "user": "u/GearInteresting696"
            },
            {
                "text": "Microsoft Surface (not the tablet) was supposed to be some wave of the future type of concept, imagine Minority Report. Alas, I don't think it ever left the concept stage.\n\nTake a peek: [https://www.youtube.com/watch?v=6VfpVYYQzHs](https://www.youtube.com/watch?v=6VfpVYYQzHs)",
                "user": "u/thegreatestmeicanbe"
            },
            {
                "text": "the push to talk on cell phones. everyone had one then poof",
                "user": "u/meh_ninjaplz"
            }
        ],
        "processed": true
    },
    "1cf6s28": {
        "post": "What is the boldest thing you've seen someone do to greatly lower their cost of living?",
        "user": "u/GotTheC0nch",
        "comments": [
            {
                "text": "My younger brother decided to be a train hopper for roughly half the year so he doesn't have to pay for rent.",
                "user": "u/definitely_right"
            },
            {
                "text": "I remember reading a story about a guy who had an internship at some big tech firm, I think Google, in an extremely HCOL area. He bought an old uhaul and outfitted it for living. He parked in the company lot as obscurely as possible and moved every so often. Used the company showers and such. Probably the best way to manage that situation if you could handle it. ",
                "user": "u/The_Brightness"
            },
            {
                "text": "I had a friend who would go to farmer's markets and wait until the end of the day, then go up to people and offer to buy the leftovers at a discount. Not terribly exciting, but bold.",
                "user": "u/Nerditter"
            },
            {
                "text": "My best friend divorced his spend-a-holic wife who had gotten them into over $50,000 of credit card debt, and wanted to take out a second mortgage on the house to buy herself another car. \n\n\nHe ended up with half the debt, of course. But he moved in with his sister and dug himself out after 4 years.  He lives alone now and is the most careful person with money I've ever seen. \n\n\nShe's being supported by her parents who have her on a strict budget. She's almost 50 now. I shudder to think what will happen when they pass and she inherits. ",
                "user": "u/Any_Assumption_2023"
            },
            {
                "text": "Hmm...depends what you mean by \"the boldest.\" I'd say the most audacious behavior I've seen was from my former roommate and ex-friend \"Sarah,\" a narcissist and professional mooch, who used her then-friends to get a job, a cheap place to live, borrowed furniture, and even food, while also quietly stealing from us. I'm sure she effectively lowered her cost of living through the theft and manipulation.",
                "user": "u/ConcentrateTrue"
            },
            {
                "text": "Seeing the ad for US Airforce under this question is pure gold.",
                "user": "u/dmstrat"
            },
            {
                "text": "I got sick of continuously rising rents, moving rentals and working full time, so I bought a cheap houseboat and anchored it in the middle of the river in my city. Close to everything and totally off grid. There are no fees to anchor in the river so besides the cheap cost of the houseboat and a kayak to get to and from, it was free. It was a bit inconvenient, but I did it for 5 years while working 3-4 days a week and saved up almost everything I earned. Just bought a house 50% cash a few years ago because of that houseboat stint.",
                "user": "u/battleunicorn11"
            },
            {
                "text": "My FIL is a contractor. Thus, he has to buy lots of supplies. He buys gift cards first, then buys thousands of dollars worth of supplies on the cards. All so he can get the gas points. \n\nBut because he has to buy so much for his business, it adds up hugely. He hasn’t paid for gas in years. He also has to drive quite a bit so it’s a big money saver. \n\nSimultaneously the biggest boomer move and the smartest cheating of the system I’ve ever seen.",
                "user": "u/zucchiniqueen1"
            },
            {
                "text": "A student was living in Los Angeles, in an apartment with a rent he could afford, but wanted to get a master's degree in engineering from the University of California at Berkeley.\n\nBecause the Bay Area is one of the areas with the highest cost of living in the United States, the student decided to continue living in Los Angeles instead, and flew roundtrip from KLAX to KSFO at least three times a week.\n\nFor the entire academic year, he spent approximately $5,600 on his transportation, roughly equating to $650 a month.\n\nQuite an interesting story!\n\n[He posted the details at this link](https://www.reddit.com/r/berkeley/comments/13hv95y/i_survived_living_in_la_and_commuting_to_cal_by/).",
                "user": "u/britishmetric144"
            },
            {
                "text": "I got sick of paying rent, so I bought an RV and remodeled it to be a perfect bachelor pad. 40\" TV surround sound, recliner chair, room for a standup jetski. I paid someone in East Nashville $200 a month to park in their backyard and use their wifi. I saved up the rent I would have been paying and put a down-payment on a duplex in 2016. It was a good call. Then, I lived in half of the duplex and sold the RV for the same amount that I had into it. Around 3k.",
                "user": "u/barkingatbacon"
            }
        ],
        "processed": true
    },
    "1cfgeif": {
        "post": "What’s the creepiest town in the USA in your opinion?",
        "user": "u/Scrambl987",
        "comments": [
            {
                "text": "Shreveport is like The Last Of Us at night time.",
                "user": "u/DaveMcElfatrick"
            },
            {
                "text": "Salton Sea, CA went to clean out a family members house after they passed…didn’t see a single car on the road…or human…that whole weekend.  Felt sooo creepy.",
                "user": "u/Lessthancrystal"
            },
            {
                "text": "Tonopah, Nevada. Clown Motel next to a cemetery full of infants and workers who died in a silver mine.",
                "user": "u/Blixenk"
            },
            {
                "text": "Amboy, California \n\nAll of the stories are true. I lived out in 29 palms while my husband was stationed there a few years back. I heard stories of people getting run off the road, people pretending to have gotten in a car crash so you stop and help, candles being set up in the middle of the road, etc. His chain of command even had a meeting with them before the marine corps ball about not stopping on amboy because of how dangerous it was. I worked out there too and I know at least 10-15 bodies have been found in the last few years.",
                "user": "u/WallalaWonka"
            },
            {
                "text": "East St Louis, IL. Never seen a town that looked post-apocalyptic before going through there.",
                "user": "u/NagelEvad"
            },
            {
                "text": "It's barely a town anymore but definitely Mineral Springs, Missouri. \n\n\nIt was once a bustling town with a famous hot spring, but it dried up. Now various people live in very old houses with no electricity. No one knows their names but they send one person into town a month for groceries. \n\nIf you're there very long at all, they WILL shoot at you.",
                "user": "u/paddjo95"
            },
            {
                "text": "Gotta say it. My wife and I were vacationing in Bar Harbor, Maine, and decided to drive to the easternmost point in the US. So we made it Lubec, Maine. It was kind of foggy and looked totally deserted. I get Stephen King novels now.",
                "user": "u/AnybodySeeMyKeys"
            },
            {
                "text": "This would be a cool Netflix series to watch",
                "user": "u/PalaSS9"
            },
            {
                "text": "Centralia, PA. Has been on fire for over 50 years.",
                "user": "u/woman_thorned"
            }
        ],
        "processed": true
    },
    "1cdug78": {
        "post": "What movie’s visual effects have aged like milk, and conversely, what movie’s visual effects have aged like fine wine? ",
        "user": "u/waitingforthesun92",
        "comments": [
            {
                "text": "Who framed Roger Rabbit has aged great!",
                "user": "u/multiroleplays"
            },
            {
                "text": "Jurassic Park and Terminator 2 have aged very well considering they are 30 plus years old imo.",
                "user": "u/Scott_EFC"
            },
            {
                "text": "Davy Jones in Pirates of the Carribean still looks fantastic",
                "user": "u/cyber_moon"
            },
            {
                "text": "The special effects in Death Becomes Her (1992) have barely aged at all. I watched it a few months ago, and literally said out loud, \"They should have won an Oscar for these effects.\"\n\nThey did, in fact, win an Oscar for those effects.",
                "user": "u/roastbrief"
            },
            {
                "text": "Jurassic Park is over 30 years old and still looks better than the sequels.\n\nThe Mummy Returns had some of the worst CGI I'd ever seen for the Scorpion King. And yet The Two Towers was released the following year with some of the best CGI for Smeagol.",
                "user": "u/Plus-Statistician80"
            },
            {
                "text": "The Wizard of Oz actually set standards used even today in special effects, especially doing things backwards and then rewinding the film.  Car crashes and other accidents, weather events, etc  especially still use that method today and that was pioneered by the Wizard of Oz",
                "user": "u/llcucf80"
            },
            {
                "text": "2001 Space Odyssey, despite being released 56 years ago, looks surprisingly good. I recently watched the 4k version and I would believe it if you told me the space scenes were from a recent movie.",
                "user": "u/taste_the_equation"
            },
            {
                "text": "Aged like milk: the twilight baby",
                "user": "u/Live_Leather7284"
            },
            {
                "text": "The stuff with US Presidents in *Forrest Gump* still look pretty good to me.",
                "user": "u/wuapinmon"
            },
            {
                "text": "The original Alien from 1979 still looks amazing.  Star Wars also, from the same era.  Even earlier, 2001:A Space Odyssey, still holds up.  There is just something about practical effects.\n\nThe original Tron looks like a cartoon now.",
                "user": "u/iamthemosin"
            }
        ],
        "processed": true
    },
    "1cfmy10": {
        "post": "What is an example of “if it’s free, you are the product”?",
        "user": "u/LittleCuteStarUwU",
        "comments": [
            {
                "text": "Free VPN.",
                "user": "u/NotStompy"
            },
            {
                "text": "When I cook for friends. Surprise idiots! I’m doing this for the pleasure of your wonderful company! You fools!",
                "user": "u/LowmoanSpectacular"
            },
            {
                "text": "Reddit. They spent years getting you to create content that you do not own. They have now sold it. ",
                "user": "u/ODB247"
            },
            {
                "text": "**Nightclubs that only charge men for the entrance**",
                "user": "u/senhorwalterwhite"
            },
            {
                "text": "The $450 in visa gift cards I can get at work for doing their health and wellness program.",
                "user": "u/ApportArcane"
            },
            {
                "text": "Say you're watching a video on YouTube (or broadcast tv, radio, etc.) The creator isn't selling the video itself to make money, they're selling advertisers the fact that you will be watching their video and seeing an ad. You aren't exchanging money for a product, the advertiser is exchanging money for your views.",
                "user": "u/jagc3763"
            },
            {
                "text": "**The whole internet, google, youtube, Facebook, Instagram, even reddit, ect... They sell your information to advertisers. That's why it's free to you because you are the price**",
                "user": "u/rafaelwolney"
            },
            {
                "text": "free streaming services, you get tons of ads without subbing or adblocker.",
                "user": "u/Chrol18"
            },
            {
                "text": "Financial seminars (free dinner).",
                "user": "u/tinlizzy2"
            },
            {
                "text": "Companies generally need to make money eventually to exist. If you use something and don't pay for it the company is clearly making money somehow.\n\nLike you never need to pay a dollar to use reddit but how does reddit stay in business? The answer is that you aren't the customer and reddit isn't selling to you, reddit is taking you and selling your eyeballs/page views/data to advertising companies and that is where reddit makes the money to stay open.",
                "user": "u/rafaelwolney"
            },
            {
                "text": "Headhunters are a great example here. You don’t pay for them to place you in a role, the company that hires you fronts that cost. ",
                "user": "u/swiftie56"
            }
        ],
        "processed": true
    }
}