{
    "1b9o6zf": {
        "post": "What is the safest answer when your girlfriend asks if her friend is hot??",
        "user": "u/PetiteAsianStarJoy",
        "comments": [
            {
                "text": "\"ive never looked at her like that before\"",
                "user": "u/JasmiineJewel"
            },
            {
                "text": "I literally start singing, \"I only have eyes for you.\"\n\nI'm a terrible singer.\n\nAfter two versus, the conversation is over, and she has left the room.",
                "user": "u/flossdaily"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Say....\"No....but she's an awesome kisser!\"",
                "user": "u/BruteForceOpinion"
            },
            {
                "text": "\"Yes, I would love you if you were a worm.\"",
                "user": "u/Kemintiri"
            },
            {
                "text": "“Yea. Why? You interested in her?”",
                "user": "u/panachi19"
            },
            {
                "text": "No hablo inglés.",
                "user": "u/BenjiGValue"
            },
            {
                "text": "In an overly enthusiastic tone, \"Why, did she ask about me?\" Can't lose.",
                "user": "u/demanbmore"
            },
            {
                "text": "An ex pulled this on me regarding her best friend. My response, “She’s alright, but her best friend is damn sexy.”",
                "user": "u/I_like_dwagons"
            },
            {
                "text": "not as hot as your mom.",
                "user": "u/rainbowroobear"
            },
            {
                "text": "Never thought about it, but did you know the Roman Empire roadways is the reason railway tracks are the size they are today?",
                "user": "u/Middle_Manager_Karen"
            }
        ],
        "processed": true
    },
    "1b7jbvg": {
        "post": "What membership is 100% worth every penny you pay for it?",
        "user": "u/CamHalf",
        "comments": [
            {
                "text": "I’m a scuba diver. For $75/year I get extra insurance in case I have an accident while diving. They pay for medical evacuation, they have a dive doctor speak to the ER doctor if they don’t know how to treat me, and they help coordinate getting me into a decompression chamber if I need it. My health insurance won’t cover any of that.\n\nPlus I can call them anytime with medical scuba questions.",
                "user": "u/sweetawakening"
            },
            {
                "text": "I live on an island in Alaska with limited healthcare. An emergency flight to a more capable hospital will cost $50000. For $100 a year I save $49900 if I ever need their services. That $100 covers everyone living under my roof. There is no limit on the number of flights. And seniors pay $75. Of course, the flight isn't a guarantee. Bad weather or the donated jet needing repairs can, and does, prevent you from being flown out.",
                "user": "u/Ksan_of_Tongass"
            },
            {
                "text": "The Great Courses. It’s now under the umbrella of Wondrium (and they have a bunch of other stuff, but I look for the GC stuff) They have hundreds of courses. Each one has roughly 26-40 lectures. They’re the best professors in the world - the ones that students report as their favorite teachers. \n\nMy boyfriend and I always have four on Thursdays: a science, an art, a philosophy (or wild card) and a history. We’ve done classes like: botany, the analects of Confucius, The Medici’s, the physics of time, early humans and the history of food. \n\nI’ve got a good deal with them at $10/month all I can stream. Great for lifelong learners.",
                "user": "u/Shaydie"
            },
            {
                "text": "When my ex and I had first moved to New York we bought family memberships to the MET and the Natural History museum during the first week. Seriously, the best decision ever. They have ALL kinds of year-round events and things to do that you can bring family and friends.   \n\n\nThe MET has a members only rooftop bar and mezzanine, members only music events like we watched the philharmonic play Vivaldi's \"Four Seasons\" in the Temple of Dendur.  Members only gallery viewings, curator talks, talks by archaeologists and various things you could volunteer for. It was like having an \"In\" into the city.  \n\n\nThe Natural History museum had a monthly \"Jazz under the stars\" night with free food, drinks and music under the planetarium. I met Bill Nye and Neil Degrasse Tyson (when he was working there) and a bunch of other minor celebrities.   \n\n\nThese are not expensive memberships either.",
                "user": "u/joeldg"
            },
            {
                "text": "About 10 years ago, I was member of the nudist resort that was near me. For giggles, I brought in my college ID. About 160 a year for 24 hour access to the resort and grounds. \n\nFor me it was my country club. Pool, big hot tub, gym, sauna. By my math at the time, all I had to do was visit 5 times a year to pay for it. I was there 2 to 5 times a week. Since it was a very rural area and not much to do, going there saved me money as anything decently worth doing was an hour or more away.\n\nAlso since it was a nudist resort, most of the people that annoyed me were not apt to bother me. Perfect privacy to detach from the world.",
                "user": "u/Pyreknight"
            },
            {
                "text": "As a parent, the local children's/science museums. Got more than my money's worth on bad weather days",
                "user": "u/iambatmanjoe"
            },
            {
                "text": "I can't say for sure if it's \"worth every penny\", but there have definitely been occasional times my car broke down on the road that I was glad I'm a AAA member! \n\nOn a side note, back in the day, AAA TripTiks were the \"Google Map\" if you wanted to take a road trip. You could go in, tell the AAA person the trip you were planning to take, and they'd put together a personalized flippable roadmap for you including highlighting expected construction and tolls, etc.  Nowadays of course Google Maps and such does all that in real time on your phone so the TripTik is obsolete, but it was still pretty neat how they assembled them!",
                "user": "u/bodyknock"
            },
            {
                "text": "The US National Park Senior Pass.\n\nThe BEST bargain in the nation.",
                "user": "u/BrunoGerace"
            },
            {
                "text": "this made me remember MoviePass and now im sad",
                "user": "u/slothman137"
            },
            {
                "text": "Costco Executive. If you shop strategically and often enough, you gain back all the membership money through direct cash rewards, not to mention the amount of money you saved by buying everything you needed at a cheaper per-unit cost.",
                "user": "u/prettyfly4sciguy"
            }
        ],
        "processed": true
    },
    "1bg7hud": {
        "post": "What would instantly destroy your life just by doing it once?",
        "user": "u/ApexOverlordIsDrunk",
        "comments": [
            {
                "text": "As an “older” guy in the trades, fuck around with safety. I’ve seen enough people fuck their livelihood up by taking a stupid unnecessary chance. It’s always a shame when you hear of a young trades person die because you know they probably don’t know better or didn’t work with people who were teaching them how to do it safely.  Number one rule is come home at the end of each day!",
                "user": "u/Marginallyaccepted"
            },
            {
                "text": "Foraging and picking mushrooms you cannot identify.",
                "user": "u/boetelezi"
            },
            {
                "text": "Reconnecting with people who were bad influences on you. You'd be surprised how quick one can return to their old ways.",
                "user": "u/Leckloast"
            },
            {
                "text": "Pet the bison. Jump in the hot spring. Climb the rail. Hike into the desert when everyone and their mother told you not to. National parks are a gauntlet of Darwinian temptation.",
                "user": "u/Upvotespoodles"
            },
            {
                "text": "Negligent homicide. I’m sure self defense killings are not as difficult to handle as it is justified (not saying everyone would be fine), but negligent homicide is another level. You drive drunk, text while driving, or not pay attention and smack into a pedestrian, you’re going to live in a nightmare.",
                "user": "u/KingJohn_513"
            },
            {
                "text": "I have a huge fear of accidentally hitting someone with my car at night.",
                "user": "u/rach0509"
            },
            {
                "text": "Jumping into an unknown body of water head first. Seen it happen where some idiot jumps in head first and paralyzes himself. Sad, but it happens in less than 5 seconds.",
                "user": "u/HagsSecret"
            },
            {
                "text": "Probably committing a felony. Because getting a job would be hard, renting would be hard… so I am going to avoid committing a felony",
                "user": "u/ilike7hournaps"
            },
            {
                "text": "Unprotected sex in some cases",
                "user": "u/JerseyMBA"
            },
            {
                "text": "Any sort of criminal charge because I would lose my nursing license.",
                "user": "u/considermebranded"
            },
            {
                "text": "Meth, crack, heroin, and fentanyl all have pretty good track records of destroying lives.",
                "user": "u/mkwas343"
            }
        ],
        "processed": true
    },
    "1bl4t0w": {
        "post": "What screams “I have depression”? ",
        "user": "u/il_balilla",
        "comments": [
            {
                "text": "Sleeping to avoid living. Even if you’re not necessarily tired.",
                "user": "u/yourstrulyval23"
            },
            {
                "text": "completely tired all the time, even when you don’t do anything",
                "user": "u/Comfortable_Size_658"
            },
            {
                "text": "Constantly in a world in your head. I struggle with living like this. My mind and body are normally never in the same place.",
                "user": "u/SuperCyberWitchcraft"
            },
            {
                "text": "Intense irritation at small things.",
                "user": "u/Sauce_senior"
            },
            {
                "text": "Feeling like it’s a chore to do things that you used to love doing.",
                "user": "u/Accomplished_Item710"
            },
            {
                "text": "Snoozing for an eternity because you know what awaits you when you get up and face the day.",
                "user": "u/ErBoProxy"
            },
            {
                "text": "I was driving, as I frequently do for work, and realized I didn't have Spotify or the radio on. I am a music nut. I had been driving that way for hours. Thought back and had multiple days like that.\n\n&#x200B;\n\nJust wasn't interested in it. That was weirdly a big wake up call for me.\n\n&#x200B;\n\n**EDIT:** This blew up way more than I thought it would, so I thought I would clarify since this is getting a lot of exposure.\n\n&#x200B;\n\nNot listening to music is in NO way a sure-fire diagnosis for depression. Even in my most mentally-healthy phases, there is definitely times when I drive/cook/hang out in silence at times. That's normal.\n\n&#x200B;\n\nWhat isn't normal is that I've been listening to music since I was really young, and really got into it when I was like 9-10. Music is probably my main hobby. In a job where I'm on the road for anywhere from 30 mins to 6 hours a day, I listen to music all the time when I'm not on the phone for work.\n\n&#x200B;\n\nOne day, I had been driving for several hours, and just felt... numb. I had a realization that no music was playing- this got me thinking about how long this had been going on, and I realized I had been driving like this for a few weeks now. I also love to cook and listen to music- I'll sing along, make up lyrics, sing to my son, and generally have fun. I had stopped doing this as well. I was already growing concerned about depression, so I discussed this with my psychologist/therapist and PCP. They both agreed, after several discussions, that I am clinically depressed and that not having interest in things you once loved is definitely a sign of depression. So it was one of the first real \"wake-up\" calls for me.",
                "user": "u/HonestFalcon4444"
            },
            {
                "text": "Just kinda waiting for the day to end each day",
                "user": "u/4applepies1sweetea"
            },
            {
                "text": "Depression doesn’t scream, it would require too much energy.",
                "user": "u/DorkusMalorkus89"
            },
            {
                "text": "losing interest in literally everything and opting to just sleep instead.\n\nat one point i couldnt even bring myself to watch tv or netflix etc., i just did not care. same with being on my phone. then i lost interest in being awake and so sleep, beautiful beautiful sleep, became the answer.\n\nso i would say... that. lol",
                "user": "u/lizzard_lady8530"
            },
            {
                "text": "Gradually pulling away from everything. You hangout with friends less frequently. You start doing the bare minimum at work. Eventually you just stop caring all together and all you want to do is be alone.",
                "user": "u/DiamondCupcake"
            }
        ],
        "processed": true
    },
    "1b7pfa2": {
        "post": "How are you feeling about the inevitable Trump v Biden rematch?",
        "user": "u/krebstar10000",
        "comments": [
            {
                "text": "Exasperated with our polarized political system that feels like a chess game that no one is winning",
                "user": "u/Candid_Wallflower"
            },
            {
                "text": "Tired of “living through historic times”",
                "user": "u/devpuppy"
            },
            {
                "text": "Not feelin good my guy.",
                "user": "u/briowatercooler"
            },
            {
                "text": "I’m tired boss.",
                "user": "u/DIKS_OUT_4_HARAMBE"
            },
            {
                "text": "There's been no break since 2015. I need a political vacay.",
                "user": "u/runnersoncorners"
            },
            {
                "text": "I have never wanted a sequel less than this.",
                "user": "u/Clovis_Winslow"
            },
            {
                "text": "Annoyed. As someone recently said for my Gen X generation... in the 90s the presidents were our parents age.\n\nAnd ever since then the presidents are *still* our parents age.\n\nThe boomer generation really needs to give up the reign they hold so tightly.\n\nEdit: yes Biden is from the Silent Generation, but that's not the point. The point is the parents of Gen X have held power for over 30 years. Time for a serious change. We need term limits and age limits and the young to vote!",
                "user": "u/sorengray"
            },
            {
                "text": "I’m feeling like it’s way past time to put an age cap for all government offices. I’m Gen-X and I think 70+ year olds are way too old and out of touch to be in politics.",
                "user": "u/BadLuckCharm1966"
            },
            {
                "text": "I'd be more interested if they boxed in zero gravity.",
                "user": "u/OtherOlive797"
            },
            {
                "text": "Weary",
                "user": "u/noahsmybro"
            },
            {
                "text": "I certainly think it’s interesting that both have a solid chance of dying in office. Not even of an assassination or anything like that but just because they’re old. Trump doesn’t seem to take very good care of himself and they’re both at the age where even minor issues can escalate rapidly.",
                "user": "u/Astrium6"
            }
        ],
        "processed": true
    },
    "1bpucjj": {
        "post": "What is NOT a dealbreaker BUT would be greatly disappointing to find out about your partner?",
        "user": "u/SkyeSerenade",
        "comments": [
            {
                "text": "They can only sleep on the same side of the bed as I do and want me to switch sides.",
                "user": "u/mooandcookies"
            },
            {
                "text": "My boyfriend and I have been together 11 years. I’ve had the same favorite TV show since before I met him, and he hates it. Obviously not a dealbreaker but it’s pretty disappointing! 😂",
                "user": "u/4thdrinkinstinctxx"
            },
            {
                "text": "When there's things they used to do with an ex but aren't interested in anymore. For example, I had an ex whose ex used to force them to do couples costumes at Halloween etc. I had never had a serious bf before, and desperately wanted to do a couples costume with him but he was OVER IT at that point and didn't want to :(",
                "user": "u/ChippyTheGreatest"
            },
            {
                "text": "Doesn't put bowls upside down in the dishwasher",
                "user": "u/Emotional_Molasses58"
            },
            {
                "text": "They go to Target and throw doormats on the floor to look at them and then just walk away and leave them on the floor.",
                "user": "u/RilohKeen"
            },
            {
                "text": "Putting unwanted items back in the wrong place at the supermarket.\n\n>!Becomes a dealbreaker when they leave refrigerated or frozen items outside of a fridge/freezer.!<",
                "user": "u/ReliefZealousideal84"
            },
            {
                "text": "My dad hates movies with subtitles. My mom is a foreign film buff. She has been trying to change him for DECADES. And while he'll sit through (and sometimes even enjoy) them on occasion, he'll still groan any time she suggests a movie with subtitles.\n\nThe ultimate disappointing non-dealbreaker.\n\n**EDIT:** Ok, I'm just going to add this here before anyone else asks if my dad can read. He's an oncologist. He's not dumb. He can keep up with the subtitles and the subject matter. He just does so much reading for work (he goes through medical journals like crazy) he wants to relax with something silly and mindless, that requires zero effort on his part. He feels the same way about tearjerkers (another of my mom's favorites) where people die slowly from some awful disease. He gets enough of that shit at work. But he'll occasionally sit through them for my mom. We just watched the old Julia Roberts film, Dying Young (where she nurses/falls in love with a young guy dying of cancer) and for half the film he was just looking at my mom with an expression that clearly read \"why the fuck would you do this to me?\"",
                "user": "u/_hootyowlscissors"
            },
            {
                "text": "when you watching a tv series together and he or she watches an episode without you. thats a betrayal.",
                "user": "u/CaptCojones"
            },
            {
                "text": "When you plan to watch your favourite movie together at the theatres but they already seen it with friends.",
                "user": "u/Moon_Jewel90"
            },
            {
                "text": "In college, watched the movie Donnie Darko for the first time and when it ended, I had so many questions and was analyzing the meaning behind it. Tried to talk to my then boyfriend and he seemed disinterested. Finally, after a half hour, he says \"can you please stop talking about it? It's just a movie. You are just supposed to enjoy it, not analyze it.\" \n\nNot a dealbreaker, but a huge disappointment.",
                "user": "u/littleirishpixie"
            },
            {
                "text": "If they are a sock-shoe-sock-shoe person and not a sock-sock-shoe-shoe person.",
                "user": "u/Ace-Ventura1934"
            }
        ],
        "processed": true
    },
    "1brn5zf": {
        "post": "What would  be your reaction if Donald Trump dies tonight?",
        "user": "u/kRe4ture",
        "comments": [
            {
                "text": "Well, my reaction would be that you should have a *very* strong alibi for tonight, just in case.",
                "user": "u/allegate"
            },
            {
                "text": "\"holy shit, what did/u/kRe4ture know that the rest of us didn't?!\"",
                "user": "u/pnut-buttr"
            },
            {
                "text": "\"Aw, shit... I can smell the conspiracy engines firing up now!\"",
                "user": "u/Only_Explanation7181"
            },
            {
                "text": "Wouldn't it be really weird if he actually drops dead tonight",
                "user": "u/Glum_Possibility5204"
            },
            {
                "text": "\"You should never say bad things about the dead, only good. Joan Crawford is dead… good!\" - Bette Davis",
                "user": "u/rambleriver"
            },
            {
                "text": "There's absolutely no way the conspiracy crowd would see it as just a normal thing that happens to old people. I'd be pretty worried tbh.",
                "user": "u/AnAdorableDogbaby"
            },
            {
                "text": "Thanks Obama!",
                "user": "u/AdBroad8817"
            },
            {
                "text": "I think it was Mark Twain that said while he'd never wish death on anyone, he's not been too upset at reading their obituary",
                "user": "u/llcucf80"
            },
            {
                "text": "Tonight - this weekend?  Well, it will all depend on if he returns in 3 days.",
                "user": "u/SensitivePineapple83"
            },
            {
                "text": "Look, I was out till 3 AM “all claws no laws” after a metal show last night. I’m bruised and hungover, and all I want to do is eat my weight in eggs Benedict. \n\nBut if I gotta go party with my people, I gotta go party with my people.",
                "user": "u/teebalicious"
            },
            {
                "text": "So anyway, I went outside and decided to do some yard work because it’s a beautiful spring day. Mid 40’s, sunny. A perfect day to spend outside and enjoy this beautiful day we get to enjoy. \n\nAnd even knowing all of that it still wouldn’t be the number one best thing to happen. And also probably laugh at his cult followers making weird AI images of him as an angel looking like Rambo and who replaces God in heaven since he fired him.\n\nIt will be a strange time, for sure.",
                "user": "u/marzipan_dumpling"
            }
        ],
        "processed": true
    },
    "1b8mbya": {
        "post": "In English, we use the phrase “righty tighty, lefty loosey” as a helpful reminder. What other languages have comparable common sayings?",
        "user": "u/R1PElv1s",
        "comments": [
            {
                "text": "Worked with a guy who spent 5 minutes trying to screw a stud into a part. When told it was a left hand thread... He changed hands and continued to screw it clockwise.\n\nHis name was Nail, because his parents couldn't spell Niall.\n\nHe also didn't know where he lived \"because his wife drove him everywhere\"\n\nI wish I was making this up.",
                "user": "u/BiggestNizzy"
            },
            {
                "text": "Rechts dreht die Uhr, so gehts zua\n\nAustrian saying for \"the clock turns right, thats how it gets tight\"",
                "user": "u/canyoutriforce"
            },
            {
                "text": "To remember the Alps we use the sentence „Ma con gran pena le reca giù“ in Italian, meaning „he carries them down with great suffering“.\n\nMarittime, Cozie, Graie, Pennine, Lepontine, Retiche, Carniche, Giulie.",
                "user": "u/JoeFalchetto"
            },
            {
                "text": "Clockwise, lockwise",
                "user": "u/nsa_k"
            },
            {
                "text": "In Swedish we have a phrase to remember the countries in Middle America from top to bottom:\n\nSwe: \"Gustav ber Elsa, hon nickar, kostar pengar\".\n\nEng: \"Gustav asks Elsa, she nods, (it) costs money\".\n\nCountries: Guatemala, Belize, El Salvador, Honduras, Nicaragua, Costa Rica, Panama",
                "user": "u/Merazim"
            },
            {
                "text": "\"solang das Deutsche Reich besteht, wird die schraube rechtsrum festgedreht\" \n\n\"as long as the German Reich exists, a screw is turned right to br tight.\"\n\nHistorically complicated, I know",
                "user": "u/Thrashgor"
            },
            {
                "text": "In irish you'd say \"Is minic an béal a bhriseann an srón\"\n\nbasically a phrase to remind someone to keep quiet. In translation \"It's often your mouth that breaks your nose\".",
                "user": "u/wolfeerine"
            },
            {
                "text": "In my country, everybody knows of Roy G Biv, who represents how colours appear in the spectrum",
                "user": "u/BatteryAcidCoffeeAU"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "In Spain we say \"la derecha aprieta, la izquierda libera\" (right oppresses (tightens), left frees)",
                "user": "u/Juanbledore"
            },
            {
                "text": "In French, we say \"A droite. Non ton autre droite putain !\"",
                "user": "u/ClumsyForLife"
            }
        ],
        "processed": true
    },
    "1bhk4f3": {
        "post": "What is actually healthy but people think is not?",
        "user": "u/Soren-J",
        "comments": [
            {
                "text": "Frozen fruits and vegetables. The modern flash-freeze technique preserves almost all of the nutrients and they are always picked when they are in season, so they are as nutritious as their fresh in-season counterparts, and more nutritious if it is not the season.",
                "user": "u/Apprehensive-Tip4987"
            },
            {
                "text": "Sport during pregnancy. Actually a lot of things are healthy during pregnancy theres just too much misinformation. If your doctor explicitly says no sport then yes. Do that. But if doctor says ok then go ahead",
                "user": "u/Sure-Morning-6904"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Doing literally nothing to decompress. Sometimes one just needs to breathe and look out a window.",
                "user": "u/Merrill1v"
            },
            {
                "text": "Crying.",
                "user": "u/Sudden-Let8709"
            },
            {
                "text": "Spending time alone.",
                "user": "u/wineblues2"
            },
            {
                "text": "Eating fats like avocados is actually healthy, despite what some think.",
                "user": "u/InflammatorySoapsuds"
            },
            {
                "text": "taking a break",
                "user": "u/shuuchyu"
            },
            {
                "text": "I'm looking for the answer \"Pizza\" .... Can anyone please tell me it's healthy?\n\n\nEdit: so many people making their own pizzas and they all sound amazingly healthy! Thanks for the suggestions....you're all an inspiration",
                "user": "u/robgod50"
            },
            {
                "text": "Silence. We've gotten so used to noise pollution, real silence has become anxiety inducing. Silence improves sleep, helps your brain process what you're learning, reduces stress, lowers blood pressure, the list goes on.",
                "user": "u/thatnameistakenalso"
            },
            {
                "text": "Admitting when you don't know something. Its okay to not have the answer. Too many people would rather bullshit an answer, than accept what they don't know.",
                "user": "u/HumpsyDumpsy"
            }
        ],
        "processed": true
    },
    "1blsjzk": {
        "post": "What addiction is the hardest to quit?",
        "user": "u/_broWTF",
        "comments": [
            {
                "text": "as a former active H addict i will say i would not wish withdrawals on anyone. they are truly  hellacious. i feel blessed to have gotten out of all that before fentanyl took over, i would be dead now probably",
                "user": "u/breeeepce"
            },
            {
                "text": "Quitting smoking was probably the hardest thing I ever did in my life. And I tried many times before I finally succeeded but I haven’t had a cigarette in 25 years now and I smoked for 25 years.",
                "user": "u/nivek48"
            },
            {
                "text": "Heroin worst shit everwas addicted to it for 7 years heavy, you need it to wake up, eat, piss, shit, sleep, you have to have it to do anything, and getting off is like nothing you can even imagine or compare it to, it literally made me suicidal coming off it, really, like I would have blown my brains out if there was a gun in my reach, I had to get on the methadone program and you gotta take that every single day, sucks. But I'm off dope and off the methadone, clean 6 months and will never in my life touch that shit ever in my life again, it's pure devil's blood. ",
                "user": "u/PhotographNational82"
            },
            {
                "text": "Cocaine was hard. \n\nBooze was harder.\n\nCancer sticks were the hardest. Took me 2 solid years of trying to quit. I’d go 2-3 days then have a whole pack. I finally waited until I got the flu really bad and haven’t smoked on cigarette in 2256 days! \n\nAccording to my app that’s 31578 cigarettes not smoked and over $200,00 not spent. The last pack I purchased was over $17.50 here in California.",
                "user": "u/thunderlips187"
            },
            {
                "text": "Long term benzodiazepines. Maybe deep alcohol use as well. Anything GABA related is hell, benzos if you want to quit often taken months maybe even a year just to get off slowly and then you're not guaranteed to feel normal/good for an extended period of time after that.\n\n\nIt's hell on earth and even heroin addicts will often say they'd rather kick heroin many times over than go through that.",
                "user": "u/muscletrain"
            },
            {
                "text": "I was a heavy smoker for 15 years. Quit cold turkey. Never was addicted to porn. I kicked a cocaine habit. \n\nBeing a high functioning alcoholic is probably something I'll never be able to beat. Trying to quit drinking hurts me physically and mentally so badly, and it doesn't really affect my life right now, so I justify not putting myself through it. I know I am shortening my life by not quitting, but I still just can't do it.",
                "user": "u/Appropriate_Swan_233"
            },
            {
                "text": "Ive heard a Harvard psychiatrist who specializes in addictions say the addiction that's hardest to treat is the one where the patient says that it makes them feel like a normal person. Like it makes them feel like everyone else. Because that's a really hard thing to give up, feeling normal.\n\nDidn't think this would blow up like this, check out Dr K on YouTube and Twitch. u/KAtusm didn't know you were so active on Reddit my bad sir I would have tagged you right away! r/healthygamerGG",
                "user": "u/Mechanists"
            },
            {
                "text": "Food addiction. Because you literally cannot quit, you just have to find a way to moderate your use without ever being able to.",
                "user": "u/BittenElspeth"
            },
            {
                "text": "eating disorders. you can't not eat. people don't have compassion for people who suffer from them either.",
                "user": "u/ShouldBeASavage"
            },
            {
                "text": "Nicotine for me, very hard to quit",
                "user": "u/StarCode5000"
            },
            {
                "text": "Alcohol. Withdrawals don’t just feel bad, it can kill you. So much worse than what we think until we’ve seen it.",
                "user": "u/DangerousMusic14"
            }
        ],
        "processed": true
    },
    "1b6p5kg": {
        "post": "What’s gotten so expensive that you no longer purchase it? ",
        "user": "u/schaudhery",
        "comments": [
            {
                "text": "Food from food trucks.\n\nI'm not spending $15 for a grilled cheese that I have to wait in the rain for.",
                "user": "u/just_hating"
            },
            {
                "text": "McDonald’s. Wtf happened to the dollar menu?! There ain’t nothing on there that costs a dollar.",
                "user": "u/Bruhhhhhhhhhhhhh"
            },
            {
                "text": "Mobile apps.  \nI’m absolutely infuriatingly tired of subscription services.   \nThe worst is that they let you download the app so they can claim it as a download, only to get stonewalled by a subscription page.  \nLet’s go back to a one time fee please.",
                "user": "u/SmallRocks"
            },
            {
                "text": "At this rate, shelter and food.",
                "user": "u/spjhon"
            },
            {
                "text": "Subway. Even the 6 inch subs are over $7 before chips and soda.",
                "user": "u/ManicPixieDreamPearl"
            },
            {
                "text": "I never buy chips unless they’re some kind of BOGO.",
                "user": "u/SensualEnema"
            },
            {
                "text": "It’s pretty damn expensive just to exist right now.",
                "user": "u/tokinreefer"
            },
            {
                "text": "McDonalds.  Not that I can't afford it, but I am not paying the current prices for cheap, processed food for on the go.  They are trying to be fancier, they should accept who they are and stick to be being cheap and convenient, it has always worked for them.",
                "user": "u/TrixieLurker"
            },
            {
                "text": "Frozen Pizzas are reaching the point of being more expensive than real pizza.",
                "user": "u/SmileAndWalkAway"
            },
            {
                "text": "Concert tickets.",
                "user": "u/Arthur_Boo_Radley"
            },
            {
                "text": "Greeting cards. $7? No way.\n\nEdit: almost 10k likes on this? Damn. Also. I get it. Go to dollar tree. I need a few hundred more people to suggest this please 😆😆",
                "user": "u/Amazing-Gazelle3685"
            }
        ],
        "processed": true
    },
    "1bbtu3l": {
        "post": "What is your deepest darkest secret?",
        "user": "u/RedditMyDiary",
        "comments": [
            {
                "text": "If you ever need help, then please know that there are many qualified people who would like to help you. \n\n* https://findahelpline.com/i/iasp (Global)\n* http://www.befrienders.org (Global)\n* https://988lifeline.org/chat (United States)\n* https://www.samaritans.org/how-we-can-help/contact-samaritan (United Kingdom)\n* https://www.lifeline.org.au/Get-Help (Australia) \n\nThere are crisis services worldwide that are trained to provide support. They are designed to give temporary relief from feelings that are overwhelming you and can help you get through a tough hour/night/week. Chat services, as well as phone numbers, are available on these sites.\n\nJust as you would see a doctor when you are sick, you deserve to take care of your mental health.",
                "user": "u/AskRedditModerators"
            },
            {
                "text": "My grandfather stole a red pepper shaker from an Italian restaurant many years ago. The year after he passed, we went to the same restaurant. In honor of him, I stole a parmesan shaker for a matching pair. R.I.P. Grandpa.",
                "user": "u/AlternianGamer99"
            },
            {
                "text": "I once ate a party platter of delicious tropical fruit during a tour in Honduras and blamed it on monkeys",
                "user": "u/Rumpleshite"
            },
            {
                "text": "I couldn't pick up the pieces after my divorce.  Would go weeks without showering or brushing my teeth.  I found my \"baby blanket\" from my youth in a trunk and wrapped it around myself that night.  Best sleep I had had in years.  I keep it in my bed since then.  I am a 42 year old man.",
                "user": "u/jrwhill"
            },
            {
                "text": "I farted so bad and smelly once they had to evacuate my Spanish class to search for a gas leak.",
                "user": "u/DaiperDaddy"
            },
            {
                "text": "When I was maybe 7ish I went to the grocery store with my mother.\n\nWhen she was checking out I went to turn the gumball machine to see if anyone left quarters in there and didn't spin it all the way.  Well one of them was broken and I spun the sucker until my pockets were full of gumballs.\n\nWhen we got in the car my mother asked what was in my pockets.   And I told her \"nothing\".  She still knows nothing to this day. \n\nShe did however say \"if one of those machines was broken and you just kept turning them, that's stealing.\"\n\nI sure fooled her!",
                "user": "u/firefistus"
            },
            {
                "text": "My dad had a pot pipe made of wood in the garage. I use to smoke out of it all the time because he didn't realize I knew it was there. Anyway, I didn't have a lighter one day and I used a blow torch in the garage to smoke out of it. completely destroyed the pipe. about 15 years later, my dad tells me about how he lost this pipe he made in his shop class in the 70s. Ooops",
                "user": "u/None"
            },
            {
                "text": "My fiancé and partner of almost 8 years broke up with me a few months ago. I’ve realized I was so emotionally dependent on him that I don’t know how to exist as my own person. I have suicidal thoughts sometimes from the stress/pain of not being able to be with him. No one really gets it. I genuinely think I will never love anyone as much as I love him, and I’m scared I’ll end up alone for the rest of my life.\n\nEDIT: Wow, thanks to everyone for leaving such sweet and inspiring comments. I am in an intensive therapy program right now, and have told others (including professionals) about the concerning thoughts and am being helped with those. It really does make a difference knowing that so many others have been through the same thing and have made it out ok on the other side - and for some of you, even better on the other side ❤️",
                "user": "u/yoshi7975"
            },
            {
                "text": "I’ve lived a boring non secretive life, but my great Grandfather once told me a story of when he killed a man with a baseball bat for trying to rob the bar that he owned, and the regulars of the bar stashed the body somewhere and nobody ever talked about it again. He then put his finger to his mouth and said “shh, don’t tell anyone”. So there ya go. Sorry Gramps.\n\nEdit: This happened in Brazil back in the 60’s. Gramps is long gone. Did it really happen? I have no idea, but it was Brazil … something similar to that probably happened during the time it took me to type this edit out. Brazil do be like that.",
                "user": "u/BrazillianNuts09"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            }
        ],
        "processed": true
    },
    "1b6aorq": {
        "post": "What is the most obvious sign a couple won't last long?",
        "user": "u/chiphotog",
        "comments": [
            {
                "text": "\"Having a kid will bring us closer together and things will get better\"",
                "user": "u/ConversationLeast902"
            },
            {
                "text": "I always find couples who post about how much they love eachother on social media break up pretty quick. I'm not talking about like one post but the excessive ones. Recent example being a girl I know who posted probably every other day about how this guy is her world, she'd be lost without him, she misses him when he's not there etc. they were together about 3 months total. I just find it so obvious.",
                "user": "u/JPK12794"
            },
            {
                "text": "Their communication just doesn’t improve over time. Being in my first real healthy relationship I’ve realized that both people need to be committed to their individual and collective growth to create a fulfilling, healthy relationship. If one or both people aren’t trying and make a habit of withholding their true thoughts and make no effort to make the small changes to eventually meet the other half way, it’s inevitable.",
                "user": "u/GodsBleedToo"
            },
            {
                "text": "After I was married about 3 years a coworker that had been married for a few moths asked how long we lasted before we ran out of stuff to talk about. \n\nI figured that was bad sign.",
                "user": "u/donttakerhisthewrong"
            },
            {
                "text": "Different argument styles. Shows contempt for spouse. Talks shit about each other to friends.",
                "user": "u/bkandwh"
            },
            {
                "text": "They casually show signs that they don't respect each other: it can be a lot of eye rolling, mocking, condescending laugh, casually saying \"you're so stupid\", embarrassing in front of friends...",
                "user": "u/smolbibeans"
            },
            {
                "text": "When they act as though they don’t like or respect you. And when you point that out they say you’re being too sensitive.",
                "user": "u/Barrack64"
            },
            {
                "text": "When 1 person really wants a threesome and the other person really doesn't want a threesome.",
                "user": "u/AloofusDoofus"
            },
            {
                "text": "See their conflict resolution process.",
                "user": "u/542Archiya124"
            },
            {
                "text": "One does not listen when one talks",
                "user": "u/New-Bonus5383"
            },
            {
                "text": "When they fight with each other in a passive aggressive way in front of friends. Went to this dinner once where the guy was showing off his new plasma TV, and it ended up with the girl throwing one of his awards into the TV to smash it. Really uncomfortable to be a guest there.",
                "user": "u/FUThead2016"
            }
        ],
        "processed": true
    },
    "1bgy0wh": {
        "post": "What is Slowly Killing People Without Their Knowledge?",
        "user": "u/LeosBigBook",
        "comments": [
            {
                "text": "lack of sleep; poor diet, lack of exercise",
                "user": "u/bottomfeeder52"
            },
            {
                "text": "Stress",
                "user": "u/DayDreamerAllDay1"
            },
            {
                "text": "lack of exercise/ sedentary lifestyle",
                "user": "u/Holly__Willy"
            },
            {
                "text": "Bad sleep hygiene. So overlooked as a danger and as a matter of fact even glorified because you are apparently cool that you sleep deprivate.\n\nHere is the bad news: There is no body adaptation to this and the nature hasnt figured out to adapt because we are the only species dumb enough to do this.",
                "user": "u/_HoundOfJustice"
            },
            {
                "text": "Loneliness. \n\nSeriously, people, we evolved as a eusocial species. We don’t just do better when we cooperate in groups, we need extensive contact with a small group of other people to stay healthy. \n\nHow many of us are starved for touch? For hugs and cuddling? For the sound of the voices of our loved ones? Loneliness kills just as sure as heart disease does.",
                "user": "u/Calamity-Gin"
            },
            {
                "text": "Colon cancer.\n\nIt's on pace to be the number one killer in young folk. Early symptoms can be easy to ignore or pass off.  You should always see a doctor if you have any of the symptoms. It's easy to treat if found early but most people don't see the doctor until symptoms have progressed.\n\nI know the American healthcare system sucks. But I got a Colonoscopy (that I had to pay out of pocket since I had no family history and was under the recommended age.) I had 8 polyps, 6 were precancerous. I was 37.\n\nEat your fiber, folks! It's insanely easy to add into your diet and is extremely beneficial to your health. \n\nAnd exercise! You don't have to do anything crazy just get up and intentionally move!\n\nETA: I didn't provide symptoms so people could Google and do their own search (but people are left replies with the symptoms!) My symptoms were literally blood when I wiped that would get better and worse. I also ended up with a fissure (worse than a colonoscopy). I wrote it off as hemorrhoids before finally bringing it up with a Doctor. I did have hemorrhoids and I did have an anal fissure which I don't think were related to the polyps. \n\nETA2: if you have any of the symptoms and your doctor is like \"you're probably fine\" ask for a referral (if you need one) to a GI doctor.  \n\nAlso I am happy to answer any questions. Poop talk is pretty stigmatized and I think there's a lot of embarrassment around it. I also don't want anyone to panic but knowledge is power.",
                "user": "u/myjobistablesok"
            },
            {
                "text": "Birthday cake. I know someone who had some every year, and eventually it killed him.",
                "user": "u/SaulgoodeXL"
            },
            {
                "text": "Alcohol",
                "user": "u/fairygodmother11"
            },
            {
                "text": "Shortening telomeres.",
                "user": "u/JunkRigger"
            },
            {
                "text": "Time",
                "user": "u/FalstaffsMind"
            },
            {
                "text": "Inactivity. If you work an office job that’s extremely stressful and then all you want to do on weekends is veg that’s understandable but at some point you need to get moving. Moving can look like anything though! It doesn’t have to be an intense workout. \n\nGo for a walk \n\nClean your house/apartment etc\n\nDo some light stretches \n\nPLAY! So many people don’t realize how important play is for the body. I get out with my kids and it didn’t occur to me initially how much play movement I didn’t do anymore until I started running around, jumping over puddles and the like with them. So many things we took for granted as kids gets harder as you become an adult. Plus, play is good for our brain and giving us endorphins. GO OUTSIDE AND PLAY! Get a jump rope, get some chalk and make yourself a hop scotch board, jump over the lines and cracks in a sidewalk or parking lot. Move in silly ways and fun ways just move!",
                "user": "u/justhewayouare"
            }
        ],
        "processed": true
    },
    "1bbfm85": {
        "post": "Who are the “evil” people that won in history?",
        "user": "u/jerkularcirc",
        "comments": [
            {
                "text": "Josef Mengele. The Nazi ‘Doctor of Death’ who escaped Germany to South America, started a family and despite being hunted by the US, German and Israeli governments for decades, didn’t even hide his identity by the end of his life. He drowned after having a stroke in 1979.",
                "user": "u/BarryCheckTheFuseBox"
            },
            {
                "text": "Pol Pot got to die in his sleep in 1998. He deserved far worse.",
                "user": "u/bguzewicz"
            },
            {
                "text": "Jimmy Saville.\n\n\nOne of his victims once escaped him, ran into the lobby and shouted that Saville was attempting to assault her. The people there simply laughed and mocked her.",
                "user": "u/Fiddlesticklin"
            },
            {
                "text": "Shirō Ishii  \n\nThe commander of Unit 731 and other facilities that performed medical experiments on human beings during WW2 in Japan\n\nSurgeons would cut open someone without anesthesia, ripping off limbs, or tearing out body parts. They’d sometimes tie a person to a pole outside in the freezing winter and then pour cold water on them to speed up the process of freezing their limbs. Once completely frozen they’d then smash the limbs off with a metal rod. \n\nSome of the most sickest, heinous shit imaginable. The part that angers me the most is that he, along with several others were granted immunity in exchange for information and research. Got away free and never was punished \n\nSkip to 1:17:06 for an interview with a surgeon who worked in one of these facilities \n\nhttps://youtu.be/akLVQdVyGMk?si=pQrcajvXwuW035g-",
                "user": "u/lonely-position162"
            },
            {
                "text": "Pol Pot. Got to grow old after slaughtering millions.",
                "user": "u/writeyourwayout"
            },
            {
                "text": "The guys that tortured Junko Furuta.\n\nThe man who killed Renée Hartevelt.",
                "user": "u/Weekly-Rest1033"
            },
            {
                "text": "pol pot.  he died in exile, if i remember right.",
                "user": "u/fortwaltonbleach"
            },
            {
                "text": "Leopold the 2nd",
                "user": "u/rextremendae2007"
            },
            {
                "text": "The Marcos family. \n\nThis family plundered almost the entire Philippine treasury during Ferdinand Marcos’ two decade rule. \n\nThey were exiled to Hawaii for a few years, but they were able to go back to the Philippines nevertheless. They [Imelda (the wife of Ferdinand Marcos), Imee (the daughter of FM), and Bongbong (the son)] were also able to run for politics again. \n\nDespite the records being unequivocally clear that the Marcoses plundered the Philippine government, (Imelda was actually convicted, but was never jailed for “humanitarian reasons”) the Marcoses are now back. \n\nImee is a senator, and Ferdinand “Bongbong” Marcos Jr. is now the president of the Philippines. \n\nImelda is also still convicted but has still not, and it looks like will never in her life, taste jail time. \n\nTrillions of pesos and tens of thousands of lives lost.",
                "user": "u/CardoDalisay69"
            },
            {
                "text": "Nobusuke Kishi, rapist of Manchuria and twice Prime Minister of Japan",
                "user": "u/Kell_Galain"
            },
            {
                "text": "Idi amin of Uganda",
                "user": "u/Kell_Galain"
            }
        ],
        "processed": true
    },
    "1b9e9a2": {
        "post": "How did the State Of The Union ( SOTU ) speech by President Biden go according to you? ",
        "user": "u/CoolConsciousness",
        "comments": [
            {
                "text": "Watch it on C-Span if you haven’t watched it yet. Don’t listen to pundits. Watch it uncut and see Biden for yourself.\n\nwww.vote.gov\n\nEdit:  [C-Span Link](https://www.youtube.com/live/7V01QvlQels?si=r0qFQ4Ig-nHgJJiM)",
                "user": "u/KZED73"
            },
            {
                "text": "“You can’t love your country only when you win”\n\nHell of a powerful statement. \n\nAlso, an hour + is a hell of a long time to talk. I know he has experience doing it but I can barely give a presentation on zoom for my design work for 30 mins. I can do it, it’s just unbelievable stressful to have and stick to a narrative. That’s a skill. I know the dude is old and has a ton of help crafting this speech, but I think he nailed it. \n\nPlus it’s not people like me he needs to convince to vote for him. I already am. I think the people on the fence, I hope this speaks to them",
                "user": "u/_heisenberg__"
            },
            {
                "text": "Hands-down best moment is when he was talking about the Bipartisan Border Deal and the GOP gaggle got itself into a heckle, and as he starts shooting off all the aspects of the deal…\n\n… camera cuts to Jaime Langford, the Republican Senator out of Oklahoma who crafted the legislation and was later censured for crafting the legislation, nodding and muttering “that’s true”",
                "user": "u/Ryan_McL"
            },
            {
                "text": "Did you see the speaker of the house nod in disgust to everything Biden says?",
                "user": "u/Bubbly-Sentence-4931"
            },
            {
                "text": "\"I want to raise teacher salaries!\"\n\nWell, yeah, so do I. Meanwhile in Tulsa, the city is voting on raising the mayor's salary from 110k/year to 190k. Because you know, inflation.",
                "user": "u/d00mslinger"
            },
            {
                "text": "I applauded at my screen when he talked about removing junk fees. Specifically when he said he was going to make cable companies and ticket companies show the final cost at the beginning.",
                "user": "u/dandroid126"
            },
            {
                "text": "The Rebuttal by Katie Britt was epic. It was like a Stephen King demon trying to reassure everyone she was human and not going to eat your liver when you fall asleep.",
                "user": "u/FlyPenFly"
            },
            {
                "text": "I found it funny that MTG wanted Biden to say the name of a woman that was murdered by an illegal immigrant and he used her troll to point out that they wouldn’t vote on an immigration reform bill.",
                "user": "u/yoshisama"
            },
            {
                "text": "I enjoyed it when his populist proposals were booed and he just smiled like checkmate. Made me feel like democracy is still breathing.",
                "user": "u/bluegenera"
            },
            {
                "text": "I thought he did great. Marjorie looked ridiculous and an embarrassment to her party though. Her interruption backfired big time",
                "user": "u/Objective_Regret2768"
            },
            {
                "text": "aside from occasional hiccups, I think it is a great speech. Even Mike Johnson agrees with a lot of his points.\n\nMTG is the typical clown, but looked like Biden was ready with a witty comeback.\n\nThe Republican response afterward was pathetic with bad acting and melodramatic over the top performance though. I’ve seen better performance from elementary school plays.",
                "user": "u/aeolus811tw"
            }
        ],
        "processed": true
    },
    "1befoih": {
        "post": "If you died as an atheist and then met God, what would you say to him?",
        "user": "u/Pristine_Fox_3633",
        "comments": [
            {
                "text": "Oh",
                "user": "u/Amazing_Finance1269"
            },
            {
                "text": "Hey, where have you been?!",
                "user": "u/lonelygalexy"
            },
            {
                "text": "Holy shit God from Bible???????????????",
                "user": "u/theEluminator"
            },
            {
                "text": "\"You won't believe what people down there are doing in your name!\"  \nor  \n\"You need a better PR team\"",
                "user": "u/Strange1_au"
            },
            {
                "text": "So.. ummm... which one are you?",
                "user": "u/neuser_"
            },
            {
                "text": "I’m genuinely as shocked as you are",
                "user": "u/Couldofbeenanemail"
            },
            {
                "text": "After almost 5 years working with pediatric neurosurgery i would just ask \"why?\"",
                "user": "u/Instruction_No"
            },
            {
                "text": "\"...Do you take constructive criticism?\"",
                "user": "u/TOPSIturvy"
            },
            {
                "text": "You don't look like Alanis Morissette...",
                "user": "u/Big-Draw-9661"
            },
            {
                "text": "I'd like to talk to your manager please.",
                "user": "u/findabuffalo"
            },
            {
                "text": "Good job on \"boobs\", big fan",
                "user": "u/nowhereman136"
            }
        ],
        "processed": true
    },
    "1b8xm3n": {
        "post": "If you could telephathically say something to all 8 billion people on earth, what would you say? ",
        "user": "u/ComprehensiveMix2305",
        "comments": [
            {
                "text": "Hi I'm god please send 10% of your net worth to this account \\_\\_\\_\\_",
                "user": "u/JackhorseBowman"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "You’re the chosen one, don’t tell the others",
                "user": "u/RonnieBobs"
            },
            {
                "text": "I would count down from 1000. The resulting hour or so of absolute chaos and panic would be hilarious as I get closer and closer to zero.",
                "user": "u/Skank-Pit"
            },
            {
                "text": "Why have the sacrifices stopped? I'm hungry",
                "user": "u/SurvivingWow"
            },
            {
                "text": "I would just scream, no language barrier just scream.",
                "user": "u/Federal-Bat-7419"
            },
            {
                "text": "*I know what you do when no one's watching*",
                "user": "u/Ellsworth_Chewie"
            },
            {
                "text": "Game saved successfully.",
                "user": "u/Gysburne"
            },
            {
                "text": "\"Stop being a douchebag and start being nice now.\"",
                "user": "u/PolishPower335"
            },
            {
                "text": "Wake up..",
                "user": "u/Turbulent-Role4998"
            }
        ],
        "processed": true
    },
    "1bgy1i5": {
        "post": "What is something legal that you’re extremely addicted to?",
        "user": "u/Dani0873",
        "comments": [
            {
                "text": "The internet",
                "user": "u/None"
            },
            {
                "text": "Buying shit I don’t need",
                "user": "u/dan_scape"
            },
            {
                "text": "Shopping. Sounds ridiculous but I don’t remember the last time I didn’t spend money for a whole 24 hours. Definitely working on it, but spending money can definitely become a problem. ",
                "user": "u/Apprehensive-Scar336"
            },
            {
                "text": "Sugar\n\nThat shit is extremely addictive",
                "user": "u/TruePace3"
            },
            {
                "text": "Video games",
                "user": "u/baileyitp"
            },
            {
                "text": "Social media?",
                "user": "u/Shoddy-Mushroom-872"
            },
            {
                "text": "Alcohol.  I haven't had any in 24 years, but it's best practice to assume that I'm still addicted.",
                "user": "u/rimshot101"
            },
            {
                "text": "Chocolate. It's a problem. I need to stop, but I'm pretty much addicted, because without it, days are horrible.",
                "user": "u/Distinct-Entity_2231"
            },
            {
                "text": "Food. I've got a terrible food addiction that's comparable to my 600 lb life type of addiction.  It's a real fuckin monkey on my back.  I don't like to talk about it on here much though because then I get a bunch of commenters on here telling me how unhealthy that is ECT.  I Know!  For Christ sake, I know.   Anywho, I hope everyone's having a nice day. Happy St Patricks day.",
                "user": "u/Physical-Tea-3493"
            },
            {
                "text": "Alcohol. And Reddit ffs.",
                "user": "u/there_is_no_spoon1"
            }
        ],
        "processed": true
    },
    "1bi1te7": {
        "post": "Be honest, why are you single? ",
        "user": "u/Journey217",
        "comments": [
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "Husband died, don’t want another one.",
                "user": "u/Wienerwrld"
            },
            {
                "text": "I dont have it in me to share my space with another person, I like my solitude.",
                "user": "u/JayNoi91"
            },
            {
                "text": "i get attached too easily, cuz I havent been loved my whole life. If someone gives me the tiniest bit of attention im done.",
                "user": "u/Mojito_999"
            },
            {
                "text": "I do not leave the house",
                "user": "u/Traditional-Guava376"
            },
            {
                "text": "[removed]",
                "user": "u/None"
            },
            {
                "text": "People don't seem to like me like that.",
                "user": "u/Intelligent_Loan_540"
            },
            {
                "text": "Wife passed away in 2012, left me with four kids to raise by myself. Now I'm retired and the kids are adults and I just don't want to mess with another relationship",
                "user": "u/DryFoundation2323"
            },
            {
                "text": "I don't care anymore that I'm single.",
                "user": "u/Hot_Speech900"
            },
            {
                "text": "Havnt met someone I want to be with that also wants to be with me",
                "user": "u/Afa1234"
            },
            {
                "text": "my google maps timeline from last year showed that i did not go more than 10 miles from my house. I have never been so depressed about an image.",
                "user": "u/Adorable-Chemistry64"
            }
        ],
        "processed": true
    },
    "1b8sfer": {
        "post": "What's a piece of advice you've received that initially seemed strange but turned out to be remarkably insightful?",
        "user": "u/deepsafferentk00",
        "comments": [
            {
                "text": "This isn't exactly advice but my dad used to talk to me and send me stuff about all these cool technological breakthroughs. I can remember things like smart roads, and Crisper, and new solar panel efficiency. And we would talk about the new fusion breakthroughs and just cutting-edge stuff that I like to read about. \n\nSo, my dad died about 6 months ago, suddenly and awful and me and my siblings were talking, and we realized he did the same thing to them, but more suited to their interests. My sister was all medical stuff, and my brother was all sports. We didn't realize until after he was gone that my dad used to research and read about his children's interests so he would have stuff to talk about with us. And it kinda wrecked me. \n\n My dad was always great, but we never realized just how great he was. So I guess the advice was, \"Get to know your kids. Share in their interests.\"",
                "user": "u/CleanMonty"
            },
            {
                "text": "This is not mine but something I read somewhere \n\nBut essentially a girl was practicing archery and kept messing up and the instructor told her \n\n“You’re failing because you’re too focused on the target and not your own actions”\n\nShe proceeded to say that it was the best life advice she had ever gotten.",
                "user": "u/GreyKoala_"
            },
            {
                "text": "We as humans tend to pick up the habits of the people we hang out with, so surround yourself with people whose habits you actually want to emulate.\n\nEDIT: All this means is, for example, if you're trying to quit smoking, avoid hanging out with heavy smokers. Or if you're trying to be more active, find friends who love the gym.",
                "user": "u/inubasket"
            },
            {
                "text": "“If it was easy, everyone would do it.” \n\nMy father, the retired engine machinist",
                "user": "u/pudge1824george"
            },
            {
                "text": "You need to get out of your own way. \n\n\n\nWe are so often our own barrier to what we want.",
                "user": "u/LordyIHopeThereIsPie"
            },
            {
                "text": "Progress, not perfection. \n\nHelped a lot to hear it when I did.",
                "user": "u/TheSunniestofBros"
            },
            {
                "text": "“Everyone is either going through a storm, coming out of the storm, or preparing to enter a storm. That is the cycle of life until you die” \n\n15 yr old me: Damn nana that is such a negative point of view. \n30s me: holy shit nana was right",
                "user": "u/bellabbr"
            },
            {
                "text": "“Some people need to be excluded from social plans even if it makes you feel like a bad person”\n\nFor context, a person in our friend group always killed the vibe and had tantrums and finally my friend gave me this advice. She said I was so lovey and caring and inclusive but (that advice.)",
                "user": "u/Not-From-Pakistan"
            },
            {
                "text": "When you move the first thing you set up is your bedroom.  When everything is chaos and you're exhausted from moving boxes all day you have a place to crash that is ready for you.",
                "user": "u/SuperstitiousPigeon5"
            },
            {
                "text": "When I was training to be a machinist, my instructor told me to use a calculator. He immediately followed it with, \"I am not your math teacher, and neither is your employer. Your math teacher wanted you to do it by hand to prove that you understood what you were doing and what steps it took to get there. Your employer cares about it getting done quickly and accurately. And that means using a calculator.\"\n\n\nIt was a good lesson about motivation and expectation, when it's tempting to think of a binary right/wrong.",
                "user": "u/Blenderhead36"
            },
            {
                "text": "My first boss told me just before firing me: you know how to work efficiently, but you don't know how to look like you are working efficiently.\n\nLater in life hit me: people will look for percieved value even more than the real one you give. \n\nSo my advice in work environments is: look like you are busy, if u finish thing on date doesn't matter if u needed 2 days and spent 3 on Reddit (like I am just now lol) or u spent the entire week deep into it. Look, busy.",
                "user": "u/Enekovitz"
            }
        ],
        "processed": true
    },
    "1bk5rgs": {
        "post": "Police officers of reddit, what are some things innocent people do that make them seem suspicious?",
        "user": "u/NeatEhEff",
        "comments": [
            {
                "text": "these comments are killing me. it’s like when you go through TSA and think “oh my god, do i have a bomb on me?!?!” when you absolutely don’t.",
                "user": "u/lilbunnie08"
            },
            {
                "text": "I know this isn’t what was asked, but I’ve always been told, if you want to look inconspicuous around police, pick your nose. Nobody picks their nose if they think they’re being watched",
                "user": "u/Altruistic_Box_8307"
            },
            {
                "text": "Retired police here from UK. Innocent people seem to confess everything even when not a crime as they're so desperate not to be in trouble. Example  - knocking on doors for information. Guy answers door and immediately started to confess his tyres are a little bald and he has some dodgy cigarettes and he did accidents drop some litter. Like dude..chill out, it's fine.",
                "user": "u/None"
            },
            {
                "text": "Former LEO.  I can tell you the most helpful thing for you, yet most infuriating (to the LEO) is to keep your mouth shut.  Just, you know, quit talking.  It will be much better for you in the long run.  I was never looking to just jam somebody up, but man people get themselves in so much trouble with their mouth.",
                "user": "u/Intrepid-Bison-2016"
            },
            {
                "text": "I was a fire investigator for awhile. It was talking a lot. Now some people just talk a lot when they get nervous and that's easy to tell. Like those people aren't actually talking about anything, they're just saying words at you. \n\nThe suspicious ones are the ones who are clearly trying to talk you directly to where they've set up their diversion but can't just stop talking about it and adding more and more and more details. To the point where they've \"remembered\" too much about what happened.",
                "user": "u/fireinvestigator113"
            },
            {
                "text": "My friend got pulled over as a car full of us were heading from a bar to his place to continue the party. He gets out of the drivers seat and just runs (we were prob 100 yards from his apartment complex.) So the other four of us get out of the car. Since the cop ran after the guy driving, the rest of us took off running too in the opposite direction. \n\nWell we ran towards this unfinished apartment complex that was being built. Backup came in droves and quickly. My one buddy hid in the insulation and avoided getting caught. My two other buddies got caught and went to jail. \n\nI also got caught. But pretended like I didn’t know any of them…was just along for the ride to an after party. Well I asked the officer for a ride home since Uber didn’t exist yet in this small North Dakota town - was also winter. On the ride home, I realize I’m out of cigarettes. So I asked the cop to pull into the gas station real quick near my house so that I could gets eggs and milk for the morning. He kind of looks at me like “WTF?”… but pulls in. So I of course get eggs, milk, and cigarettes. lol. I couldn’t believe it but def a nice gesture from the guy",
                "user": "u/zford150"
            },
            {
                "text": "I had an officer clarify unintentional suspicious activity, if it helps. \n\nIt was a super hot day, and an officer was just sitting in his car in the hot sun in the parking lot with his window rolled down. I was walking to my car and told him it was pretty hot out and I was heading to taco bell. Asked him if he wanted me to grab him a drink or something while I was there. He said no, he was good. So I hopped in my car and started to pull out of the parking lot. I noticed the officer started pulling out of his spot. I started driving to taco bell down the road, and sure enough, the officer was following me. I pulled into the taco bell parking lot and parked. The officer pulled up his car behind mine blocking me in. He started asking all sorts of questions about my personal life, where do I work, and so on. He eventually just said, \"What you just did was SUPER suspicious.\" I asked how being nice to someone is suspicious, and he just put it into drive and drove off. I started walking into taco bell and noticed he discretely pulled into a parking lot across the street. I know the taco bell peeps pretty well, so I went in there for an entire hour just chillin, eating, and generally socializing. Afterwards, I left, started driving to a gas station, and the officer pulled out of the parking lot and started following me along with TWO other police cars. Suddenly I had 3 police cars just following me all over town for the next 15 minutes. They eventually pulled away and that was it. \n\nSo I guess being nice to police officers is considered extremely suspicious. :/",
                "user": "u/RpTheHotrod"
            },
            {
                "text": "\"I'm not a cop but\"... Never change reddit",
                "user": "u/Jakewolf123"
            },
            {
                "text": "I once sat in on a criminal trial of a guy who was arrested with 2 others on gun and drug charges. The cop who pulled them over took the stand. He was being asked about the reason he pulled them over for the traffic stop that led to the cops finding the drugs and the gun.\n\nIf I recall correctly, they had expired plates or something like that, but the cop obviously couldn’t see that in the speed trap. So the attorney asked why he pulled onto the road and started following them in the first place. I shit you not, the cop said it was because they were driving exactly the speed limit, and none of the people in the car turned their heads to look at the cop when they drove past. \n\nHe said that was suspicious, because everyone speeds on that road. So they must have been doing something wrong if they weren’t speeding. The expired plates gave him the probable cause, but the suspicion came from them just obeying the law. Since then, I never have driven exactly the speed limit. On the highway, I’m at 8 or 9 mph over the speed limit if I’m trying to make good time. If I’m in no rush, I keep it around 5 or 6 over. If I get a Waze notification that there’s a cop coming up, I’ll drop down to 3 or 4 over. But never the exact speed limit.\n\nThat never sat right with me. Moral of the story is that cops can pretty much pull you over whenever they want. Even if you’ve done nothing wrong, they can make something up. It’s shitty.",
                "user": "u/ShitfacedGrizzlyBear"
            },
            {
                "text": "Run... lol my friend would see cops and just bolt down the street in the opposite direction after eyeballin em for a few secs.... they'd blast sirens, make a U-ey and drive after him... for nothing lol... he just thought it was fun to fuck with em, if they caught up to him he'd just be like... \"hi officers, need somethin?\" they'd search him or his bag, but he never had stuff...  \nMakes good practice haha",
                "user": "u/Legitimate_Two_3531"
            }
        ],
        "processed": true
    },
    "1bnbhjm": {
        "post": "[Serious] What are realistic ways someone can make $300-$1000 a month outside of their day job?",
        "user": "u/GothamKnight3",
        "comments": [
            {
                "text": "**Attention! [Serious] Tag Notice**\n\n* [Jokes, puns, and off-topic comments are not permitted](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_6-) in **any** comment, parent or child.\n\n* Parent comments that aren't from the target group will be removed, along with their child replies.\n\n* Report comments that violate these rules.\n\nPosts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*",
                "user": "u/AutoModerator"
            },
            {
                "text": "Call your local car dealerships and ask them if they need drivers. \n\nThey usually need people to go grab some cars from other dealerships around your state or province during the weekends. They will pay cash and all you need is a driver's licence. \n\nMy dad is retired and he does this when he needs a bit of extra cash.",
                "user": "u/lordpanda"
            },
            {
                "text": "Get added to some catering company's on-call lists. They'll hit you up when they have larger events and need more staff. Usually pays about $25-$30 an hour. Sometimes more in HCOL areas. And you generally get gratuity.",
                "user": "u/wannaloseitloseit"
            },
            {
                "text": "Not even kidding, I use to help my mother-in-law shower her mother every Thursday for $50 (a day!)  \n\n\nShe had a bingo group, and my name got passed around, and now I have a very real side gig cleaning old people... but it's solid money.",
                "user": "u/a_burdie_from_hell"
            },
            {
                "text": "Dog or cat sitting. I used to do this around twice a month and could make between $300-500 depending on the length of the job.",
                "user": "u/hinleybear13"
            },
            {
                "text": "Dog walking - I make a $1000 a month walking two dogs a day (20 mins each), down the street from my house during lunch break.",
                "user": "u/pradaquasimodo"
            },
            {
                "text": "I became a notary in my state and take mobile signing whenever I can. I work a normal 9-5 and do loan closings probably two or three times a week.\n\nSigning can pay anywhere from $30 an instance to $250 an instance",
                "user": "u/Trinimaninmass"
            },
            {
                "text": "Piano tuning.\n\nTakes a bit of time to learn, but the hardware is relatively inexpensive, and once you’re good at it, you can have a piano tuned in less than 2 hours. Standard pay is between $100-$150 per tuning. And in most metro areas, there is more work than there is tuners to do it all.",
                "user": "u/jerryondrums"
            },
            {
                "text": "I drive a wealthy old lady who (wisely) no longer wants to drive herself. Once or twice a week and only if I have the time. My fee is $39/hr. Most of the time she goes to a phys rehab center that's two minutes from where I live. I drop her off, she tells me how long she'll be, I go home and faff around on Reddit or play with the dogs, and pick her back up again when it's time.\n\nBonus: After her husband passed away, she wanted me to have his wine collection (she doesn't drink). I demurred but she insisted, so I took about 175 bottles over the summer. Some of the them are worth four figures.",
                "user": "u/DaytonaDemon"
            },
            {
                "text": "There was a high school kid with one of those spinning pressure washers that came to my neighborhood and knocked on people’s doors and asked if they wanted their driveways pressure washed right then and there for just $50. Didn’t take him long and he easily made over $500 in that afternoon.",
                "user": "u/hobbitybobbit"
            },
            {
                "text": "If you live near a university or academic medical center, there are some research studies that pay decently well",
                "user": "u/bonc826"
            }
        ],
        "processed": false
    },
    "1bnpw0j": {
        "post": "What's weird about your body?",
        "user": "u/Jesus-Chr",
        "comments": [
            {
                "text": "My proportions are all over the place.\n\nI used to study art. In drawing class, we had to study human proportions using our hands in strange positions and our bodies in front of a mirror. I got a bad grade, was told that my proportions were wrong. I had to go show the teacher that, yes, my thighs are unusually long, my pinkies abnormally short etc. \n\nMy grade was changed",
                "user": "u/isabellepeppergreen"
            },
            {
                "text": "I was born with a webbed hand. Had a bunch of surgeries to correct it but my hand is smaller than my normal hand and my co workers call me Tiny Paw",
                "user": "u/buckeyemountain"
            },
            {
                "text": "If I have to pee really bad I get a sharp pain in my molars.",
                "user": "u/qOJOb"
            },
            {
                "text": "My fingerprints have almost faded away.  I’m 56, and I can’t use those fingerprint readers for anything.  It happened to my mom, and now my 31-year old daughters are going.  It’s weird!",
                "user": "u/feelingmyage"
            },
            {
                "text": "My right ear has a little point at the top… like an elf. My son’s right ear has a notch, like it’s missing the extra I have… weird!",
                "user": "u/Heardaboutthat"
            },
            {
                "text": "My body does not make it's own antibodies. So once a week for the last 15 years, I've had to get an infusion of antibodies that are pulled from plasma donations. \n\nIf you donate plasma- thank you for keeping me alive!",
                "user": "u/stumphead11"
            },
            {
                "text": "My birthmark is on my inner ass cheek and it looks like I missed a spot when wiping.",
                "user": "u/The_Shitlipz"
            }
        ],
        "processed": false
    },
    "1bpg9du": {
        "post": "Women of reddit, what are some unwritten examples of girl code?",
        "user": "u/Specific-Voice3301",
        "comments": [
            {
                "text": "Always tell a woman - even a stranger - about a wardrobe malfunction eg skirt hooked into panties at the back after a restroom visit.",
                "user": "u/Crew_Emphasis"
            },
            {
                "text": "That look that says “help me leave this conversation/interaction”.",
                "user": "u/Apprehensive_Pickle3"
            },
            {
                "text": "If she says \"can you check me\" you will let her walk in front of you and you will do the most inconspicuous as possible scan of her ass area for any red stains, then report accordingly.",
                "user": "u/mang0fandang0"
            },
            {
                "text": "Be generous with the hair ties so long as they’re plentiful…but if you have just one left?\n\n**You guard that shit with your LIFE**…until you get more.",
                "user": "u/_Halboro_"
            },
            {
                "text": "Wait until your friend gets inside before pulling away",
                "user": "u/Flutterflut"
            },
            {
                "text": "Always watch your friend's drink if she leaves on the table in a club.",
                "user": "u/AshamedClassroom413"
            },
            {
                "text": "Help a girl out when she is stuck with period problems \n\nHelp a girl out if she’s sexually harassed, followed etc",
                "user": "u/PeterDuttonsButtWipe"
            },
            {
                "text": "if a random woman comes up to you pretending to know you, you’ve know her for your whole life",
                "user": "u/Emergency_Can_8"
            },
            {
                "text": "If a woman compliments your dress and it has pockets you must immediately put your hands in said pockets and say the words “IT HAS POCKETS!!!”",
                "user": "u/big_data_mike"
            },
            {
                "text": "You will casually hang around behind a fellow lady blocking the view of her adjusting her knickers if asked.",
                "user": "u/Livid_Willow5689"
            },
            {
                "text": "If you have the means, spare a square.",
                "user": "u/Equivalent_Delays_97"
            }
        ],
        "processed": false
    },
    "1bkp6qk": {
        "post": "What is the oddest thing you thought was ok/normal and ended up being a medical problem?",
        "user": "u/Prudent_Tip4118",
        "comments": [
            {
                "text": "I thought I pulled a muscle playing with my dogs one day. One week later I finally go to the hospital because the pain is getting worse. Turns out I suffer from a genetic blood clotting condition and had a two foot log clot in my leg and multiple pulmonary embolisms on my lungs. Doctor was legit surprised I was alive.",
                "user": "u/EchoRespite"
            },
            {
                "text": "It took my lungs collapsing at 17 years old before doctors realized I wasn’t breathing in deeply enough to expand the bottom half of my lungs for basically my whole life. They asked why I never complained about shortness of breath. I never knew breathing was supposed to be easier than what I was experiencing.",
                "user": "u/honeybeebzzz"
            },
            {
                "text": "Until I was 16 I thought everyone got stomach cramps a few times a day. Turns out I'm lactose intolerant. ",
                "user": "u/go_eat_worms"
            },
            {
                "text": "My family told me I would randomly “space out”, although I never remembered, all thought it was normal. Turned out, I was having “absence seizures”. We only found that out at a routine doctor’s appointment, just conversing with the doc, when I guess I just came to and the doctor said she wanted to get a bunch of tests done. Been an epileptic for almost 17 years now.\n\nEdit: I woke up to all these upvotes and replies and was shocked, tbh to see how many of my Reddit fam has or had what I have. Unfortunately, my Epilepsy has evolved into tonic clonic seizures, I rarely have absence’s anymore, but had one focal back in November. For anyone who has friends and/or family who has seizures and Epilepsy, thank you for being there for them. Just know, we appreciate you all. For all that HAVE seizures and Epilepsy, UNITE!!! Love you all Reddit fam, you’re the best.",
                "user": "u/Loves_me_tacos125"
            },
            {
                "text": "That pulled muscle was actually a collapsed lung. After days of hot baths, massages, trying to relax-nah, nothing helped. No wonder.",
                "user": "u/bmbmwmfm2"
            },
            {
                "text": "General stomach pain that I dismissed as perhaps constipation, but which would - every few years or so - send me to emergency worrying that it was my appendix. I was kicked out of emergency departments at different hospitals multiple times, because it was not.\n\nI moved to a new city and was lucky enough to score a decent family doctor who took it seriously. She told me she was rather impressed with the amount of \"referred pain\" I was having and that I should go straight to emergency. I replied that there was not a hope in hell I would subject myself to that kind of humiliation again. No way. \n\nShe sent me for a CAT scan and lo and behold, it WAS my appendix. She referred me to a surgeon, and on the day of my surgery no one in the hospital seemed particularly interested in my condition, I think most of the medical staff thought I was having unnecessary surgery though, curiously, they were MUCH nicer to me afterward. I recall a lot of people standing over me in the recovery room.\n\nThe surgeon called me to come in for a meeting a couple of weeks later, and when I walked into his office he had an odd expression on his face. He told me my appendix was many times the normal size, probably because it had been infected and healed over the years, building up scar tissue. He asked me if I minded if he wrote it up in a medical paper or a textbook (I can't remember exactly which - he taught at the university). I gather at the time \"grumbling appendixes\" were a bit of a unicorn and there had been much debate over whether they were real. So I guess my appendix settled that argument in the medical community once and for all.",
                "user": "u/GoOutside62"
            },
            {
                "text": "I'd have these really minor facial twitches, like a single small muscle in my upper lip or eyebrow. Nothing even severe enough to be visible by others. However, they'd last for a few weeks straight, even while I was trying to sleep.\n\nI didn't think twice about it. They always went away on their own, after all!\n\nAfter I suddenly went blind in my left eye and got diagnosed with multiple sclerosis, I connected the dots.\n\nEdit: Facial twitches are normal! Just because you have twitches often doesn't mean you have a problem, especially if you don't have any other reason to believe you have multiple sclerosis or any other disease. My twitches were CONSTANT for WEEKS. And even then, there are other, less serious (and probably more likely!) things that can cause that. Please don't let my comment stress you out.",
                "user": "u/hillbilly-man"
            },
            {
                "text": "Losing weight suddenly got a little easier, and I assumed it was due to my efforts. Happy with my success, I buckled down harder (funny how it's easy to keep \"being good\" when you're actually seeing results). I lost more! It actually got to be almost easy. I thought I was doing such a great job! Turns out it was cancer. I guess I should have known something was up, but I honestly thought I was just doing a really great job with my diet and exercise. Had 4 surgeries and treatment and I'm doing well. Now I'm on meds with all kinds of side effects, including weight gain. Yay. But I'm alive, and so much better off than many others. I've only gained a little bit back, despite working really hard not to.",
                "user": "u/Grilled_Cheese10"
            },
            {
                "text": "As a kid I had anxiety and my heart would\nrace.  Fast.  It felt like a hummingbird in my chest and would abruptly pause and resume a normal pace after a few minutes.  \n\nAt age 23 I had a bad reaction to a tricyclic antidepressant called imipramine and was rushed to the hospital. They ran an EKG and that rapid heart rate was a congenital defect known as Wolfe Parkinson White syndrome. \n\nBasically I had an accessory or 2nd electrical system in my heart that would cause a  “short circuit” occasionally and my heart rate would skyrocket.  It was cured via a procedure using radio waves to form scar tissue around the accessory node because the impulse could not conduct through the tissue. \n\nNo problems since.",
                "user": "u/Ambitious_Doubt_1101"
            },
            {
                "text": "Get the fuck out of this thread if you have health anxiety, lol",
                "user": "u/poopinmyguts"
            },
            {
                "text": "A random sharp pain above my right ear and my tongue curling slightly.  I thought it was just old age. Doc recognized it instantly as something wrong with my tongue.  The cancer has been cured for seven years.",
                "user": "u/cwsjr2323"
            }
        ],
        "processed": false
    },
    "1bc9vz8": {
        "post": "What is badly named, and what is a better name for it?",
        "user": "u/johnnylgarfield",
        "comments": [
            {
                "text": "Otto Preminger wrote his own biography and failed to title it Otto-Biogrphy. \n\nOnce in a lifetime pun, and he just threw it away.",
                "user": "u/hippo717"
            },
            {
                "text": "Abbreviation should be a much shorter word",
                "user": "u/Masked_Daisy"
            },
            {
                "text": "Why is a group of squid called a shoal when it should be called a squad?",
                "user": "u/xdark_realityx"
            },
            {
                "text": "Now You See Me 2.\n\nShould have been Now You Don't.",
                "user": "u/igenus44"
            },
            {
                "text": "“Lisp” should be renamed to anything without an S in it.",
                "user": "u/cornedbeef101"
            },
            {
                "text": "I keep seeing people say that contractions should be birthquakes.",
                "user": "u/ssssobtaostobs"
            },
            {
                "text": "Dentures.  Should be Substitooths",
                "user": "u/donkeyknuckles"
            },
            {
                "text": "Weather forecast is boring. Weather prophecy is awesome",
                "user": "u/dire18"
            },
            {
                "text": " Any bacon alternative that is not named Fācon is an abomination",
                "user": "u/RitaPoonismysister"
            },
            {
                "text": "Iceland and greenland",
                "user": "u/None"
            },
            {
                "text": "Jet ski. Dumb name. Obviously it is a Boatercycle.",
                "user": "u/KYbywayofNY"
            }
        ],
        "processed": false
    },
    "1b843u6": {
        "post": "What is normal now but won't be in 25 years?",
        "user": "u/Every_Cartoonist3965",
        "comments": [
            {
                "text": "We’re slowly seeing paperwork die out in hospitals as nurses. I often think about down the line when employees will think it’s crazy I worked when they still used paper. Everything is online now.",
                "user": "u/rawr_Im_a_duck"
            },
            {
                "text": "Hopefully family vloggers",
                "user": "u/EarthAcceptable8123"
            },
            {
                "text": "The thin illusion of privacy",
                "user": "u/KobilD"
            },
            {
                "text": "56754 different streaming services which amount to more than anyone ever paid for cable",
                "user": "u/The_write_speak"
            },
            {
                "text": "Ordering food and drink from a human in a drive thru",
                "user": "u/Holdtheline2192"
            },
            {
                "text": "Retiring",
                "user": "u/MasterBattis"
            },
            {
                "text": "long commutes, hopefully",
                "user": "u/CaffeineKage"
            },
            {
                "text": "I hope it will be single use plastic",
                "user": "u/-Jana-Foxxy-"
            },
            {
                "text": "the current shit of an education system",
                "user": "u/West-Calligrapher691"
            },
            {
                "text": "Probably a lot of the insects and wildlife around you, basically anything that doesn’t thrive by eating trash the way raccoons and crows do. \n\nEven if not every species goes extinct, we may soon live in a world where few have ever actually seen a butterfly, dragonfly, ladybug, toad, firefly, etc. simply existing outside. Just like how many of us today have never actually looked up and seen a sky full of stars and the Milky Way, thanks to light pollution.",
                "user": "u/Charitard123"
            }
        ],
        "processed": false
    },
    "1bo3573": {
        "post": "What was affordable 50 years ago that now only the rich can buy? ",
        "user": "u/[deleted]",
        "comments": [
            {
                "text": "Disney has gotten crazy expensive. \n\nGoing to sports or concerts.",
                "user": "u/Urbanredneck2"
            },
            {
                "text": "A summer house. I know many families that have an old house on a lake that they go to in the summers. It’s been passed down for a couple generations. Nobody in the current generation could afford one but some how a family with a single income bought it 50 years ago and the man’s wife and wife and kids would spend the whole summer there and he would go up on weekends.",
                "user": "u/spidereater"
            },
            {
                "text": "Natural fiber clothing. Feels impossible to find anything affordable that has mostly cotton.\n\nEdit: I’ve compiled a list of most of what was recommended. Sorry if I missed something. \n\nT-shirts:\nMichael’s craft stores,\nDuluth trading,\nWalmart,\nComfort colors on Amazon,\nCarhartt,\nUniqlo,\nCostco,\nGo 2 clothing co on amazon\n\nSecondhand:\neBay (Pendleton wool flannels),\nThrift/vintage stores,\nThredUp.com,\nPoshmark\n\nMaterials to make your own clothing:\nFoxfibre,\nJoann’s,\nLocal fabric store,\nVintage/secondhand fabrics,\n\nGeneral clothing:\nUniqlo,\nH&M for linen,\nTarget,\nOld navy,\nQuince,\nLand’s End,\nSvaha,\nLL Bean,\nPact\n\nUndies:\nHaynes,\nIntimissimi (lingerie),\nKirkland,\nJockey (100% cotton panties)",
                "user": "u/l_ally"
            },
            {
                "text": "Tickets for events.",
                "user": "u/shingaladaz"
            },
            {
                "text": "A middle income starter home.",
                "user": "u/Blutroice"
            },
            {
                "text": "Chicken wings, nobody should be paying $2 per wing",
                "user": "u/utopianexile"
            },
            {
                "text": "Disneyland",
                "user": "u/Altruistic_Kick2068"
            },
            {
                "text": "In the UK, the obvious answer to this is houses. A very large proportion of 1st time buyers now get help with the deposit from the bank of mum and dad",
                "user": "u/Tigweg"
            },
            {
                "text": "A new comic book from 50 years ago.",
                "user": "u/PoignantPoint22"
            },
            {
                "text": "Single engine airplanes",
                "user": "u/ItsyBitsySPYderman"
            },
            {
                "text": "A house",
                "user": "u/Top-Ranger-289"
            }
        ],
        "processed": false
    },
    "1banzs6": {
        "post": "What do men think women like but they really don’t?",
        "user": "u/Man-Spider1",
        "comments": [
            {
                "text": "Driving stupidly with me in the car to try and show off. It’s an absolute no from me.",
                "user": "u/What___Do"
            },
            {
                "text": "When they play the clit like a banjo.",
                "user": "u/Cawaica"
            },
            {
                "text": "My ex seemed to think I was interested in hearing about the sex he had with women before me. No thanks, dude.",
                "user": "u/milkawhat"
            },
            {
                "text": "Showing off/flexing/comparing yourself to others in order to brag. Some guys think it makes them look cool, but it just makes them look insecure. ",
                "user": "u/Future-Technician937"
            },
            {
                "text": "Jack hammer fingering. Wtf are you doing?",
                "user": "u/Flibity_flobity"
            },
            {
                "text": "Being a “tough guy”…. Eg starting fights in public over shit that’s not worth a fight. You don’t look big and bad, just embarrassing",
                "user": "u/None"
            },
            {
                "text": "Fingering by literally ramming your fingers in and out of our pussy. Just no, please no. Unless you’re extremely wet, it’s going to hurt. The “luring move” on the other hand has a power over me that’s unmatched…\n\nLuring move explained: You put your two fingers inside and curl them upwards. You keep your hand steady (so no in and out movement) and then you apply pressure to the inside of the vagina by making a lurking move. It’s basically moving your two fingers towards you against the upper wall of the vagina repeatedly. For me personally, the faster the better. It hits the inner g spot and completely paralyzes my with pleasure. Many women swear by it. Thank me later ;)",
                "user": "u/AmelieMay00"
            },
            {
                "text": "Not taking no for an answer. Instead thinking they just need to try more until the answer changes.",
                "user": "u/vermillion55"
            },
            {
                "text": "Some guys seem to think I'll only respect them if they're the authority on *everything*, including my own hobbies and my very technical job. I know sometimes they're just being assholes, but sometimes it really does feel like they're conditioned to think they *have* to position themselves above me on every last little thing or I'll be put off. They get twitchy if they can't just totally circumscribe my experience and knowledge and intellect with their own.\n\nI somewhat sympathize, social conditioning is a hell of a drug, but goddamn. I don't want you to reassure my poor lady brain that I can turn to you for literally anything, I want you to stop \"correcting\" me about things I know more than you about.",
                "user": "u/nukeditagain"
            },
            {
                "text": "Unsolicited dick pics",
                "user": "u/Indigo-Waterfall"
            },
            {
                "text": "Alpha asshole personalities, like if they specifically say “I’m an alpha” and act like dicks. it’s the dumbest shit I’ve ever heard. Genuine, gentle, sweetheart guys are 100000 times more attractive than “I’m an alpha” douche bags.",
                "user": "u/Z_Bunny__"
            }
        ],
        "processed": false
    },
    "1bhrs61": {
        "post": "What’s a civilization ending scenario that most people aren’t aware of?",
        "user": "u/AlgorithmOmega",
        "comments": [
            {
                "text": "A slow-burn collapse is much more likely than a single major event to cause something major.",
                "user": "u/FatRascal_"
            },
            {
                "text": "As a kid I learned that if a gamma ray burst is coming right at us we really can’t do anything about it, we’d just get fried. Kept me up for a few nights.",
                "user": "u/JackC1126"
            },
            {
                "text": "Corn virus.\n\n20% of Human Civilization's calories, right there.",
                "user": "u/VoraciousTrees"
            },
            {
                "text": "Peak phosphorus: https://en.m.wikipedia.org/wiki/Peak_phosphorus\n\nIt’s an important resource for production of fertilizer and dwindling supplies could have a significant impact on global food security. Maybe an exaggeration to say that it would end civilization but it could be a contributing factor to a cascade of problems that have a devastating impact on modern civilization.",
                "user": "u/ThatPancreatitisGuy"
            },
            {
                "text": "A Gamma Ray Burst could fry our planet at any moment with 0 warning. Which means you should not waste time worrying about it because no one can do anything about it.",
                "user": "u/hielispace"
            },
            {
                "text": "The Big Rip is one of the most interesting possible ways for the universe to die because it happens on scales a human could meaningfully experience. You'd go from a perfectly functional solar system (in an endless void) to the End of All Matter in the span of a couple of months.\n\nFirst the planets drift away from the star, but you could survive if you have a way of producing heat.\n\nThen the planets and the sun explode as gravity can no longer hold them together.\n\nIf you're in a spaceship, you can survive for a few more minutes before your atoms are ripped apart by space itself.",
                "user": "u/IndigoFenix"
            },
            {
                "text": "I rarely see the media being concerned about water.",
                "user": "u/TalkingToTalk"
            },
            {
                "text": "I'm an archaeologist. Civilization isn't really used in the field anymore, but that's a different topic.\n\nMost cultures/societies don't really have a traumatic end date. They mostly just change or have new things that alter their cultural constructs or socio-political constructs. New ideas, inventions, innovations, attitudes, languages, external stuff going on, internal stuff going on, religious beliefs, etc. These can alter a culture pretty quickly without it being traumatic or even noteworthy.\n\nBut for something  huge that most people aren't aware of?\n\nAgricultural destruction of arable land. Often from irrigation in the past, but often it's just the soil \"wearing out\" (so to speak).\n\n[https://www.sciencedirect.com/science/article/abs/pii/S0013935120315966#:\\~:text=Arable%20land%20is%20facing%20the,characteristics%20and%20reshape%20microbial%20communities](https://www.sciencedirect.com/science/article/abs/pii/S0013935120315966#:~:text=Arable%20land%20is%20facing%20the,characteristics%20and%20reshape%20microbial%20communities).\n\nIt's something that happened a number of times in newly formed agricultural lands.",
                "user": "u/Vio_"
            },
            {
                "text": "Solar flare knocking out electric grids. Not only restarting them from a  black start is highly complicated, if the transformers are fried, there aren't enough replacements, and to manufacture more we need, you guessed it, electricity.\n\nThe estimations are that a solar flare on the level of  Carrington event, which happened not two centuries ago, would cause trillions in damages and set back civilization for decades.",
                "user": "u/Clear-Gas"
            },
            {
                "text": "The aliens finally coming back to harvest their livestock of humans.  \n\n\nEdit: My first comment to get over 1K, thanks all.",
                "user": "u/Majestic-Reception-2"
            },
            {
                "text": "There’s a fear that the trend of human body temp decreasing over time will expose us to more rates of fatal fungal infections. Most people are now less than 98.6 degrees F",
                "user": "u/adawnfire"
            }
        ],
        "processed": false
    }
}